{
  "name": "Al-Fil",
  "name_translations": {
    "ar": "الفيل",
    "en": "The Elephant",
    "id": "Gajah"
  },
  "number_of_ayah": 5,
  "number_of_surah": 105,
  "place": "Mecca",
  "recitations": [{
    "name": "Mishari Rashid al-`Afasy",
    "audio_url": "https://download.quranicaudio.com/quran/mishaari_raashid_al_3afaasee/105.mp3"
  }, {
    "name": "Abdur-Rahman as-Sudais",
    "audio_url": "https://download.quranicaudio.com/quran/abdurrahmaan_as-sudays/105.mp3"
  }, {
    "name": "Saad al-Ghamdi",
    "audio_url": "https://download.quranicaudio.com/quran/sa3d_al-ghaamidi/complete/105.mp3"
  }],
  "type": "Makkiyah",
  "verses": [{
    "number": 1,
    "text": "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ أَلَمْ تَرَ كَيْفَ فَعَلَ رَبُّكَ بِأَصْحَٰبِ ٱلْفِيلِ",
    "translation_en": "Have you not considered, [O Muhammad], how your Lord dealt with the companions of the elephant?",
    "translation_id": "Apakah kamu tidak memperhatikan bagaimana Tuhanmu telah bertindak terhadap tentara bergajah?"
  }, {
    "number": 2,
    "text": "أَلَمْ يَجْعَلْ كَيْدَهُمْ فِى تَضْلِيلٍ",
    "translation_en": "Did He not make their plan into misguidance?",
    "translation_id": "Bukankah Dia telah menjadikan tipu daya mereka (untuk menghancurkan Ka'bah) itu sia-sia?"
  }, {
    "number": 3,
    "text": "وَأَرْسَلَ عَلَيْهِمْ طَيْرًا أَبَابِيلَ",
    "translation_en": "And He sent against them birds in flocks,",
    "translation_id": "dan Dia mengirimkan kapada mereka burung yang berbondong-bondong,"
  }, {
    "number": 4,
    "text": "تَرْمِيهِم بِحِجَارَةٍ مِّن سِجِّيلٍ",
    "translation_en": "Striking them with stones of hard clay,",
    "translation_id": "yang melempari mereka dengan batu (berasal) dari tanah yang terbakar,"
  }, {
    "number": 5,
    "text": "فَجَعَلَهُمْ كَعَصْفٍ مَّأْكُولٍۭ",
    "translation_en": "And He made them like eaten straw.",
    "translation_id": "lalu Dia menjadikan mereka seperti daun-daun yang dimakan (ulat)."
  }],
  "tafsir": {
    "id": {
      "kemenag": {
        "name": "Kemenag",
        "source": "Aplikasi Quran Kementrian Agama Republik Indonesia",
        "text": {
          "1": "Dalam surah ini, Allah mengingatkan Nabi Muhammad dan pengikutnya dengan suatu peristiwa yang menunjukkan betapa besarnya kekuasaan Allah. Peristiwa itu adalah penyerbuan tentara gajah yang dipimpin oleh panglima Abrahah dari Yaman untuk menundukkan penduduk Mekah dan meruntuhkan Ka'bah. Akan tetapi, Allah membinasakan mereka sebelum maksud yang jahat itu tercapai. Peristiwa Gajah adalah suatu peristiwa yang paling terkenal di kalangan bangsa Arab, sehingga peristiwa ini mereka jadikan patokan tanggal bagi peristiwa-peristiwa lainnya.\n\nKesimpulan riwayatnya adalah bahwa seorang panglima perang yang berkuasa di Yaman ingin menguasai Ka'bah dan menghancurkannya, dengan maksud melarang orang-orang Arab mengerjakan haji ke Ka'bah. Lalu bala tentaranya bergerak menuju Ka'bah disertai beberapa ekor gajah untuk menakut-nakuti. Ketika iring-iringan angkatan perang tersebut tiba di suatu tempat bernama Muqammas (suatu tempat yang berdekatan dengan Mekah), mereka beristirahat di sana. Panglima perang mengirim utusannya kepada penduduk Mekah untuk menyampaikan maksudnya, yaitu bukan untuk memerangi penduduk tetapi untuk menghancurkan Ka'bah. Penduduk Mekah menjadi ketakutan dan lari ke gunung-gunung di sekeliling Ka'bah untuk melihat dari jauh apa yang akan terjadi dan apa yang akan dilakukan oleh panglima perang tersebut.\n\nDalam surah ini pula Allah menjelaskan apa yang terjadi terhadap pasukan bergajah dalam bentuk pertanyaan bahwa Muhammad tidak mengetahui keadaan yang sangat aneh dan peristiwa yang sangat dahsyat yang membuktikan kekuasaan Allah, ilmu dan hikmah-Nya yang tinggi terhadap tentara gajah yang ingin menghancurkan Ka'bah. Kejadian itu berbeda dengan kejadian lainnya yang mempunyai sebab dan akibat.",
          "2": "Dalam ayat ini, Allah menjelaskan bahwa Ia telah menggagalkan tipu muslihat mereka yang hendak menghancurkan Ka'bah.\n\nAllah mengungkapkan cara menggagalkan tipu daya mereka, yaitu dengan mengirimkan pasukan burung yang berbondong-bondong melempari mereka dengan batu-batu yang berasal dari tanah sehingga menjadikan mereka hancur-lebur dan daging mereka beterbangan ke mana-mana. Maka tentara gajah menjadi laksana daun-daun yang dimakan ulat.",
          "3": "Dalam ayat ini, Allah menjelaskan bahwa Ia telah menggagalkan tipu muslihat mereka yang hendak menghancurkan Ka'bah.\n\nAllah mengungkapkan cara menggagalkan tipu daya mereka, yaitu dengan mengirimkan pasukan burung yang berbondong-bondong melempari mereka dengan batu-batu yang berasal dari tanah sehingga menjadikan mereka hancur-lebur dan daging mereka beterbangan ke mana-mana. Maka tentara gajah menjadi laksana daun-daun yang dimakan ulat.",
          "4": "Dalam ayat ini, Allah menjelaskan bahwa Ia telah menggagalkan tipu muslihat mereka yang hendak menghancurkan Ka'bah.\n\nAllah mengungkapkan cara menggagalkan tipu daya mereka, yaitu dengan mengirimkan pasukan burung yang berbondong-bondong melempari mereka dengan batu-batu yang berasal dari tanah sehingga menjadikan mereka hancur-lebur dan daging mereka beterbangan ke mana-mana. Maka tentara gajah menjadi laksana daun-daun yang dimakan ulat.",
          "5": "Dalam ayat ini, Allah menjelaskan bahwa Ia telah menggagalkan tipu muslihat mereka yang hendak menghancurkan Ka'bah.\n\nAllah mengungkapkan cara menggagalkan tipu daya mereka, yaitu dengan mengirimkan pasukan burung yang berbondong-bondong melempari mereka dengan batu-batu yang berasal dari tanah sehingga menjadikan mereka hancur-lebur dan daging mereka beterbangan ke mana-mana. Maka tentara gajah menjadi laksana daun-daun yang dimakan ulat."
        }
      }
    }
  }
}