{
  "name": "Al-Qasas",
  "name_translations": {
    "ar": "القصص",
    "en": "The Stories",
    "id": "Kisah-Kisah"
  },
  "number_of_ayah": 88,
  "number_of_surah": 28,
  "place": "Mecca",
  "recitations": [{
    "name": "Mishari Rashid al-`Afasy",
    "audio_url": "https://download.quranicaudio.com/quran/mishaari_raashid_al_3afaasee/028.mp3"
  }, {
    "name": "Abdur-Rahman as-Sudais",
    "audio_url": "https://download.quranicaudio.com/quran/abdurrahmaan_as-sudays/028.mp3"
  }, {
    "name": "Saad al-Ghamdi",
    "audio_url": "https://download.quranicaudio.com/quran/sa3d_al-ghaamidi/complete/028.mp3"
  }],
  "type": "Makkiyah",
  "verses": [{
    "number": 1,
    "text": "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ طسٓمٓ",
    "translation_en": "Ta, Seen, Meem.",
    "translation_id": "Thaa Siin Miim"
  }, {
    "number": 2,
    "text": "تِلْكَ ءَايَٰتُ ٱلْكِتَٰبِ ٱلْمُبِينِ",
    "translation_en": "These are the verses of the clear Book.",
    "translation_id": "Ini adalah ayat-ayat Kitab (Al Quran) yang nyata (dari Allah)."
  }, {
    "number": 3,
    "text": "نَتْلُوا۟ عَلَيْكَ مِن نَّبَإِ مُوسَىٰ وَفِرْعَوْنَ بِٱلْحَقِّ لِقَوْمٍ يُؤْمِنُونَ",
    "translation_en": "We recite to you from the news of Moses and Pharaoh in truth for a people who believe.",
    "translation_id": "Kami membacakan kepadamu sebagian dari kisah Musa dan Fir'aun dengan benar untuk orang-orang yang beriman."
  }, {
    "number": 4,
    "text": "إِنَّ فِرْعَوْنَ عَلَا فِى ٱلْأَرْضِ وَجَعَلَ أَهْلَهَا شِيَعًا يَسْتَضْعِفُ طَآئِفَةً مِّنْهُمْ يُذَبِّحُ أَبْنَآءَهُمْ وَيَسْتَحْىِۦ نِسَآءَهُمْ إِنَّهُۥ كَانَ مِنَ ٱلْمُفْسِدِينَ",
    "translation_en": "Indeed, Pharaoh exalted himself in the land and made its people into factions, oppressing a sector among them, slaughtering their [newborn] sons and keeping their females alive. Indeed, he was of the corrupters.",
    "translation_id": "Sesungguhnya Fir'aun telah berbuat sewenang-wenang di muka bumi dan menjadikan penduduknya berpecah belah, dengan menindas segolongan dari mereka, menyembelih anak laki-laki mereka dan membiarkan hidup anak-anak perempuan mereka. Sesungguhnya Fir'aun termasuk orang-orang yang berbuat kerusakan."
  }, {
    "number": 5,
    "text": "وَنُرِيدُ أَن نَّمُنَّ عَلَى ٱلَّذِينَ ٱسْتُضْعِفُوا۟ فِى ٱلْأَرْضِ وَنَجْعَلَهُمْ أَئِمَّةً وَنَجْعَلَهُمُ ٱلْوَٰرِثِينَ",
    "translation_en": "And We wanted to confer favor upon those who were oppressed in the land and make them leaders and make them inheritors",
    "translation_id": "Dan Kami hendak memberi karunia kepada orang-orang yang tertindas di bumi (Mesir) itu dan hendak menjadikan mereka pemimpin dan menjadikan mereka orang-orang yang mewarisi (bumi),"
  }, {
    "number": 6,
    "text": "وَنُمَكِّنَ لَهُمْ فِى ٱلْأَرْضِ وَنُرِىَ فِرْعَوْنَ وَهَٰمَٰنَ وَجُنُودَهُمَا مِنْهُم مَّا كَانُوا۟ يَحْذَرُونَ",
    "translation_en": "And establish them in the land and show Pharaoh and [his minister] Haman and their soldiers through them that which they had feared.",
    "translation_id": "dan akan Kami teguhkan kedudukan mereka di muka bumi dan akan Kami perlihatkan kepada Fir'aun dan Haman beserta tentaranya apa yang selalu mereka khawatirkan dari mereka itu."
  }, {
    "number": 7,
    "text": "وَأَوْحَيْنَآ إِلَىٰٓ أُمِّ مُوسَىٰٓ أَنْ أَرْضِعِيهِ فَإِذَا خِفْتِ عَلَيْهِ فَأَلْقِيهِ فِى ٱلْيَمِّ وَلَا تَخَافِى وَلَا تَحْزَنِىٓ إِنَّا رَآدُّوهُ إِلَيْكِ وَجَاعِلُوهُ مِنَ ٱلْمُرْسَلِينَ",
    "translation_en": "And We inspired to the mother of Moses, \"Suckle him; but when you fear for him, cast him into the river and do not fear and do not grieve. Indeed, We will return him to you and will make him [one] of the messengers.\"",
    "translation_id": "Dan kami ilhamkan kepada ibu Musa; \"Susuilah dia, dan apabila kamu khawatir terhadapnya maka jatuhkanlah dia ke sungai (Nil). Dan janganlah kamu khawatir dan janganlah (pula) bersedih hati, karena sesungguhnya Kami akan mengembalikannya kepadamu, dan menjadikannya (salah seorang) dari para rasul."
  }, {
    "number": 8,
    "text": "فَٱلْتَقَطَهُۥٓ ءَالُ فِرْعَوْنَ لِيَكُونَ لَهُمْ عَدُوًّا وَحَزَنًا إِنَّ فِرْعَوْنَ وَهَٰمَٰنَ وَجُنُودَهُمَا كَانُوا۟ خَٰطِـِٔينَ",
    "translation_en": "And the family of Pharaoh picked him up [out of the river] so that he would become to them an enemy and a [cause of] grief. Indeed, Pharaoh and Haman and their soldiers were deliberate sinners.",
    "translation_id": "Maka dipungutlah ia oleh keluarga Fir'aun yang akibatnya dia menjadi musuh dan kesedihan bagi mereka. Sesungguhnya Fir'aun dan Haman beserta tentaranya adalah orang-orang yang bersalah."
  }, {
    "number": 9,
    "text": "وَقَالَتِ ٱمْرَأَتُ فِرْعَوْنَ قُرَّتُ عَيْنٍ لِّى وَلَكَ لَا تَقْتُلُوهُ عَسَىٰٓ أَن يَنفَعَنَآ أَوْ نَتَّخِذَهُۥ وَلَدًا وَهُمْ لَا يَشْعُرُونَ",
    "translation_en": "And the wife of Pharaoh said, \"[He will be] a comfort of the eye for me and for you. Do not kill him; perhaps he may benefit us, or we may adopt him as a son.\" And they perceived not.",
    "translation_id": "Dan berkatalah isteri Fir'aun: \"(Ia) adalah penyejuk mata hati bagiku dan bagimu. Janganlah kamu membunuhnya, mudah-mudahan ia bermanfaat kepada kita atau kita ambil ia menjadi anak\", sedang mereka tiada menyadari."
  }, {
    "number": 10,
    "text": "وَأَصْبَحَ فُؤَادُ أُمِّ مُوسَىٰ فَٰرِغًا إِن كَادَتْ لَتُبْدِى بِهِۦ لَوْلَآ أَن رَّبَطْنَا عَلَىٰ قَلْبِهَا لِتَكُونَ مِنَ ٱلْمُؤْمِنِينَ",
    "translation_en": "And the heart of Moses' mother became empty [of all else]. She was about to disclose [the matter concerning] him had We not bound fast her heart that she would be of the believers.",
    "translation_id": "Dan menjadi kosonglah hati ibu Musa. Sesungguhnya hampir saja ia menyatakan rahasia tentang Musa, seandainya tidak Kami teguhkan hatinya, supaya ia termasuk orang-orang yang percaya (kepada janji Allah)."
  }, {
    "number": 11,
    "text": "وَقَالَتْ لِأُخْتِهِۦ قُصِّيهِ فَبَصُرَتْ بِهِۦ عَن جُنُبٍ وَهُمْ لَا يَشْعُرُونَ",
    "translation_en": "And she said to his sister, \"Follow him\"; so she watched him from a distance while they perceived not.",
    "translation_id": "Dan berkatalah ibu Musa kepada saudara Musa yang perempuan: \"Ikutilah dia\" Maka kelihatanlah olehnya Musa dari jauh, sedang mereka tidak mengetahuinya,"
  }, {
    "number": 12,
    "text": "وَحَرَّمْنَا عَلَيْهِ ٱلْمَرَاضِعَ مِن قَبْلُ فَقَالَتْ هَلْ أَدُلُّكُمْ عَلَىٰٓ أَهْلِ بَيْتٍ يَكْفُلُونَهُۥ لَكُمْ وَهُمْ لَهُۥ نَٰصِحُونَ",
    "translation_en": "And We had prevented from him [all] wet nurses before, so she said, \"Shall I direct you to a household that will be responsible for him for you while they are to him [for his upbringing] sincere?\"",
    "translation_id": "dan Kami cegah Musa dari menyusu kepada perempuan-perempuan yang mau menyusui(nya) sebelum itu; maka berkatalah saudara Musa: \"Maukah kamu aku tunjukkan kepadamu ahlul bait yang akan memeliharanya untukmu dan mereka dapat berlaku baik kepadanya?\"."
  }, {
    "number": 13,
    "text": "فَرَدَدْنَٰهُ إِلَىٰٓ أُمِّهِۦ كَىْ تَقَرَّ عَيْنُهَا وَلَا تَحْزَنَ وَلِتَعْلَمَ أَنَّ وَعْدَ ٱللَّهِ حَقٌّ وَلَٰكِنَّ أَكْثَرَهُمْ لَا يَعْلَمُونَ",
    "translation_en": "So We restored him to his mother that she might be content and not grieve and that she would know that the promise of Allah is true. But most of the people do not know.",
    "translation_id": "Maka kami kembalikan Musa kepada ibunya, supaya senang hatinya dan tidak berduka cita dan supaya ia mengetahui bahwa janji Allah itu adalah benar, tetapi kebanyakan manusia tidak mengetahuinya."
  }, {
    "number": 14,
    "text": "وَلَمَّا بَلَغَ أَشُدَّهُۥ وَٱسْتَوَىٰٓ ءَاتَيْنَٰهُ حُكْمًا وَعِلْمًا وَكَذَٰلِكَ نَجْزِى ٱلْمُحْسِنِينَ",
    "translation_en": "And when he attained his full strength and was [mentally] mature, We bestowed upon him judgement and knowledge. And thus do We reward the doers of good.",
    "translation_id": "Dan setelah Musa cukup umur dan sempurna akalnya, Kami berikan kepadanya hikmah (kenabian) dan pengetahuan. Dan demikianlah Kami memberi balasan kepada orang-orang yang berbuat baik."
  }, {
    "number": 15,
    "text": "وَدَخَلَ ٱلْمَدِينَةَ عَلَىٰ حِينِ غَفْلَةٍ مِّنْ أَهْلِهَا فَوَجَدَ فِيهَا رَجُلَيْنِ يَقْتَتِلَانِ هَٰذَا مِن شِيعَتِهِۦ وَهَٰذَا مِنْ عَدُوِّهِۦ فَٱسْتَغَٰثَهُ ٱلَّذِى مِن شِيعَتِهِۦ عَلَى ٱلَّذِى مِنْ عَدُوِّهِۦ فَوَكَزَهُۥ مُوسَىٰ فَقَضَىٰ عَلَيْهِ قَالَ هَٰذَا مِنْ عَمَلِ ٱلشَّيْطَٰنِ إِنَّهُۥ عَدُوٌّ مُّضِلٌّ مُّبِينٌ",
    "translation_en": "And he entered the city at a time of inattention by its people and found therein two men fighting: one from his faction and one from among his enemy. And the one from his faction called for help to him against the one from his enemy, so Moses struck him and [unintentionally] killed him. [Moses] said, \"This is from the work of Satan. Indeed, he is a manifest, misleading enemy.\"",
    "translation_id": "Dan Musa masuk ke kota (Memphis) ketika penduduknya sedang lengah, maka didapatinya di dalam kota itu dua orang laki-laki yang berkelahi; yang seorang dari golongannya (Bani Israil) dan seorang (lagi) dari musuhnya (kaum Fir'aun). Maka orang yang dari golongannya meminta pertolongan kepadanya, untuk mengalahkan orang yang dari musuhnya lalu Musa meninjunya, dan matilah musuhnya itu. Musa berkata: \"Ini adalah perbuatan syaitan sesungguhnya syaitan itu adalah musuh yang menyesatkan lagi nyata (permusuhannya)."
  }, {
    "number": 16,
    "text": "قَالَ رَبِّ إِنِّى ظَلَمْتُ نَفْسِى فَٱغْفِرْ لِى فَغَفَرَ لَهُۥٓ إِنَّهُۥ هُوَ ٱلْغَفُورُ ٱلرَّحِيمُ",
    "translation_en": "He said, \"My Lord, indeed I have wronged myself, so forgive me,\" and He forgave him. Indeed, He is the Forgiving, the Merciful.",
    "translation_id": "Musa mendoa: \"Ya Tuhanku, sesungguhnya aku telah menganiaya diriku sendiri karena itu ampunilah aku\". Maka Allah mengampuninya, sesungguhnya Allah Dialah Yang Maha Pengampun lagi Maha Penyayang."
  }, {
    "number": 17,
    "text": "قَالَ رَبِّ بِمَآ أَنْعَمْتَ عَلَىَّ فَلَنْ أَكُونَ ظَهِيرًا لِّلْمُجْرِمِينَ",
    "translation_en": "He said, \"My Lord, for the favor You bestowed upon me, I will never be an assistant to the criminals.\"",
    "translation_id": "Musa berkata: \"Ya Tuhanku, demi nikmat yang telah Engkau anugerahkan kepadaku, aku sekali-kali tiada akan menjadi penolong bagi orang-orang yang berdosa\"."
  }, {
    "number": 18,
    "text": "فَأَصْبَحَ فِى ٱلْمَدِينَةِ خَآئِفًا يَتَرَقَّبُ فَإِذَا ٱلَّذِى ٱسْتَنصَرَهُۥ بِٱلْأَمْسِ يَسْتَصْرِخُهُۥ قَالَ لَهُۥ مُوسَىٰٓ إِنَّكَ لَغَوِىٌّ مُّبِينٌ",
    "translation_en": "And he became inside the city fearful and anticipating [exposure], when suddenly the one who sought his help the previous day cried out to him [once again]. Moses said to him, \"Indeed, you are an evident, [persistent] deviator.\"",
    "translation_id": "Karena itu, jadilah Musa di kota itu merasa takut menunggu-nunggu dengan khawatir (akibat perbuatannya), maka tiba-tiba orang yang meminta pertolongan kemarin berteriak meminta pertolongan kepadanya. Musa berkata kepadanya: \"Sesungguhnya kamu benar-benar orang sesat yang nyata (kesesatannya)\"."
  }, {
    "number": 19,
    "text": "فَلَمَّآ أَنْ أَرَادَ أَن يَبْطِشَ بِٱلَّذِى هُوَ عَدُوٌّ لَّهُمَا قَالَ يَٰمُوسَىٰٓ أَتُرِيدُ أَن تَقْتُلَنِى كَمَا قَتَلْتَ نَفْسًۢا بِٱلْأَمْسِ إِن تُرِيدُ إِلَّآ أَن تَكُونَ جَبَّارًا فِى ٱلْأَرْضِ وَمَا تُرِيدُ أَن تَكُونَ مِنَ ٱلْمُصْلِحِينَ",
    "translation_en": "And when he wanted to strike the one who was an enemy to both of them, he said, \"O Moses, do you intend to kill me as you killed someone yesterday? You only want to be a tyrant in the land and do not want to be of the amenders.\"",
    "translation_id": "Maka tatkala Musa hendak memegang dengan keras orang yang menjadi musuh keduanya, musuhnya berkata: \"Hai Musa, apakah kamu bermaksud hendak membunuhku, sebagaimana kamu kemarin telah membunuh seorang manusia? Kamu tidak bermaksud melainkan hendak menjadi orang yang berbuat sewenang-wenang di negeri (ini), dan tiadalah kamu hendak menjadi salah seorang dari orang-orang yang mengadakan perdamaian\"."
  }, {
    "number": 20,
    "text": "وَجَآءَ رَجُلٌ مِّنْ أَقْصَا ٱلْمَدِينَةِ يَسْعَىٰ قَالَ يَٰمُوسَىٰٓ إِنَّ ٱلْمَلَأَ يَأْتَمِرُونَ بِكَ لِيَقْتُلُوكَ فَٱخْرُجْ إِنِّى لَكَ مِنَ ٱلنَّٰصِحِينَ",
    "translation_en": "And a man came from the farthest end of the city, running. He said, \"O Moses, indeed the eminent ones are conferring over you [intending] to kill you, so leave [the city]; indeed, I am to you of the sincere advisors.\"",
    "translation_id": "Dan datanglah seorang laki-laki dari ujung kota bergegas-gegas seraya berkata: \"Hai Musa, sesungguhnya pembesar negeri sedang berunding tentang kamu untuk membunuhmu, sebab itu keluarlah (dari kota ini) sesungguhnya aku termasuk orang-orang yang memberi nasehat kepadamu\"."
  }, {
    "number": 21,
    "text": "فَخَرَجَ مِنْهَا خَآئِفًا يَتَرَقَّبُ قَالَ رَبِّ نَجِّنِى مِنَ ٱلْقَوْمِ ٱلظَّٰلِمِينَ",
    "translation_en": "So he left it, fearful and anticipating [apprehension]. He said, \"My Lord, save me from the wrongdoing people.\"",
    "translation_id": "Maka keluarlah Musa dari kota itu dengan rasa takut menunggu-nunggu dengan khawatir, dia berdoa: \"Ya Tuhanku, selamatkanlah aku dari orang-orang yang zalim itu\"."
  }, {
    "number": 22,
    "text": "وَلَمَّا تَوَجَّهَ تِلْقَآءَ مَدْيَنَ قَالَ عَسَىٰ رَبِّىٓ أَن يَهْدِيَنِى سَوَآءَ ٱلسَّبِيلِ",
    "translation_en": "And when he directed himself toward Madyan, he said, \"Perhaps my Lord will guide me to the sound way.\"",
    "translation_id": "Dan tatkala ia menghadap kejurusan negeri Mad-yan ia berdoa (lagi): \"Mudah-mudahan Tuhanku memimpinku ke jalan yang benar\"."
  }, {
    "number": 23,
    "text": "وَلَمَّا وَرَدَ مَآءَ مَدْيَنَ وَجَدَ عَلَيْهِ أُمَّةً مِّنَ ٱلنَّاسِ يَسْقُونَ وَوَجَدَ مِن دُونِهِمُ ٱمْرَأَتَيْنِ تَذُودَانِ قَالَ مَا خَطْبُكُمَا قَالَتَا لَا نَسْقِى حَتَّىٰ يُصْدِرَ ٱلرِّعَآءُ وَأَبُونَا شَيْخٌ كَبِيرٌ",
    "translation_en": "And when he came to the well of Madyan, he found there a crowd of people watering [their flocks], and he found aside from them two women driving back [their flocks]. He said, \"What is your circumstance?\" They said, \"We do not water until the shepherds dispatch [their flocks]; and our father is an old man.\"",
    "translation_id": "Dan tatkala ia sampai di sumber air negeri Mad-yan ia menjumpai di sana sekumpulan orang yang sedang meminumkan (ternaknya), dan ia menjumpai di belakang orang banyak itu, dua orang wanita yang sedang menghambat (ternaknya). Musa berkata: \"Apakah maksudmu (dengan berbuat at begitu)?\" Kedua wanita itu menjawab: \"Kami tidak dapat meminumkan (ternak kami), sebelum pengembala-pengembala itu memulangkan (ternaknya), sedang bapak kami adalah orang tua yang telah lanjut umurnya\"."
  }, {
    "number": 24,
    "text": "فَسَقَىٰ لَهُمَا ثُمَّ تَوَلَّىٰٓ إِلَى ٱلظِّلِّ فَقَالَ رَبِّ إِنِّى لِمَآ أَنزَلْتَ إِلَىَّ مِنْ خَيْرٍ فَقِيرٌ",
    "translation_en": "So he watered [their flocks] for them; then he went back to the shade and said, \"My Lord, indeed I am, for whatever good You would send down to me, in need.\"",
    "translation_id": "Maka Musa memberi minum ternak itu untuk (menolong) keduanya, kemudian dia kembali ke tempat yang teduh lalu berdoa: \"Ya Tuhanku sesungguhnya aku sangat memerlukan sesuatu kebaikan yang Engkau turunkan kepadaku\"."
  }, {
    "number": 25,
    "text": "فَجَآءَتْهُ إِحْدَىٰهُمَا تَمْشِى عَلَى ٱسْتِحْيَآءٍ قَالَتْ إِنَّ أَبِى يَدْعُوكَ لِيَجْزِيَكَ أَجْرَ مَا سَقَيْتَ لَنَا فَلَمَّا جَآءَهُۥ وَقَصَّ عَلَيْهِ ٱلْقَصَصَ قَالَ لَا تَخَفْ نَجَوْتَ مِنَ ٱلْقَوْمِ ٱلظَّٰلِمِينَ",
    "translation_en": "Then one of the two women came to him walking with shyness. She said, \"Indeed, my father invites you that he may reward you for having watered for us.\" So when he came to him and related to him the story, he said, \"Fear not. You have escaped from the wrongdoing people.\"",
    "translation_id": "Kemudian datanglah kepada Musa salah seorang dari kedua wanita itu berjalan kemalu-maluan, ia berkata: \"Sesungguhnya bapakku memanggil kamu agar ia memberikan balasan terhadap (kebaikan)mu memberi minum (ternak) kami\". Maka tatkala Musa mendatangi bapaknya (Syu'aib) dan menceritakan kepadanya cerita (mengenai dirinya), Syu'aib berkata: \"Janganlah kamu takut. Kamu telah selamat dari orang-orang yang zalim itu\"."
  }, {
    "number": 26,
    "text": "قَالَتْ إِحْدَىٰهُمَا يَٰٓأَبَتِ ٱسْتَـْٔجِرْهُ إِنَّ خَيْرَ مَنِ ٱسْتَـْٔجَرْتَ ٱلْقَوِىُّ ٱلْأَمِينُ",
    "translation_en": "One of the women said, \"O my father, hire him. Indeed, the best one you can hire is the strong and the trustworthy.\"",
    "translation_id": "Salah seorang dari kedua wanita itu berkata: \"Ya bapakku ambillah ia sebagai orang yang bekerja (pada kita), karena sesungguhnya orang yang paling baik yang kamu ambil untuk bekerja (pada kita) ialah orang yang kuat lagi dapat dipercaya\"."
  }, {
    "number": 27,
    "text": "قَالَ إِنِّىٓ أُرِيدُ أَنْ أُنكِحَكَ إِحْدَى ٱبْنَتَىَّ هَٰتَيْنِ عَلَىٰٓ أَن تَأْجُرَنِى ثَمَٰنِىَ حِجَجٍ فَإِنْ أَتْمَمْتَ عَشْرًا فَمِنْ عِندِكَ وَمَآ أُرِيدُ أَنْ أَشُقَّ عَلَيْكَ سَتَجِدُنِىٓ إِن شَآءَ ٱللَّهُ مِنَ ٱلصَّٰلِحِينَ",
    "translation_en": "He said, \"Indeed, I wish to wed you one of these, my two daughters, on [the condition] that you serve me for eight years; but if you complete ten, it will be [as a favor] from you. And I do not wish to put you in difficulty. You will find me, if Allah wills, from among the righteous.\"",
    "translation_id": "Berkatalah dia (Syu'aib): \"Sesungguhnya aku bermaksud menikahkan kamu dengan salah seorang dari kedua anakku ini, atas dasar bahwa kamu bekerja denganku delapan tahun dan jika kamu cukupkan sepuluh tahun maka itu adalah (suatu kebaikan) dari kamu, maka aku tidak hendak memberati kamu. Dan kamu Insya Allah akan mendapatiku termasuk orang-orang yang baik\"."
  }, {
    "number": 28,
    "text": "قَالَ ذَٰلِكَ بَيْنِى وَبَيْنَكَ أَيَّمَا ٱلْأَجَلَيْنِ قَضَيْتُ فَلَا عُدْوَٰنَ عَلَىَّ وَٱللَّهُ عَلَىٰ مَا نَقُولُ وَكِيلٌ",
    "translation_en": "[Moses] said, \"That is [established] between me and you. Whichever of the two terms I complete - there is no injustice to me, and Allah, over what we say, is Witness.\"",
    "translation_id": "Dia (Musa) berkata: \"Itulah (perjanjian) antara aku dan kamu. Mana saja dari kedua waktu yang ditentukan itu aku sempurnakan, maka tidak ada tuntutan tambahan atas diriku (lagi). Dan Allah adalah saksi atas apa yang kita ucapkan\"."
  }, {
    "number": 29,
    "text": "فَلَمَّا قَضَىٰ مُوسَى ٱلْأَجَلَ وَسَارَ بِأَهْلِهِۦٓ ءَانَسَ مِن جَانِبِ ٱلطُّورِ نَارًا قَالَ لِأَهْلِهِ ٱمْكُثُوٓا۟ إِنِّىٓ ءَانَسْتُ نَارًا لَّعَلِّىٓ ءَاتِيكُم مِّنْهَا بِخَبَرٍ أَوْ جَذْوَةٍ مِّنَ ٱلنَّارِ لَعَلَّكُمْ تَصْطَلُونَ",
    "translation_en": "And when Moses had completed the term and was traveling with his family, he perceived from the direction of the mount a fire. He said to his family, \"Stay here; indeed, I have perceived a fire. Perhaps I will bring you from there [some] information or burning wood from the fire that you may warm yourselves.\"",
    "translation_id": "Maka tatkala Musa telah menyelesaikan waktu yang ditentukan dan dia berangkat dengan keluarganya, dilihatnyalah api di lereng gunung ia berkata kepada keluarganya: \"Tunggulah (di sini), sesungguhnya aku melihat api, mudah-mudahan aku dapat membawa suatu berita kepadamu dari (tempat) api itu atau (membawa) sesuluh api, agar kamu dapat menghangatkan badan\"."
  }, {
    "number": 30,
    "text": "فَلَمَّآ أَتَىٰهَا نُودِىَ مِن شَٰطِئِ ٱلْوَادِ ٱلْأَيْمَنِ فِى ٱلْبُقْعَةِ ٱلْمُبَٰرَكَةِ مِنَ ٱلشَّجَرَةِ أَن يَٰمُوسَىٰٓ إِنِّىٓ أَنَا ٱللَّهُ رَبُّ ٱلْعَٰلَمِينَ",
    "translation_en": "But when he came to it, he was called from the right side of the valley in a blessed spot - from the tree, \"O Moses, indeed I am Allah, Lord of the worlds.\"",
    "translation_id": "Maka tatkala Musa sampai ke (tempat) api itu, diserulah dia dari (arah) pinggir lembah yang sebelah kanan(nya) pada tempat yang diberkahi, dari sebatang pohon kayu, yaitu: \"Ya Musa, sesungguhnya aku adalah Allah, Tuhan semesta alam."
  }, {
    "number": 31,
    "text": "وَأَنْ أَلْقِ عَصَاكَ فَلَمَّا رَءَاهَا تَهْتَزُّ كَأَنَّهَا جَآنٌّ وَلَّىٰ مُدْبِرًا وَلَمْ يُعَقِّبْ يَٰمُوسَىٰٓ أَقْبِلْ وَلَا تَخَفْ إِنَّكَ مِنَ ٱلْءَامِنِينَ",
    "translation_en": "And [he was told], \"Throw down your staff.\" But when he saw it writhing as if it was a snake, he turned in flight and did not return. [Allah said], \"O Moses, approach and fear not. Indeed, you are of the secure.",
    "translation_id": "dan lemparkanlah tongkatmu. Maka tatkala (tongkat itu menjadi ular dan) Musa melihatnya bergerak-gerak seolah-olah dia seekor ular yang gesit, larilah ia berbalik ke belakang tanpa menoleh. (Kemudian Musa diseru): \"Hai Musa datanglah kepada-Ku dan janganlah kamu takut. Sesungguhnya kamu termasuk orang-orang yang aman."
  }, {
    "number": 32,
    "text": "ٱسْلُكْ يَدَكَ فِى جَيْبِكَ تَخْرُجْ بَيْضَآءَ مِنْ غَيْرِ سُوٓءٍ وَٱضْمُمْ إِلَيْكَ جَنَاحَكَ مِنَ ٱلرَّهْبِ فَذَٰنِكَ بُرْهَٰنَانِ مِن رَّبِّكَ إِلَىٰ فِرْعَوْنَ وَمَلَإِي۟هِۦٓ إِنَّهُمْ كَانُوا۟ قَوْمًا فَٰسِقِينَ",
    "translation_en": "Insert your hand into the opening of your garment; it will come out white, without disease. And draw in your arm close to you [as prevention] from fear, for those are two proofs from your Lord to Pharaoh and his establishment. Indeed, they have been a people defiantly disobedient.\"",
    "translation_id": "Masukkanlah tanganmu ke leher bajumu, niscaya ia keluar putih tidak bercacat bukan karena penyakit, dan dekapkanlah kedua tanganmu (ke dada)mu bila ketakutan, maka yang demikian itu adalah dua mukjizat dari Tuhanmu (yang akan kamu hadapkan kepada Fir'aun dan pembesar-pembesarnya). Sesungguhnya mereka adalah orang-orang yang fasik\"."
  }, {
    "number": 33,
    "text": "قَالَ رَبِّ إِنِّى قَتَلْتُ مِنْهُمْ نَفْسًا فَأَخَافُ أَن يَقْتُلُونِ",
    "translation_en": "He said, \"My Lord, indeed, I killed from among them someone, and I fear they will kill me.",
    "translation_id": "Musa berkata: \"Ya Tuhanku sesungguhnya aku, telah membunuh seorang manusia dari golongan mereka, maka aku takut mereka akan membunuhku."
  }, {
    "number": 34,
    "text": "وَأَخِى هَٰرُونُ هُوَ أَفْصَحُ مِنِّى لِسَانًا فَأَرْسِلْهُ مَعِىَ رِدْءًا يُصَدِّقُنِىٓ إِنِّىٓ أَخَافُ أَن يُكَذِّبُونِ",
    "translation_en": "And my brother Aaron is more fluent than me in tongue, so send him with me as support, verifying me. Indeed, I fear that they will deny me.\"",
    "translation_id": "Dan saudaraku Harun dia lebih fasih lidahnya daripadaku, maka utuslah dia bersamaku sebagai pembantuku untuk membenarkan (perkataan)ku; sesungguhnya aku khawatir mereka akan mendustakanku\"."
  }, {
    "number": 35,
    "text": "قَالَ سَنَشُدُّ عَضُدَكَ بِأَخِيكَ وَنَجْعَلُ لَكُمَا سُلْطَٰنًا فَلَا يَصِلُونَ إِلَيْكُمَا بِـَٔايَٰتِنَآ أَنتُمَا وَمَنِ ٱتَّبَعَكُمَا ٱلْغَٰلِبُونَ",
    "translation_en": "[Allah] said, \"We will strengthen your arm through your brother and grant you both supremacy so they will not reach you. [It will be] through Our signs; you and those who follow you will be the predominant.\"",
    "translation_id": "Allah berfirman: \"Kami akan membantumu dengan saudaramu, dan Kami berikan kepadamu berdua kekuasaan yang besar, maka mereka tidak dapat mencapaimu; (berangkatlah kamu berdua) dengan membawa mukjizat Kami, kamu berdua dan orang yang mengikuti kamulah yang akan menang."
  }, {
    "number": 36,
    "text": "فَلَمَّا جَآءَهُم مُّوسَىٰ بِـَٔايَٰتِنَا بَيِّنَٰتٍ قَالُوا۟ مَا هَٰذَآ إِلَّا سِحْرٌ مُّفْتَرًى وَمَا سَمِعْنَا بِهَٰذَا فِىٓ ءَابَآئِنَا ٱلْأَوَّلِينَ",
    "translation_en": "But when Moses came to them with Our signs as clear evidences, they said, \"This is not except invented magic, and we have not heard of this [religion] among our forefathers.\"",
    "translation_id": "Maka tatkala Musa datang kepada mereka dengan (membawa) mukjizat-mukjizat Kami yang nyata, mereka berkata: \"Ini tidak lain hanyalah sihir yang dibuat-buat dan kami belum pernah mendengar (seruan yang seperti) ini pada nenek moyang kami dahulu\"."
  }, {
    "number": 37,
    "text": "وَقَالَ مُوسَىٰ رَبِّىٓ أَعْلَمُ بِمَن جَآءَ بِٱلْهُدَىٰ مِنْ عِندِهِۦ وَمَن تَكُونُ لَهُۥ عَٰقِبَةُ ٱلدَّارِ إِنَّهُۥ لَا يُفْلِحُ ٱلظَّٰلِمُونَ",
    "translation_en": "And Moses said, \"My Lord is more knowing [than we or you] of who has come with guidance from Him and to whom will be succession in the home. Indeed, wrongdoers do not succeed.\"",
    "translation_id": "Musa menjawab: \"Tuhanku lebih mengetahui orang yang (patut) membawa petunjuk dari sisi-Nya dan siapa yang akan mendapat kesudahan (yang baik) di negeri akhirat. Sesungguhnya tidaklah akan mendapat kemenangan orang-orang yang zalim\"."
  }, {
    "number": 38,
    "text": "وَقَالَ فِرْعَوْنُ يَٰٓأَيُّهَا ٱلْمَلَأُ مَا عَلِمْتُ لَكُم مِّنْ إِلَٰهٍ غَيْرِى فَأَوْقِدْ لِى يَٰهَٰمَٰنُ عَلَى ٱلطِّينِ فَٱجْعَل لِّى صَرْحًا لَّعَلِّىٓ أَطَّلِعُ إِلَىٰٓ إِلَٰهِ مُوسَىٰ وَإِنِّى لَأَظُنُّهُۥ مِنَ ٱلْكَٰذِبِينَ",
    "translation_en": "And Pharaoh said, \"O eminent ones, I have not known you to have a god other than me. Then ignite for me, O Haman, [a fire] upon the clay and make for me a tower that I may look at the God of Moses. And indeed, I do think he is among the liars.\"",
    "translation_id": "Dan berkata Fir'aun: \"Hai pembesar kaumku, aku tidak mengetahui tuhan bagimu selain aku. Maka bakarlah hai Haman untukku tanah liat kemudian buatkanlah untukku bangunan yang tinggi supaya aku dapat naik melihat Tuhan Musa, dan sesungguhnya aku benar-benar yakin bahwa dia termasuk orang-orang pendusta\"."
  }, {
    "number": 39,
    "text": "وَٱسْتَكْبَرَ هُوَ وَجُنُودُهُۥ فِى ٱلْأَرْضِ بِغَيْرِ ٱلْحَقِّ وَظَنُّوٓا۟ أَنَّهُمْ إِلَيْنَا لَا يُرْجَعُونَ",
    "translation_en": "And he was arrogant, he and his soldiers, in the land, without right, and they thought that they would not be returned to Us.",
    "translation_id": "dan berlaku angkuhlah Fir'aun dan bala tentaranya di bumi (Mesir) tanpa alasan yang benar dan mereka menyangka bahwa mereka tidak akan dikembalikan kepada Kami."
  }, {
    "number": 40,
    "text": "فَأَخَذْنَٰهُ وَجُنُودَهُۥ فَنَبَذْنَٰهُمْ فِى ٱلْيَمِّ فَٱنظُرْ كَيْفَ كَانَ عَٰقِبَةُ ٱلظَّٰلِمِينَ",
    "translation_en": "So We took him and his soldiers and threw them into the sea. So see how was the end of the wrongdoers.",
    "translation_id": "Maka Kami hukumlah Fir'aun dan bala tentaranya, lalu Kami lemparkan mereka ke dalam laut. Maka lihatlah bagaimana akibat orang-orang yang zalim."
  }, {
    "number": 41,
    "text": "وَجَعَلْنَٰهُمْ أَئِمَّةً يَدْعُونَ إِلَى ٱلنَّارِ وَيَوْمَ ٱلْقِيَٰمَةِ لَا يُنصَرُونَ",
    "translation_en": "And We made them leaders inviting to the Fire, and on the Day of Resurrection they will not be helped.",
    "translation_id": "Dan Kami jadikan mereka pemimpin-pemimpin yang menyeru (manusia) ke neraka dan pada hari kiamat mereka tidak akan ditolong."
  }, {
    "number": 42,
    "text": "وَأَتْبَعْنَٰهُمْ فِى هَٰذِهِ ٱلدُّنْيَا لَعْنَةً وَيَوْمَ ٱلْقِيَٰمَةِ هُم مِّنَ ٱلْمَقْبُوحِينَ",
    "translation_en": "And We caused to overtake them in this world a curse, and on the Day of Resurrection they will be of the despised.",
    "translation_id": "Dan Kami ikutkanlah laknat kepada mereka di dunia ini; dan pada hari kiamat mereka termasuk orang-orang yang dijauhkan (dari rahmat Allah)."
  }, {
    "number": 43,
    "text": "وَلَقَدْ ءَاتَيْنَا مُوسَى ٱلْكِتَٰبَ مِنۢ بَعْدِ مَآ أَهْلَكْنَا ٱلْقُرُونَ ٱلْأُولَىٰ بَصَآئِرَ لِلنَّاسِ وَهُدًى وَرَحْمَةً لَّعَلَّهُمْ يَتَذَكَّرُونَ",
    "translation_en": "And We gave Moses the Scripture, after We had destroyed the former generations, as enlightenment for the people and guidance and mercy that they might be reminded.",
    "translation_id": "Dan sesungguhnya telah Kami berikan kepada Musa Al-Kitab (Taurat) sesudah Kami binasakan generasi-generasi yang terdahulu, untuk menjadi pelita bagi manusia dan petunjuk dan rahmat, agar mereka ingat."
  }, {
    "number": 44,
    "text": "وَمَا كُنتَ بِجَانِبِ ٱلْغَرْبِىِّ إِذْ قَضَيْنَآ إِلَىٰ مُوسَى ٱلْأَمْرَ وَمَا كُنتَ مِنَ ٱلشَّٰهِدِينَ",
    "translation_en": "And you, [O Muhammad], were not on the western side [of the mount] when We revealed to Moses the command, and you were not among the witnesses [to that].",
    "translation_id": "Dan tidaklah kamu (Muhammad) berada di sisi yang sebelah barat ketika Kami menyampaikan perintah kepada Musa, dan tiada pula kamu termasuk orang-orang yang menyaksikan."
  }, {
    "number": 45,
    "text": "وَلَٰكِنَّآ أَنشَأْنَا قُرُونًا فَتَطَاوَلَ عَلَيْهِمُ ٱلْعُمُرُ وَمَا كُنتَ ثَاوِيًا فِىٓ أَهْلِ مَدْيَنَ تَتْلُوا۟ عَلَيْهِمْ ءَايَٰتِنَا وَلَٰكِنَّا كُنَّا مُرْسِلِينَ",
    "translation_en": "But We produced [many] generations [after Moses], and prolonged was their duration. And you were not a resident among the people of Madyan, reciting to them Our verses, but We were senders [of this message].",
    "translation_id": "Tetapi Kami telah mengadakan beberapa generasi, dan berlalulah atas mereka masa yang panjang, dan tiadalah kamu tinggal bersama-sama penduduk Mad-yan dengan membacakan ayat-ayat Kami kepada mereka, tetapi Kami telah mengutus rasul-rasul."
  }, {
    "number": 46,
    "text": "وَمَا كُنتَ بِجَانِبِ ٱلطُّورِ إِذْ نَادَيْنَا وَلَٰكِن رَّحْمَةً مِّن رَّبِّكَ لِتُنذِرَ قَوْمًا مَّآ أَتَىٰهُم مِّن نَّذِيرٍ مِّن قَبْلِكَ لَعَلَّهُمْ يَتَذَكَّرُونَ",
    "translation_en": "And you were not at the side of the mount when We called [Moses] but [were sent] as a mercy from your Lord to warn a people to whom no warner had come before you that they might be reminded.",
    "translation_id": "Dan tiadalah kamu berada di dekat gunung Thur ketika Kami menyeru (Musa), tetapi (Kami beritahukan itu kepadamu) sebagai rahmat dari Tuhanmu, supaya kamu memberi peringatan kepada kaum (Quraisy) yang sekali-kali belum datang kepada mereka pemberi peringatan sebelum kamu agar mereka ingat."
  }, {
    "number": 47,
    "text": "وَلَوْلَآ أَن تُصِيبَهُم مُّصِيبَةٌۢ بِمَا قَدَّمَتْ أَيْدِيهِمْ فَيَقُولُوا۟ رَبَّنَا لَوْلَآ أَرْسَلْتَ إِلَيْنَا رَسُولًا فَنَتَّبِعَ ءَايَٰتِكَ وَنَكُونَ مِنَ ٱلْمُؤْمِنِينَ",
    "translation_en": "And if not that a disaster should strike them for what their hands put forth [of sins] and they would say, \"Our Lord, why did You not send us a messenger so we could have followed Your verses and been among the believers?\"...",
    "translation_id": "Dan agar mereka tidak mengatakan ketika azab menimpa mereka disebabkan apa yang mereka kerjakan: \"Ya Tuhan kami, mengapa Engkau tidak mengutus seorang rasul kepada kami, lalu kami mengikuti ayat-ayat Engkau dan jadilah kami termasuk orang-orang mukmin\"."
  }, {
    "number": 48,
    "text": "فَلَمَّا جَآءَهُمُ ٱلْحَقُّ مِنْ عِندِنَا قَالُوا۟ لَوْلَآ أُوتِىَ مِثْلَ مَآ أُوتِىَ مُوسَىٰٓ أَوَلَمْ يَكْفُرُوا۟ بِمَآ أُوتِىَ مُوسَىٰ مِن قَبْلُ قَالُوا۟ سِحْرَانِ تَظَٰهَرَا وَقَالُوٓا۟ إِنَّا بِكُلٍّ كَٰفِرُونَ",
    "translation_en": "But when the truth came to them from Us, they said, \"Why was he not given like that which was given to Moses?\" Did they not disbelieve in that which was given to Moses before? They said, \"[They are but] two works of magic supporting each other, and indeed we are, in both, disbelievers.\"",
    "translation_id": "Maka tatkala datang kepada mereka kebenaran dari sisi Kami, mereka berkata: \"Mengapakah tidak diberikan kepadanya (Muhammad) seperti yang telah diberikan kepada Musa dahulu?\". Dan bukankah mereka itu telah ingkar (juga) kepada apa yang telah diberikan kepada Musa dahulu?; mereka dahulu telah berkata: \"Musa dan Harun adalah dua ahli sihir yang bantu membantu\". Dan mereka (juga) berkata: \"Sesungguhnya kami tidak mempercayai masing-masing mereka itu\"."
  }, {
    "number": 49,
    "text": "قُلْ فَأْتُوا۟ بِكِتَٰبٍ مِّنْ عِندِ ٱللَّهِ هُوَ أَهْدَىٰ مِنْهُمَآ أَتَّبِعْهُ إِن كُنتُمْ صَٰدِقِينَ",
    "translation_en": "Say, \"Then bring a scripture from Allah which is more guiding than either of them that I may follow it, if you should be truthful.\"",
    "translation_id": "Katakanlah: \"Datangkanlah olehmu sebuah kitab dari sisi Allah yang kitab itu lebih (dapat) memberi petunjuk daripada keduanya (Taurat dan Al Quran) niscaya aku mengikutinya, jika kamu sungguh orang-orang yang benar\"."
  }, {
    "number": 50,
    "text": "فَإِن لَّمْ يَسْتَجِيبُوا۟ لَكَ فَٱعْلَمْ أَنَّمَا يَتَّبِعُونَ أَهْوَآءَهُمْ وَمَنْ أَضَلُّ مِمَّنِ ٱتَّبَعَ هَوَىٰهُ بِغَيْرِ هُدًى مِّنَ ٱللَّهِ إِنَّ ٱللَّهَ لَا يَهْدِى ٱلْقَوْمَ ٱلظَّٰلِمِينَ",
    "translation_en": "But if they do not respond to you - then know that they only follow their [own] desires. And who is more astray than one who follows his desire without guidance from Allah? Indeed, Allah does not guide the wrongdoing people.",
    "translation_id": "Maka jika mereka tidak menjawab (tantanganmu) ketahuilah bahwa sesungguhnya mereka hanyalah mengikuti hawa nafsu mereka (belaka). Dan siapakah yang lebih sesat daripada orang yang mengikuti hawa nafsunya dengan tidak mendapat petunjuk dari Allah sedikitpun. Sesungguhnya Allah tidak memberi petunjuk kepada orang-orang yang zalim."
  }, {
    "number": 51,
    "text": "وَلَقَدْ وَصَّلْنَا لَهُمُ ٱلْقَوْلَ لَعَلَّهُمْ يَتَذَكَّرُونَ",
    "translation_en": "And We have [repeatedly] conveyed to them the Qur'an that they might be reminded.",
    "translation_id": "Dan sesungguhnya telah Kami turunkan berturut-turut perkataan ini (Al Quran) kepada mereka agar mereka mendapat pelajaran."
  }, {
    "number": 52,
    "text": "ٱلَّذِينَ ءَاتَيْنَٰهُمُ ٱلْكِتَٰبَ مِن قَبْلِهِۦ هُم بِهِۦ يُؤْمِنُونَ",
    "translation_en": "Those to whom We gave the Scripture before it - they are believers in it.",
    "translation_id": "Orang-orang yang telah Kami datangkan kepada mereka Al Kitab sebelum Al Quran, mereka beriman (pula) dengan Al Quran itu."
  }, {
    "number": 53,
    "text": "وَإِذَا يُتْلَىٰ عَلَيْهِمْ قَالُوٓا۟ ءَامَنَّا بِهِۦٓ إِنَّهُ ٱلْحَقُّ مِن رَّبِّنَآ إِنَّا كُنَّا مِن قَبْلِهِۦ مُسْلِمِينَ",
    "translation_en": "And when it is recited to them, they say, \"We have believed in it; indeed, it is the truth from our Lord. Indeed we were, [even] before it, Muslims [submitting to Allah].\"",
    "translation_id": "Dan apabila dibacakan (Al Quran itu) kepada mereka, mereka berkata: \"Kami beriman kepadanya; sesungguhnya; Al Quran itu adalah suatu kebenaran dari Tuhan kami, sesungguhnya kami sebelumnya adalah orang-orang yang membenarkan(nya)."
  }, {
    "number": 54,
    "text": "أُو۟لَٰٓئِكَ يُؤْتَوْنَ أَجْرَهُم مَّرَّتَيْنِ بِمَا صَبَرُوا۟ وَيَدْرَءُونَ بِٱلْحَسَنَةِ ٱلسَّيِّئَةَ وَمِمَّا رَزَقْنَٰهُمْ يُنفِقُونَ",
    "translation_en": "Those will be given their reward twice for what they patiently endured and [because] they avert evil through good, and from what We have provided them they spend.",
    "translation_id": "Mereka itu diberi pahala dua kali disebabkan kesabaran mereka, dan mereka menolak kejahatan dengan kebaikan, dan sebagian dari apa yang telah Kami rezekikan kepada mereka, mereka nafkahkan."
  }, {
    "number": 55,
    "text": "وَإِذَا سَمِعُوا۟ ٱللَّغْوَ أَعْرَضُوا۟ عَنْهُ وَقَالُوا۟ لَنَآ أَعْمَٰلُنَا وَلَكُمْ أَعْمَٰلُكُمْ سَلَٰمٌ عَلَيْكُمْ لَا نَبْتَغِى ٱلْجَٰهِلِينَ",
    "translation_en": "And when they hear ill speech, they turn away from it and say, \"For us are our deeds, and for you are your deeds. Peace will be upon you; we seek not the ignorant.\"",
    "translation_id": "Dan apabila mereka mendengar perkataan yang tidak bermanfaat, mereka berpaling daripadanya dan mereka berkata: \"Bagi kami amal-amal kami dan bagimu amal-amalmu, kesejahteraan atas dirimu, kami tidak ingin bergaul dengan orang-orang jahil\"."
  }, {
    "number": 56,
    "text": "إِنَّكَ لَا تَهْدِى مَنْ أَحْبَبْتَ وَلَٰكِنَّ ٱللَّهَ يَهْدِى مَن يَشَآءُ وَهُوَ أَعْلَمُ بِٱلْمُهْتَدِينَ",
    "translation_en": "Indeed, [O Muhammad], you do not guide whom you like, but Allah guides whom He wills. And He is most knowing of the [rightly] guided.",
    "translation_id": "Sesungguhnya kamu tidak akan dapat memberi petunjuk kepada orang yang kamu kasihi, tetapi Allah memberi petunjuk kepada orang yang dikehendaki-Nya, dan Allah lebih mengetahui orang-orang yang mau menerima petunjuk."
  }, {
    "number": 57,
    "text": "وَقَالُوٓا۟ إِن نَّتَّبِعِ ٱلْهُدَىٰ مَعَكَ نُتَخَطَّفْ مِنْ أَرْضِنَآ أَوَلَمْ نُمَكِّن لَّهُمْ حَرَمًا ءَامِنًا يُجْبَىٰٓ إِلَيْهِ ثَمَرَٰتُ كُلِّ شَىْءٍ رِّزْقًا مِّن لَّدُنَّا وَلَٰكِنَّ أَكْثَرَهُمْ لَا يَعْلَمُونَ",
    "translation_en": "And they say, \"If we were to follow the guidance with you, we would be swept from our land.\" Have we not established for them a safe sanctuary to which are brought the fruits of all things as provision from Us? But most of them do not know.",
    "translation_id": "Dan mereka berkata: \"Jika kami mengikuti petunjuk bersama kamu, niscaya kami akan diusir dari negeri kami\". Dan apakah Kami tidak meneguhkan kedudukan mereka dalam daerah haram (tanah suci) yang aman, yang didatangkan ke tempat itu buah-buahan dari segala macam (tumbuh-tumbuhan) untuk menjadi rezeki (bagimu) dari sisi Kami?. Tetapi kebanyakan mereka tidak mengetahui."
  }, {
    "number": 58,
    "text": "وَكَمْ أَهْلَكْنَا مِن قَرْيَةٍۭ بَطِرَتْ مَعِيشَتَهَا فَتِلْكَ مَسَٰكِنُهُمْ لَمْ تُسْكَن مِّنۢ بَعْدِهِمْ إِلَّا قَلِيلًا وَكُنَّا نَحْنُ ٱلْوَٰرِثِينَ",
    "translation_en": "And how many a city have We destroyed that was insolent in its [way of] living, and those are their dwellings which have not been inhabited after them except briefly. And it is We who were the inheritors.",
    "translation_id": "Dan berapa banyaknya (penduduk) negeri yang telah Kami binasakan, yang sudah bersenang-senang dalam kehidupannya; maka itulah tempat kediaman mereka yang tiada di diami (lagi) sesudah mereka, kecuali sebahagian kecil. Dan Kami adalah Pewaris(nya)."
  }, {
    "number": 59,
    "text": "وَمَا كَانَ رَبُّكَ مُهْلِكَ ٱلْقُرَىٰ حَتَّىٰ يَبْعَثَ فِىٓ أُمِّهَا رَسُولًا يَتْلُوا۟ عَلَيْهِمْ ءَايَٰتِنَا وَمَا كُنَّا مُهْلِكِى ٱلْقُرَىٰٓ إِلَّا وَأَهْلُهَا ظَٰلِمُونَ",
    "translation_en": "And never would your Lord have destroyed the cities until He had sent to their mother a messenger reciting to them Our verses. And We would not destroy the cities except while their people were wrongdoers.",
    "translation_id": "Dan tidak adalah Tuhanmu membinasakan kota-kota, sebelum Dia mengutus di ibukota itu seorang rasul yang membacakan ayat-ayat Kami kepada mereka; dan tidak pernah (pula) Kami membinasakan kota-kota; kecuali penduduknya dalam keadaan melakukan kezaliman."
  }, {
    "number": 60,
    "text": "وَمَآ أُوتِيتُم مِّن شَىْءٍ فَمَتَٰعُ ٱلْحَيَوٰةِ ٱلدُّنْيَا وَزِينَتُهَا وَمَا عِندَ ٱللَّهِ خَيْرٌ وَأَبْقَىٰٓ أَفَلَا تَعْقِلُونَ",
    "translation_en": "And whatever thing you [people] have been given - it is [only for] the enjoyment of worldly life and its adornment. And what is with Allah is better and more lasting; so will you not use reason?",
    "translation_id": "Dan apa saja yang diberikan kepada kamu, maka itu adalah kenikmatan hidup duniawi dan perhiasannya; sedang apa yang di sisi Allah adalah lebih baik dan lebih kekal. Maka apakah kamu tidak memahaminya?"
  }, {
    "number": 61,
    "text": "أَفَمَن وَعَدْنَٰهُ وَعْدًا حَسَنًا فَهُوَ لَٰقِيهِ كَمَن مَّتَّعْنَٰهُ مَتَٰعَ ٱلْحَيَوٰةِ ٱلدُّنْيَا ثُمَّ هُوَ يَوْمَ ٱلْقِيَٰمَةِ مِنَ ٱلْمُحْضَرِينَ",
    "translation_en": "Then is he whom We have promised a good promise which he will obtain like he for whom We provided enjoyment of worldly life [but] then he is, on the Day of Resurrection, among those presented [for punishment in Hell]?",
    "translation_id": "Maka apakah orang yang Kami janjikan kepadanya suatu janji yang baik (surga) lalu ia memperolehnya, sama dengan orang yang Kami berikan kepadanya kenikmatan hidup duniawi; kemudian dia pada hari kiamat termasuk orang-orang yang diseret (ke dalam neraka)?"
  }, {
    "number": 62,
    "text": "وَيَوْمَ يُنَادِيهِمْ فَيَقُولُ أَيْنَ شُرَكَآءِىَ ٱلَّذِينَ كُنتُمْ تَزْعُمُونَ",
    "translation_en": "And [warn of] the Day He will call them and say, \"Where are My 'partners' which you used to claim?\"",
    "translation_id": "Dan (ingatlah) hari (di waktu) Allah menyeru mereka, seraya berkata: \"Di manakah sekutu-sekutu-Ku yang dahulu kamu katakan?\""
  }, {
    "number": 63,
    "text": "قَالَ ٱلَّذِينَ حَقَّ عَلَيْهِمُ ٱلْقَوْلُ رَبَّنَا هَٰٓؤُلَآءِ ٱلَّذِينَ أَغْوَيْنَآ أَغْوَيْنَٰهُمْ كَمَا غَوَيْنَا تَبَرَّأْنَآ إِلَيْكَ مَا كَانُوٓا۟ إِيَّانَا يَعْبُدُونَ",
    "translation_en": "Those upon whom the word will have come into effect will say, \"Our Lord, these are the ones we led to error. We led them to error just as we were in error. We declare our disassociation [from them] to You. They did not used to worship us.\"",
    "translation_id": "Berkatalah orang-orang yang telah tetap hukuman atas mereka; \"Ya Tuhan kami, mereka inilah orang-orang yang kami sesatkan itu; kami telah menyesatkan mereka sebagaimana kami (sendiri) sesat, kami menyatakan berlepas diri (dari mereka) kepada Engkau, mereka sekali-kali tidak menyembah kami\"."
  }, {
    "number": 64,
    "text": "وَقِيلَ ٱدْعُوا۟ شُرَكَآءَكُمْ فَدَعَوْهُمْ فَلَمْ يَسْتَجِيبُوا۟ لَهُمْ وَرَأَوُا۟ ٱلْعَذَابَ لَوْ أَنَّهُمْ كَانُوا۟ يَهْتَدُونَ",
    "translation_en": "And it will be said, \"Invoke your 'partners' \" and they will invoke them; but they will not respond to them, and they will see the punishment. If only they had followed guidance!",
    "translation_id": "Dikatakan (kepada mereka) \"Serulah olehmu sekutu-sekutu kamu\", lalu mereka menyerunya, maka sekutu-sekutu itu tidak memperkenankan (seruan) mereka, dan mereka melihat azab. (Mereka ketika itu berkeinginan) kiranya mereka dahulu menerima petunjuk."
  }, {
    "number": 65,
    "text": "وَيَوْمَ يُنَادِيهِمْ فَيَقُولُ مَاذَآ أَجَبْتُمُ ٱلْمُرْسَلِينَ",
    "translation_en": "And [mention] the Day He will call them and say, \"What did you answer the messengers?\"",
    "translation_id": "Dan (ingatlah) hari (di waktu) Allah menyeru mereka, seraya berkata: \"Apakah jawabanmu kepada para rasul?\""
  }, {
    "number": 66,
    "text": "فَعَمِيَتْ عَلَيْهِمُ ٱلْأَنۢبَآءُ يَوْمَئِذٍ فَهُمْ لَا يَتَسَآءَلُونَ",
    "translation_en": "But the information will be unapparent to them that Day, so they will not [be able to] ask one another.",
    "translation_id": "Maka gelaplah bagi mereka segala macam alasan pada hari itu, karena itu mereka tidak saling tanya menanya."
  }, {
    "number": 67,
    "text": "فَأَمَّا مَن تَابَ وَءَامَنَ وَعَمِلَ صَٰلِحًا فَعَسَىٰٓ أَن يَكُونَ مِنَ ٱلْمُفْلِحِينَ",
    "translation_en": "But as for one who had repented, believed, and done righteousness, it is promised by Allah that he will be among the successful.",
    "translation_id": "Adapun orang yang bertaubat dan beriman, serta mengerjakan amal yang saleh, semoga dia termasuk orang-orang yang beruntung."
  }, {
    "number": 68,
    "text": "وَرَبُّكَ يَخْلُقُ مَا يَشَآءُ وَيَخْتَارُ مَا كَانَ لَهُمُ ٱلْخِيَرَةُ سُبْحَٰنَ ٱللَّهِ وَتَعَٰلَىٰ عَمَّا يُشْرِكُونَ",
    "translation_en": "And your Lord creates what He wills and chooses; not for them was the choice. Exalted is Allah and high above what they associate with Him.",
    "translation_id": "Dan Tuhanmu menciptakan apa yang Dia kehendaki dan memilihnya. Sekali-kali tidak ada pilihan bagi mereka. Maha Suci Allah dan Maha Tinggi dari apa yang mereka persekutukan (dengan Dia)."
  }, {
    "number": 69,
    "text": "وَرَبُّكَ يَعْلَمُ مَا تُكِنُّ صُدُورُهُمْ وَمَا يُعْلِنُونَ",
    "translation_en": "And your Lord knows what their breasts conceal and what they declare.",
    "translation_id": "Dan Tuhanmu mengetahui apa yang disembunyikan (dalam) dada mereka dan apa yang mereka nyatakan."
  }, {
    "number": 70,
    "text": "وَهُوَ ٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَ لَهُ ٱلْحَمْدُ فِى ٱلْأُولَىٰ وَٱلْءَاخِرَةِ وَلَهُ ٱلْحُكْمُ وَإِلَيْهِ تُرْجَعُونَ",
    "translation_en": "And He is Allah; there is no deity except Him. To Him is [due all] praise in the first [life] and the Hereafter. And His is the [final] decision, and to Him you will be returned.",
    "translation_id": "Dan Dialah Allah, tidak ada Tuhan (yang berhak disembah) melainkan Dia, bagi-Nya-lah segala puji di dunia dan di akhirat, dan bagi-Nya-lah segala penentuan dan hanya kepada-Nya-lah kamu dikembalikan."
  }, {
    "number": 71,
    "text": "قُلْ أَرَءَيْتُمْ إِن جَعَلَ ٱللَّهُ عَلَيْكُمُ ٱلَّيْلَ سَرْمَدًا إِلَىٰ يَوْمِ ٱلْقِيَٰمَةِ مَنْ إِلَٰهٌ غَيْرُ ٱللَّهِ يَأْتِيكُم بِضِيَآءٍ أَفَلَا تَسْمَعُونَ",
    "translation_en": "Say, \"Have you considered: if Allah should make for you the night continuous until the Day of Resurrection, what deity other than Allah could bring you light? Then will you not hear?\"",
    "translation_id": "Katakanlah: \"Terangkanlah kepadaku, jika Allah menjadikan untukmu malam itu terus menerus sampai hari kiamat, siapakah Tuhan selain Allah yang akan mendatangkan sinar terang kepadamu? Maka apakah kamu tidak mendengar?\""
  }, {
    "number": 72,
    "text": "قُلْ أَرَءَيْتُمْ إِن جَعَلَ ٱللَّهُ عَلَيْكُمُ ٱلنَّهَارَ سَرْمَدًا إِلَىٰ يَوْمِ ٱلْقِيَٰمَةِ مَنْ إِلَٰهٌ غَيْرُ ٱللَّهِ يَأْتِيكُم بِلَيْلٍ تَسْكُنُونَ فِيهِ أَفَلَا تُبْصِرُونَ",
    "translation_en": "Say, \"Have you considered: if Allah should make for you the day continuous until the Day of Resurrection, what deity other than Allah could bring you a night in which you may rest? Then will you not see?\"",
    "translation_id": "Katakanlah: \"Terangkanlah kepadaku, jika Allah menjadikan untukmu siang itu terus menerus sampai hari kiamat, siapakah Tuhan selain Allah yang akan mendatangkan malam kepadamu yang kamu beristirahat padanya? Maka apakah kamu tidak memperhatikan?\""
  }, {
    "number": 73,
    "text": "وَمِن رَّحْمَتِهِۦ جَعَلَ لَكُمُ ٱلَّيْلَ وَٱلنَّهَارَ لِتَسْكُنُوا۟ فِيهِ وَلِتَبْتَغُوا۟ مِن فَضْلِهِۦ وَلَعَلَّكُمْ تَشْكُرُونَ",
    "translation_en": "And out of His mercy He made for you the night and the day that you may rest therein and [by day] seek from His bounty and [that] perhaps you will be grateful.",
    "translation_id": "Dan karena rahmat-Nya, Dia jadikan untukmu malam dan siang, supaya kamu beristirahat pada malam itu dan supaya kamu mencari sebahagian dari karunia-Nya (pada siang hari) dan agar kamu bersyukur kepada-Nya."
  }, {
    "number": 74,
    "text": "وَيَوْمَ يُنَادِيهِمْ فَيَقُولُ أَيْنَ شُرَكَآءِىَ ٱلَّذِينَ كُنتُمْ تَزْعُمُونَ",
    "translation_en": "And [warn of] the Day He will call them and say, \"Where are my 'partners' which you used to claim?\"",
    "translation_id": "Dan (ingatlah) hari (di waktu) Allah menyeru mereka, seraya berkata: \"Di manakah sekutu-sekutu-Ku yang dahulu kamu katakan?\""
  }, {
    "number": 75,
    "text": "وَنَزَعْنَا مِن كُلِّ أُمَّةٍ شَهِيدًا فَقُلْنَا هَاتُوا۟ بُرْهَٰنَكُمْ فَعَلِمُوٓا۟ أَنَّ ٱلْحَقَّ لِلَّهِ وَضَلَّ عَنْهُم مَّا كَانُوا۟ يَفْتَرُونَ",
    "translation_en": "And We will extract from every nation a witness and say, \"Produce your proof,\" and they will know that the truth belongs to Allah, and lost from them is that which they used to invent.",
    "translation_id": "Dan Kami datangkan dari tiap-tiap umat seorang saksi, lalu Kami berkata \"Tunjukkanlah bukti kebenaranmu\", maka tahulah mereka bahwasanya yang hak itu kepunyaan Allah dan lenyaplah dari mereka apa yang dahulunya mereka ada-adakan."
  }, {
    "number": 76,
    "text": "إِنَّ قَٰرُونَ كَانَ مِن قَوْمِ مُوسَىٰ فَبَغَىٰ عَلَيْهِمْ وَءَاتَيْنَٰهُ مِنَ ٱلْكُنُوزِ مَآ إِنَّ مَفَاتِحَهُۥ لَتَنُوٓأُ بِٱلْعُصْبَةِ أُو۟لِى ٱلْقُوَّةِ إِذْ قَالَ لَهُۥ قَوْمُهُۥ لَا تَفْرَحْ إِنَّ ٱللَّهَ لَا يُحِبُّ ٱلْفَرِحِينَ",
    "translation_en": "Indeed, Qarun was from the people of Moses, but he tyrannized them. And We gave him of treasures whose keys would burden a band of strong men; thereupon his people said to him, \"Do not exult. Indeed, Allah does not like the exultant.",
    "translation_id": "Sesungguhnya Karun adalah termasuk kaum Musa, maka ia berlaku aniaya terhadap mereka, dan Kami telah menganugerahkan kepadanya perbendaharaan harta yang kunci-kuncinya sungguh berat dipikul oleh sejumlah orang yang kuat-kuat. (Ingatlah) ketika kaumnya berkata kepadanya: \"Janganlah kamu terlalu bangga; sesungguhnya Allah tidak menyukai orang-orang yang terlalu membanggakan diri\"."
  }, {
    "number": 77,
    "text": "وَٱبْتَغِ فِيمَآ ءَاتَىٰكَ ٱللَّهُ ٱلدَّارَ ٱلْءَاخِرَةَ وَلَا تَنسَ نَصِيبَكَ مِنَ ٱلدُّنْيَا وَأَحْسِن كَمَآ أَحْسَنَ ٱللَّهُ إِلَيْكَ وَلَا تَبْغِ ٱلْفَسَادَ فِى ٱلْأَرْضِ إِنَّ ٱللَّهَ لَا يُحِبُّ ٱلْمُفْسِدِينَ",
    "translation_en": "But seek, through that which Allah has given you, the home of the Hereafter; and [yet], do not forget your share of the world. And do good as Allah has done good to you. And desire not corruption in the land. Indeed, Allah does not like corrupters.\"",
    "translation_id": "Dan carilah pada apa yang telah dianugerahkan Allah kepadamu (kebahagiaan) negeri akhirat, dan janganlah kamu melupakan bahagianmu dari (kenikmatan) duniawi dan berbuat baiklah (kepada orang lain) sebagaimana Allah telah berbuat baik, kepadamu, dan janganlah kamu berbuat kerusakan di (muka) bumi. Sesungguhnya Allah tidak menyukai orang-orang yang berbuat kerusakan."
  }, {
    "number": 78,
    "text": "قَالَ إِنَّمَآ أُوتِيتُهُۥ عَلَىٰ عِلْمٍ عِندِىٓ أَوَلَمْ يَعْلَمْ أَنَّ ٱللَّهَ قَدْ أَهْلَكَ مِن قَبْلِهِۦ مِنَ ٱلْقُرُونِ مَنْ هُوَ أَشَدُّ مِنْهُ قُوَّةً وَأَكْثَرُ جَمْعًا وَلَا يُسْـَٔلُ عَن ذُنُوبِهِمُ ٱلْمُجْرِمُونَ",
    "translation_en": "He said, \"I was only given it because of knowledge I have.\" Did he not know that Allah had destroyed before him of generations those who were greater than him in power and greater in accumulation [of wealth]? But the criminals, about their sins, will not be asked.",
    "translation_id": "Karun berkata: \"Sesungguhnya aku hanya diberi harta itu, karena ilmu yang ada padaku\". Dan apakah ia tidak mengetahui, bahwasanya Allah sungguh telah membinasakan umat-umat sebelumnya yang lebih kuat daripadanya, dan lebih banyak mengumpulkan harta? Dan tidaklah perlu ditanya kepada orang-orang yang berdosa itu, tentang dosa-dosa mereka."
  }, {
    "number": 79,
    "text": "فَخَرَجَ عَلَىٰ قَوْمِهِۦ فِى زِينَتِهِۦ قَالَ ٱلَّذِينَ يُرِيدُونَ ٱلْحَيَوٰةَ ٱلدُّنْيَا يَٰلَيْتَ لَنَا مِثْلَ مَآ أُوتِىَ قَٰرُونُ إِنَّهُۥ لَذُو حَظٍّ عَظِيمٍ",
    "translation_en": "So he came out before his people in his adornment. Those who desired the worldly life said, \"Oh, would that we had like what was given to Qarun. Indeed, he is one of great fortune.\"",
    "translation_id": "Maka keluarlah Karun kepada kaumnya dalam kemegahannya. Berkatalah orang-orang yang menghendaki kehidupan dunia: \"Moga-moga kiranya kita mempunyai seperti apa yang telah diberikan kepada Karun; sesungguhnya ia benar-benar mempunyai keberuntungan yang besar\"."
  }, {
    "number": 80,
    "text": "وَقَالَ ٱلَّذِينَ أُوتُوا۟ ٱلْعِلْمَ وَيْلَكُمْ ثَوَابُ ٱللَّهِ خَيْرٌ لِّمَنْ ءَامَنَ وَعَمِلَ صَٰلِحًا وَلَا يُلَقَّىٰهَآ إِلَّا ٱلصَّٰبِرُونَ",
    "translation_en": "But those who had been given knowledge said, \"Woe to you! The reward of Allah is better for he who believes and does righteousness. And none are granted it except the patient.\"",
    "translation_id": "Berkatalah orang-orang yang dianugerahi ilmu: \"Kecelakaan yang besarlah bagimu, pahala Allah adalah lebih baik bagi orang-orang yang beriman dan beramal saleh, dan tidak diperoleh pahala itu, kecuali oleh orang-orang yang sabar\"."
  }, {
    "number": 81,
    "text": "فَخَسَفْنَا بِهِۦ وَبِدَارِهِ ٱلْأَرْضَ فَمَا كَانَ لَهُۥ مِن فِئَةٍ يَنصُرُونَهُۥ مِن دُونِ ٱللَّهِ وَمَا كَانَ مِنَ ٱلْمُنتَصِرِينَ",
    "translation_en": "And We caused the earth to swallow him and his home. And there was for him no company to aid him other than Allah, nor was he of those who [could] defend themselves.",
    "translation_id": "Maka Kami benamkanlah Karun beserta rumahnya ke dalam bumi. Maka tidak ada baginya suatu golonganpun yang menolongnya terhadap azab Allah. Dan tiadalah ia termasuk orang-orang (yang dapat) membela (dirinya)."
  }, {
    "number": 82,
    "text": "وَأَصْبَحَ ٱلَّذِينَ تَمَنَّوْا۟ مَكَانَهُۥ بِٱلْأَمْسِ يَقُولُونَ وَيْكَأَنَّ ٱللَّهَ يَبْسُطُ ٱلرِّزْقَ لِمَن يَشَآءُ مِنْ عِبَادِهِۦ وَيَقْدِرُ لَوْلَآ أَن مَّنَّ ٱللَّهُ عَلَيْنَا لَخَسَفَ بِنَا وَيْكَأَنَّهُۥ لَا يُفْلِحُ ٱلْكَٰفِرُونَ",
    "translation_en": "And those who had wished for his position the previous day began to say, \"Oh, how Allah extends provision to whom He wills of His servants and restricts it! If not that Allah had conferred favor on us, He would have caused it to swallow us. Oh, how the disbelievers do not succeed!\"",
    "translation_id": "Dan jadilah orang-orang yang kemarin mencita-citakan kedudukan Karun itu, berkata: \"Aduhai, benarlah Allah melapangkan rezeki bagi siapa yang Dia kehendaki dari hamba-hambanya dan menyempitkannya; kalau Allah tidak melimpahkan karunia-Nya atas kita benar-benar Dia telah membenamkan kita (pula). Aduhai benarlah, tidak beruntung orang-orang yang mengingkari (nikmat Allah)\"."
  }, {
    "number": 83,
    "text": "تِلْكَ ٱلدَّارُ ٱلْءَاخِرَةُ نَجْعَلُهَا لِلَّذِينَ لَا يُرِيدُونَ عُلُوًّا فِى ٱلْأَرْضِ وَلَا فَسَادًا وَٱلْعَٰقِبَةُ لِلْمُتَّقِينَ",
    "translation_en": "That home of the Hereafter We assign to those who do not desire exaltedness upon the earth or corruption. And the [best] outcome is for the righteous.",
    "translation_id": "Negeri akhirat itu, Kami jadikan untuk orang-orang yang tidak ingin menyombongkan diri dan berbuat kerusakan di (muka) bumi. Dan kesudahan (yang baik) itu adalah bagi orang-orang yang bertakwa."
  }, {
    "number": 84,
    "text": "مَن جَآءَ بِٱلْحَسَنَةِ فَلَهُۥ خَيْرٌ مِّنْهَا وَمَن جَآءَ بِٱلسَّيِّئَةِ فَلَا يُجْزَى ٱلَّذِينَ عَمِلُوا۟ ٱلسَّيِّـَٔاتِ إِلَّا مَا كَانُوا۟ يَعْمَلُونَ",
    "translation_en": "Whoever comes [on the Day of Judgement] with a good deed will have better than it; and whoever comes with an evil deed - then those who did evil deeds will not be recompensed except [as much as] what they used to do.",
    "translation_id": "Barangsiapa yang datang dengan (membawa) kebaikan, maka baginya (pahala) yang lebih baik daripada kebaikannya itu; dan barangsiapa yang datang dengan (membawa) kejahatan, maka tidaklah diberi pembalasan kepada orang-orang yang telah mengerjakan kejahatan itu, melainkan (seimbang) dengan apa yang dahulu mereka kerjakan."
  }, {
    "number": 85,
    "text": "إِنَّ ٱلَّذِى فَرَضَ عَلَيْكَ ٱلْقُرْءَانَ لَرَآدُّكَ إِلَىٰ مَعَادٍ قُل رَّبِّىٓ أَعْلَمُ مَن جَآءَ بِٱلْهُدَىٰ وَمَنْ هُوَ فِى ضَلَٰلٍ مُّبِينٍ",
    "translation_en": "Indeed, [O Muhammad], He who imposed upon you the Qur'an will take you back to a place of return. Say, \"My Lord is most knowing of who brings guidance and who is in clear error.\"",
    "translation_id": "Sesungguhnya yang mewajibkan atasmu (melaksanakan hukum-hukum) Al Quran, benar-benar akan mengembalikan kamu ke tempat kembali. Katakanlah: \"Tuhanku mengetahui orang yang membawa petunjuk dan orang yang dalam kesesatan yang nyata\"."
  }, {
    "number": 86,
    "text": "وَمَا كُنتَ تَرْجُوٓا۟ أَن يُلْقَىٰٓ إِلَيْكَ ٱلْكِتَٰبُ إِلَّا رَحْمَةً مِّن رَّبِّكَ فَلَا تَكُونَنَّ ظَهِيرًا لِّلْكَٰفِرِينَ",
    "translation_en": "And you were not expecting that the Book would be conveyed to you, but [it is] a mercy from your Lord. So do not be an assistant to the disbelievers.",
    "translation_id": "Dan kamu tidak pernah mengharap agar Al Quran diturunkan kepadamu, tetapi ia (diturunkan) karena suatu rahmat yang besar dari Tuhanmu, sebab itu janganlah sekali-kali kamu menjadi penolong bagi orang-orang kafir."
  }, {
    "number": 87,
    "text": "وَلَا يَصُدُّنَّكَ عَنْ ءَايَٰتِ ٱللَّهِ بَعْدَ إِذْ أُنزِلَتْ إِلَيْكَ وَٱدْعُ إِلَىٰ رَبِّكَ وَلَا تَكُونَنَّ مِنَ ٱلْمُشْرِكِينَ",
    "translation_en": "And never let them avert you from the verses of Allah after they have been revealed to you. And invite [people] to your Lord. And never be of those who associate others with Allah.",
    "translation_id": "Dan janganlah sekali-kali mereka dapat menghalangimu dari (menyampaikan) ayat-ayat Allah, sesudah ayat-ayat itu diturunkan kepadamu, dan serulah mereka kepada (jalan) Tuhanmu, dan janganlah sekali-sekali kamu termasuk orang-orang yang mempersekutukan Tuhan."
  }, {
    "number": 88,
    "text": "وَلَا تَدْعُ مَعَ ٱللَّهِ إِلَٰهًا ءَاخَرَ لَآ إِلَٰهَ إِلَّا هُوَ كُلُّ شَىْءٍ هَالِكٌ إِلَّا وَجْهَهُۥ لَهُ ٱلْحُكْمُ وَإِلَيْهِ تُرْجَعُونَ",
    "translation_en": "And do not invoke with Allah another deity. There is no deity except Him. Everything will be destroyed except His Face. His is the judgement, and to Him you will be returned.",
    "translation_id": "Janganlah kamu sembah di samping (menyembah) Allah, tuhan apapun yang lain. Tidak ada Tuhan (yang berhak disembah) melainkan Dia. Tiap-tiap sesuatu pasti binasa, kecuali Allah. Bagi-Nya-lah segala penentuan, dan hanya kepada-Nya-lah kamu dikembalikan."
  }],
  "tafsir": {
    "id": {
      "kemenag": {
        "name": "Kemenag",
        "source": "Aplikasi Quran Kementrian Agama Republik Indonesia",
        "text": {
          "1": "tha Sin Mim, lihat tafsir mengenai huruf-huruf hijaiyah pada awal Surah al-Baqarah.",
          "2": "Pada ayat ini, Allah menegaskan bahwa ayat-ayat yang diturunkan kepada Nabi Muhammad adalah ayat-ayat dari Al-Qur'an yang jelas dan mudah dipahami. Ayat-ayat itu memberikan keterangan tentang hal-hal yang berkaitan dengan urusan agama dan mengungkap kisah umat-umat terdahulu yang kebenaran beritanya tidak diketahui oleh manusia di masa itu. Ini menunjukkan bahwa Al-Qur'an bukan buatan Muhammad saw sebagaimana dituduhkan oleh orang-orang musyrik, karena Muhammad adalah seorang ummi yang tidak tahu menulis dan membaca. Beliau juga tidak pernah belajar kepada orang-orang pandai apalagi kepada pendeta-pendeta Ahli Kitab. Dari mana Nabi Muhammad dapat mengetahui kisah umat-umat yang hidup berabad-abad yang lalu kalau tidak dari wahyu yang telah diturunkan Allah kepadanya. Oleh karena itu, tidak dapat diragukan lagi bahwa ayat-ayat Al-Qur'an yang mengandung hukum-hukum dan hal-hal yang berhubungan dengan agama serta kisah-kisah mengenai umat-umat dahulu kala, adalah benar-benar wahyu dari Allah.",
          "3": "Pada ayat ini dijelaskan bahwa Allah membacakan kepada Nabi Muhammad dengan perantaraan Jibril ayat-ayat yang berhubungan dengan kisah Nabi Musa dan Fir'aun untuk menjadi pelajaran bagi orang-orang yang beriman. Dengan memperhatikan kisah itu, di mana mereka mengetahui bahwa nasib orang-orang yang durhaka mendapat azab dan orang-orang mukmin terbebas dari penindasan orang-orang zalim, mereka bertambah yakin bahwa Al-Qur'an memang wahyu yang diturunkan Allah kepada Muhammad saw.\n\nDalam ayat ini disebutkan bahwa kisah Nabi Musa diceritakan khusus bagi kaum mukminin saja, padahal Al-Qur'an diturunkan untuk semua umat manusia baik yang beriman maupun yang kafir. Tujuannya adalah untuk menjelaskan bahwa hanya orang-orang beriman yang dapat mengambil manfaat dari pemaparan kisah-kisah umat terdahulu karena mereka mempunyai pikiran yang jernih dan hati yang suci, serta tidak dipengaruhi oleh hal-hal yang mengotori jiwa dan akal. \n\nAdapun orang-orang kafir dan tetap dalam kekafiran tidak akan mungkin mendapat manfaat daripadanya, karena mereka telah jauh terperosok ke dalam kemusyrikan. Hati mereka telah dikuasai oleh perasaan dengki, sombong, dan takabur, serta suka memperturutkan hawa nafsu, sehingga sulit bagi mereka menerima kebenaran yang bertentangan dengan keinginan dan kemauan mereka. Bagaimana pun jelasnya ayat-ayat dan bukti-bukti yang dikemukakan, mereka akan tetap mengingkari dan menolaknya dengan berbagai alasan yang dicari-cari seperti me-ngatakan bahwa Muhammad saw sudah gila atau mukjizat yang diturunkan kepadanya hanya sihir belaka.",
          "4": "Pada ayat ini, Allah menerangkan kisah Fir'aun yang berkuasa mutlak di negeri Mesir. Tidak ada satu kekuasaan pun yang lebih tinggi dari kekuasaannya. Apa saja yang disukai dan dikehendakinya harus terlaksana. Semua rakyat tunduk dan patuh di bawah perintahnya sampai dia mengangkat dirinya menjadi tuhan. \n\nDengan kekuasaan mutlak itu, ia dapat melakukan kezaliman dan penganiayaan dengan sewenang-wenang. Pemerintahannya bukan berdasar keadilan dan akhlak yang mulia, tetapi berdasarkan kemauan dan keinginan semata. Politik yang dijalankannya adalah memecah belah kaumnya menjadi beberapa golongan. Kemudian ia menanamkan benih pertentangan dan permusuhan pada golongan-golongan itu agar dia tetap berkuasa terhadap mereka. Gerakan apa pun yang dirasakan menentang kekuasaannya harus dibasmi dan dikikis habis. Kalau ada berita atau isu yang mengatakan bahwa seseorang atau satu golongan berusaha untuk menumbangkan kekuasaannya atau mungkin menjadi sebab bagi kejatuhannya, pasti orang atau golongan itu dimusnahkannya. \n\nGolongan yang dianggap setia dan selalu menunjang dan mengokohkan singgasananya akan dimuliakan. Mereka juga diberi berbagai macam fasilitas dan keistimewaan agar menjadi kuat dan jaya. Fir'aun telah menindas Bani Israil karena dianggap golongan yang berbahaya, bila dibiarkan pasti akan menggerogoti pemerintahannya. Dia memperlakukan golongan ini dengan sewenang-wenang, direndahkan dan dihinakan, serta dianggap sebagai golongan budak yang tidak mempunyai hak apa-apa. Golongan ini bahkan dipaksa membangun piramida dan mengerjakan pekerjaan-pekerjaan kasar dan berat lainnya. Apalagi setelah ia mendengar dari tukang-tukang tenungnya bahwa yang akan merobohkan kekuasaannya ialah Bani Israil. Semenjak itu Fir'aun bertekad bulat untuk membasmi golongan ini. \n\nSelain memperlemah dan memperbudak Bani Isra'il, Fir'aun juga memutuskan setiap anak laki-laki yang lahir di kalangan Bani Israil harus dibunuh, tanpa belas kasihan. Ia tidak mempedulikan ratap tangis ibu yang kehilangan anak yang dikandungnya dengan susah payah selama sembilan bulan dan menjadi tumpuan harapannya.\n\nDengan tindakan ini, Fir'aun menyangka bahwa Bani Israil akan punah dengan sendirinya karena tidak ada lagi keturunan anak laki-laki yang akan lahir dan berkembang. Adapun anak-anak perempuan dibiarkan hidup karena selain dianggap lemah dan tak mampu melawan, mereka juga digunakan sebagai pemuas nafsu. Oleh karena itu, Allah mencap Firaun sebagai orang yang berbuat kebinasaan di muka bumi. \n\nSebenarnya banyak cara lain yang tidak bertentangan dengan peri kemanusiaan yang dapat dilakukan Fir'aun untuk menghalangi terjadinya apa yang ditakutkannya itu. Akan tetapi, karena hatinya sudah keras membatu dan pikirannya sudah gelap, tidak ada lagi jalan yang tampak olehnya kecuali membasmi semua anak laki-laki Bani Israil. Fir'aun lalu menyebarkan mata-mata ke seluruh pelosok negeri Mesir untuk menyelidiki semua perempuan. Bila ada di antara mereka yang hamil, langsung dicatat dan ditunggu masa melahirkannya. Bila yang dilahirkan anak perempuan akan dibiarkan saja, tetapi kalau yang dilahirkan anak laki-laki langsung diambil untuk dibunuh.\n\nApakah dengan tindakan itu Fir'aun dapat mempertahankan kekuasaannya? Pasti tidak! Karena di balik kekuasaannya itu, ada kekuasaan yang jauh lebih perkasa yaitu kekuasaan Allah yang tak dapat dikalahkan oleh siapa pun. Dialah Maha Pencipta, Mahakuasa, dan Mahaperkasa.\n\nDiriwayatkan oleh as-Suddi bahwa Fir'aun bermimpi melihat api datang ke negerinya dari Baitul Makdis. Api itu membakar rumah-rumah kaum Fir'aun dan membiarkan rumah-rumah Bani Israil. Fir'aun bertanya kepada orang-orang cerdik-pandai dan tukang-tukang tenung. Mereka menjawab bahwa takwil mimpi itu ialah akan lahir seorang anak laki-laki (dari Bani Israil) yang akan meruntuhkan kekuasaannya di Mesir. Takwil inilah yang mendorong Fir'aun melakukan tindakan kejam dan ganas itu.",
          "5": "Pada ayat ini, Allah menerangkan bahwa Dia akan melimpahkan rahmat dan karunia-Nya kepada Bani Israil yang tertindas dan lemah itu dengan memberikan kepada mereka kekuatan dan kekuasaan duniawi dan agama. Maka berkat perjuangan Bani Israil, berdirilah satu kerajaan yang besar dan kuat di negeri Syam dan akhirnya mereka mempunyai kekuasaan yang besar di Mesir yang dahulunya pernah menindas dan memperbudak mereka. Hal ini ditegaskan Allah dalam firman-Nya:\n\nDan Kami wariskan kepada kaum yang tertindas itu, bumi bagian timur dan bagian baratnya yang telah Kami berkahi. Dan telah sempurnalah firman Tuhanmu yang baik itu (sebagai janji) untuk Bani Israil disebabkan kesabaran mereka. Dan Kami hancurkan apa yang telah dibuat Fir'aun dan kaumnya dan apa yang telah mereka bangun. (al-A'raf/7: 137)\n\nDemikianlah, bila Allah menghendaki sesuatu, pasti terlaksana. Bagaimana pun kuatnya Fir'aun dengan tentara dan kekayaannya serta bagaimana pun lemahnya Bani Israil sampai tidak mempunyai kekuasaan sedikit pun bahkan selalu ditindas, dianiaya, dan dimusuhi, tetapi karena Allah hendak memuliakan mereka, ada saja jalan dan kesempatan bagi mereka untuk bangkit dan bergerak. Berkat keuletan dan kesabaran, mereka berhasil menguasai negeri Mesir yang pernah memperbudak mereka. \n\nAllah memperlihatkan kepada Fir'aun apa yang selalu ditakutinya, juga oleh Haman (menterinya) dan tentaranya, yaitu keruntuhan kerajaan mereka dengan lahirnya seorang bayi, yaitu Musa. Bayi ini luput dari pengawasan Fir'aun, bahkan diasuh dan dididik di istananya, serta dimanjakan dan dibesarkan dengan penuh kasih sayang. Padahal, bayi itulah nanti, di waktu besarnya, yang akan menumbangkan kekuasaannya, menghancurkan tentaranya dan menaklukkan negaranya. Bagaimana pedihnya luka di hati Fir'aun ketika melihat anak yang disayangi dan dimanjakan, menantang dan melawan kekuasaannya. \n\nKesombongan, takabur, dan keangkuhan Fir'aun memang tak ada gunanya ketika berhadapan dengan kekuasaan dan keperkasaan Allah. Semua tindakannya dibalas dengan tindakan yang setimpal. Di antara tindakan yang dilakukan oleh Fir'aun yang melampaui batas adalah:\n\n1. Menganggap dirinya berkuasa mutlak sehingga ia bersikap takabur dan sombong bahkan mendakwakan dirinya sebagai tuhan.\n\n2. Untuk menjamin kelanggengan kekuasaannya, dia memecah belah bangsanya, memusnahkan golongan yang menentangnya, membunuh semua bayi laki-laki Bani Israil, dan membiarkan anak-anak perempuan mereka hidup untuk dipekerjakan dan dijadikan sebagai gundik dan dayang-dayang kerajaan.\n\n3. Berlaku sewenang-wenang dan berbuat kerusakan di muka bumi.\n\nTindakan Fir'aun itu dibalas oleh Allah dengan beberapa tindakan pula, yaitu:\n\n1. Allah membebaskan Bani Israil dari cengkeraman Fir'aun dan kaumnya dan menjadikan mereka pemuka dan pemimpin di dunia.\n\n2. Allah mewariskan kepada mereka negeri Syam dengan menjadikan mereka berkuasa di sana dan memberikan tempat di muka bumi.\n\n3. Allah memperlihatkan kepada Fir'aun, Haman, dan tentaranya bagaimana keruntuhan kekuasaan mereka. \n\nDemikianlah Allah memperlihatkan kekuasaan-Nya. Suatu hal yang rasanya tidak mungkin, bisa terjadi yaitu tumbangnya suatu kekuasaan besar oleh orang-orang yang lemah, tertindas dan teraniaya. Sungguh Allah telah memberikan kekuasaan kepada siapa yang dikehendaki-Nya, membuat dan mencabut kekuasaan dari siapa yang dikehendaki-Nya sebagaimana tersebut dalam firman-Nya:\n\nKatakanlah (Muhammad), \"Wahai Tuhan pemilik kekuasaan, Engkau berikan kekuasaan kepada siapa pun yang Engkau kehendaki, dan Engkau cabut kekuasaan dari siapa pun yang Engkau kehendaki. Engkau muliakan siapa pun yang Engkau kehendaki dan Engkau hinakan siapa pun yang Engkau kehendaki. Di tangan Engkaulah segala kebajikan. Sungguh, Engkau Mahakuasa atas segala suatu. (ali 'Imran/3: 26)",
          "6": "Pada ayat ini, Allah menerangkan bahwa Dia akan melimpahkan rahmat dan karunia-Nya kepada Bani Israil yang tertindas dan lemah itu dengan memberikan kepada mereka kekuatan dan kekuasaan duniawi dan agama. Maka berkat perjuangan Bani Israil, berdirilah satu kerajaan yang besar dan kuat di negeri Syam dan akhirnya mereka mempunyai kekuasaan yang besar di Mesir yang dahulunya pernah menindas dan memperbudak mereka. Hal ini ditegaskan Allah dalam firman-Nya:\n\nDan Kami wariskan kepada kaum yang tertindas itu, bumi bagian timur dan bagian baratnya yang telah Kami berkahi. Dan telah sempurnalah firman Tuhanmu yang baik itu (sebagai janji) untuk Bani Israil disebabkan kesabaran mereka. Dan Kami hancurkan apa yang telah dibuat Fir'aun dan kaumnya dan apa yang telah mereka bangun. (al-A'raf/7: 137)\n\nDemikianlah, bila Allah menghendaki sesuatu, pasti terlaksana. Bagaimana pun kuatnya Fir'aun dengan tentara dan kekayaannya serta bagaimana pun lemahnya Bani Israil sampai tidak mempunyai kekuasaan sedikit pun bahkan selalu ditindas, dianiaya, dan dimusuhi, tetapi karena Allah hendak memuliakan mereka, ada saja jalan dan kesempatan bagi mereka untuk bangkit dan bergerak. Berkat keuletan dan kesabaran, mereka berhasil menguasai negeri Mesir yang pernah memperbudak mereka. \n\nAllah memperlihatkan kepada Fir'aun apa yang selalu ditakutinya, juga oleh Haman (menterinya) dan tentaranya, yaitu keruntuhan kerajaan mereka dengan lahirnya seorang bayi, yaitu Musa. Bayi ini luput dari pengawasan Fir'aun, bahkan diasuh dan dididik di istananya, serta dimanjakan dan dibesarkan dengan penuh kasih sayang. Padahal, bayi itulah nanti, di waktu besarnya, yang akan menumbangkan kekuasaannya, menghancurkan tentaranya dan menaklukkan negaranya. Bagaimana pedihnya luka di hati Fir'aun ketika melihat anak yang disayangi dan dimanjakan, menantang dan melawan kekuasaannya. \n\nKesombongan, takabur, dan keangkuhan Fir'aun memang tak ada gunanya ketika berhadapan dengan kekuasaan dan keperkasaan Allah. Semua tindakannya dibalas dengan tindakan yang setimpal. Di antara tindakan yang dilakukan oleh Fir'aun yang melampaui batas adalah:\n\n1. Menganggap dirinya berkuasa mutlak sehingga ia bersikap takabur dan sombong bahkan mendakwakan dirinya sebagai tuhan.\n\n2. Untuk menjamin kelanggengan kekuasaannya, dia memecah belah bangsanya, memusnahkan golongan yang menentangnya, membunuh semua bayi laki-laki Bani Israil, dan membiarkan anak-anak perempuan mereka hidup untuk dipekerjakan dan dijadikan sebagai gundik dan dayang-dayang kerajaan.\n\n3. Berlaku sewenang-wenang dan berbuat kerusakan di muka bumi.\n\nTindakan Fir'aun itu dibalas oleh Allah dengan beberapa tindakan pula, yaitu:\n\n1. Allah membebaskan Bani Israil dari cengkeraman Fir'aun dan kaumnya dan menjadikan mereka pemuka dan pemimpin di dunia.\n\n2. Allah mewariskan kepada mereka negeri Syam dengan menjadikan mereka berkuasa di sana dan memberikan tempat di muka bumi.\n\n3. Allah memperlihatkan kepada Fir'aun, Haman, dan tentaranya bagaimana keruntuhan kekuasaan mereka. \n\nDemikianlah Allah memperlihatkan kekuasaan-Nya. Suatu hal yang rasanya tidak mungkin, bisa terjadi yaitu tumbangnya suatu kekuasaan besar oleh orang-orang yang lemah, tertindas dan teraniaya. Sungguh Allah telah memberikan kekuasaan kepada siapa yang dikehendaki-Nya, membuat dan mencabut kekuasaan dari siapa yang dikehendaki-Nya sebagaimana tersebut dalam firman-Nya:\n\nKatakanlah (Muhammad), \"Wahai Tuhan pemilik kekuasaan, Engkau berikan kekuasaan kepada siapa pun yang Engkau kehendaki, dan Engkau cabut kekuasaan dari siapa pun yang Engkau kehendaki. Engkau muliakan siapa pun yang Engkau kehendaki dan Engkau hinakan siapa pun yang Engkau kehendaki. Di tangan Engkaulah segala kebajikan. Sungguh, Engkau Mahakuasa atas segala suatu. (ali 'Imran/3: 26)",
          "7": "Ayat ini menggambarkan situasi yang sangat mencemaskan ibu Musa yang akan melahirkan anaknya. Ia tahu bahwa anak itu akan direnggut dari pangkuannya dan akan dibunuh tanpa rasa iba dan belas kasihan. Walaupun kelahiran Musa dapat disembunyikan, tetapi lama-kelamaan pasti akan diketahui oleh mata-mata Fir'aun yang banyak bertebaran di pelosok negeri, sehingga nasib bayinya akan sama dengan nasib bayi-bayi Bani Israil lainnya. Setelah melahirkan Musa, ibunya selalu merasa gelisah dan khawatir memikirkan nasib anaknya yang telah dikandungnya dengan susah payah selama sembilan bulan yang menjadi tumpuan harapan setelah bayi itu besar. Oleh karena itu, ia selalu memohon kepada Allah agar anaknya diselamatkan dari bahaya maut yang selalu mengancamnya. \n\nDalam keadaan gelisah dan cemas itu, Allah mengilhamkan kepada ibu Musa bahwa dia tidak perlu khawatir dan cemas. Hendaklah dia tetap menyusui dan menjaganya dengan sebaik-baiknya. Bila dia merasa takut karena ada tanda-tanda bahwa anaknya itu akan diketahui oleh Fir'aun, maka hendaklah ia melemparkan anak itu ke sungai Nil. Ibu Musa diperintahkan Allah untuk tidak merasa ragu dan khawatir, karena Dia akan menjaga dan mengembalikan Musa ke pangkuannya. Kelak anak itu akan menjadi rasul Allah yang akan menyampaikan dakwah kepada Fir'aun.",
          "8": "Pada ayat ini dijelaskan bagaimana ibu Musa melaksanakan ilham yang diterimanya karena ia yakin apa yang dijanjikan Allah kepadanya pasti terjadi. Setelah bayi Musa dibungkus badannya dan dimasukkan ke dalam peti, Musa dihanyutkan ke sungai Nil dan arus sungai membawanya ke arah istana Fir'aun yang dibangun di tepi sungai itu. \n\nSalah seorang keluarga Fir'aun melihat peti itu terapung-apung dibawa arus sungai dan segera mengambil dan membawanya kepada istri Fir'aun. Setelah dibuka, ia sangat terkejut ketika melihat bahwa isi peti itu adalah seorang bayi. Saat itu juga timbul kasih sayang istri Fir'aun kepada bayi itu. Dengan cepat dibawanya bayi itu kepada Fir'aun. Tanpa ragu-ragu Fir'aun memerintahkan supaya bayi itu dibunuh karena takut kalau ia keturunan Bani Israil. Akan tetapi, istri Fir'aun membujuknya agar tidak membunuh bayi itu, dan mengangkatnya sebagai anak dengan harapan kelak anak itu akan berjasa kepada Fir'aun dan kerajaannya. Akhirnya Fir'aun mengizinkan anak itu diasuh dan dipelihara oleh istrinya, tanpa menyadari bahwa Allah menghendaki kejadian ini.\n\nAllah menghendaki apabila anak itu dewasa nanti, ia akan menjadi musuh Fir'aun yang paling besar dan akan menumbangkan kekuasaannya, bukan menjadi anak yang akan berjasa dan berbakti kepadanya. Demikianlah Allah menakdirkan keruntuhan kekuasaan Fir'aun, sebagai balasan atas kesombongan, kezaliman, dan kekejamannya terhadap Bani Israil. Sesungguhnya Fir'aun, Haman, dan tentaranya telah berbuat kesalahan besar dengan melakukan kekejaman itu. Sudah sewajarnya Allah menghancurkan kekuasaan Fir'aun itu dengan perantaraan seorang keturunan Bani Israil yang dihinakannya.",
          "9": "Pada ayat ini, Allah menjelaskan jawaban istri Fir'aun untuk mempertahankan bayi itu agar tidak dibunuh, karena Fir'aun khawatir kalau bayi itu anak seorang Bani Israil yang dikhawatirkan akan menghancurkan kekuasaannya. Istri Fir'aun yang telah telanjur menyayangi anak itu karena tertarik melihat parasnya yang rupawan mengatakan, \"Janganlah engkau bunuh anak ini karena saya amat sayang dan tertarik kepadanya. Biarkanlah saya mengasuh dan mendidiknya. Dia akan menjadi penghibur hatiku dan hatimu di kala susah. Siapa tahu di kemudian hari dia akan berjasa kepada kita. Atau alangkah baiknya kalau dia kita ambil menjadi anak angkat kita, karena sampai sekarang kita belum dikaruniai seorang anak pun.\" Karena kegigihan istri Fir'aun dan alasan-alasan logis yang dikemukakannya, akhirnya Fir'aun membiarkan anak itu hidup dan diasuh sendiri oleh istrinya. \n\nDemikianlah takdir Allah. Dia telah menjadikan istri Fir'aun menyayangi anak itu dan menjadikan hati Fir'aun lunak karena rayuan istrinya sehingga anak itu tidak jadi dibunuh. Padahal, anak itulah kelak yang akan menentang Fir'aun dan akan menjadi musuhnya yang utama tanpa dia sadari sedikit pun.",
          "10": "Pada ayat ini, Allah menerangkan bagaimana keadaan ibu Musa setelah ia melemparkan anaknya ke sungai Nil untuk melaksanakan ilham yang diterimanya dari Allah. Walaupun tindakan yang dilakukannya berdasarkan ilham dari Allah dengan janji bahwa anaknya akan dikembalikan kepadanya, namun ia tetap gelisah dan tidak pernah merasa tenteram memikirkan nasib anaknya yang telah dihanyutkan ke sungai Nil. \n\nBerbagai macam pertanyaan terlintas dalam pikiran ibu Musa. Kadang-kadang dia menyesali dirinya telah melakukan perbuatan itu. Bagaimanakah cara menemukan anaknya kembali? Apakah dia akan berteriak-teriak dan mengakui bahwa dia telah melemparkan anaknya ke sungai, kemudian minta tolong kepada khalayak ramai untuk mencarinya? Benar-benar hati dan pikirannya telah kosong. Dia telah kehilangan akal dan kesadaran sehingga tak dapat berpikir lagi. Akan tetapi, Allah menguatkan hatinya dan menenteramkan pikirannya sehingga sadar dan percaya bahwa Allah telah menjanjikan akan mengembalikan anaknya ke pangkuannya dan kelak akan mengangkatnya menjadi rasul.",
          "11": "Walaupun ibu Musa telah melaksanakan apa yang diilhamkan Allah kepadanya, namun hatinya belum tenteram. Oleh sebab itu, ia menyuruh anak perempuannya (kakak Musa) mencari-cari berita tentang Musa. Lalu kakak Musa pergi mengikuti peti yang berisi Musa. Akhirnya dia melihat dari kejauhan peti itu telah memasuki kawasan Fir'aun dan disela-matkan keluarganya. Meskipun peristiwa ini disaksikan orang banyak, tetapi mereka tidak menyadari kehadiran Musa di antara mereka. \n\nDi istana orang-orang sibuk mencari siapa yang cocok menyusukan anak itu, karena ia menolak setiap wanita yang hendak menyusukannya. Setelah saudara Musa mengetahui hal ini, dia pun memberanikan diri tampil ke muka dan mengatakan bahwa ia mengetahui seorang wanita yang sehat dan banyak air susunya. Mungkin anak itu mau disusukan oleh wanita tersebut. Wanita itu dari keluarga baik-baik dan anak itu pasti akan dijaga dengan penuh perhatian dan penuh rasa kasih sayang.\n\nDiriwayatkan dari Ibnu 'Abbas bahwa setelah saudara Musa mengucapkan kata-kata itu, lalu ibu Musa dibawa ke istana, mereka memandang kepadanya dengan rasa curiga dan mengemukakan pertanyaan, \"Dari mana engkau tahu bahwa wanita itu akan menjaganya dengan baik dan akan menumpahkan kasih sayang terhadapnya?\" Saudara Musa menjawab, \"Tentu saja ia akan berbuat demikian karena mengharapkan kesenangan hati raja Fir'aun dan mengharapkan pemberian yang banyak darinya.\" Dengan jawaban ini hilanglah kecurigaan mereka. \n\nMusa kemudian dibawa kembali ke rumah ibunya. Sesampainya di rumah, ibunya meletakkan Musa di pangkuannya untuk disusukan. Dengan segera mulut Musa menangkap puting susu ibunya. Mereka yang hadir sangat gembira melihat hal itu dan dikirimlah utusan permaisuri raja untuk memberitakan hal itu. Permaisuri memanggil ibu Musa dan memberinya hadiah dan pemberian yang banyak serta meminta kepadanya supaya ia bersedia tinggal di istana untuk merawat dan mengasuh Musa. Ibu Musa menolak tawaran itu dengan halus dan mengatakan kepada permaisuri bahwa dia mempunyai suami dan anak-anak dan tidak sampai hati meninggalkan mereka. Dia memohon agar permaisuri mengizinkannya membawa Musa ke rumahnya. Permaisuri tidak merasa keberatan atas usul itu dan mengizinkan Musa dibawa ke rumah ibunya. Permaisuri memberinya perongkosan yang cukup. Di samping itu, permaisuri juga memberinya hadiah berupa uang, pakaian, dan lain sebagainya. Akhirnya kembalilah ibu Musa ke rumah membawa anak kandungnya dengan hati yang senang dan gembira.\n\nAllah telah menghilangkan semua kegelisahan dan kekhawatiran ibu Musa dan menggantinya dengan ketenteraman, kemuliaan, dan rezeki yang melimpah dan mengembalikan Musa untuk tinggal bersama ibunya.",
          "12": "Walaupun ibu Musa telah melaksanakan apa yang diilhamkan Allah kepadanya, namun hatinya belum tenteram. Oleh sebab itu, ia menyuruh anak perempuannya (kakak Musa) mencari-cari berita tentang Musa. Lalu kakak Musa pergi mengikuti peti yang berisi Musa. Akhirnya dia melihat dari kejauhan peti itu telah memasuki kawasan Fir'aun dan disela-matkan keluarganya. Meskipun peristiwa ini disaksikan orang banyak, tetapi mereka tidak menyadari kehadiran Musa di antara mereka. \n\nDi istana orang-orang sibuk mencari siapa yang cocok menyusukan anak itu, karena ia menolak setiap wanita yang hendak menyusukannya. Setelah saudara Musa mengetahui hal ini, dia pun memberanikan diri tampil ke muka dan mengatakan bahwa ia mengetahui seorang wanita yang sehat dan banyak air susunya. Mungkin anak itu mau disusukan oleh wanita tersebut. Wanita itu dari keluarga baik-baik dan anak itu pasti akan dijaga dengan penuh perhatian dan penuh rasa kasih sayang.\n\nDiriwayatkan dari Ibnu 'Abbas bahwa setelah saudara Musa mengucapkan kata-kata itu, lalu ibu Musa dibawa ke istana, mereka memandang kepadanya dengan rasa curiga dan mengemukakan pertanyaan, \"Dari mana engkau tahu bahwa wanita itu akan menjaganya dengan baik dan akan menumpahkan kasih sayang terhadapnya?\" Saudara Musa menjawab, \"Tentu saja ia akan berbuat demikian karena mengharapkan kesenangan hati raja Fir'aun dan mengharapkan pemberian yang banyak darinya.\" Dengan jawaban ini hilanglah kecurigaan mereka. \n\nMusa kemudian dibawa kembali ke rumah ibunya. Sesampainya di rumah, ibunya meletakkan Musa di pangkuannya untuk disusukan. Dengan segera mulut Musa menangkap puting susu ibunya. Mereka yang hadir sangat gembira melihat hal itu dan dikirimlah utusan permaisuri raja untuk memberitakan hal itu. Permaisuri memanggil ibu Musa dan memberinya hadiah dan pemberian yang banyak serta meminta kepadanya supaya ia bersedia tinggal di istana untuk merawat dan mengasuh Musa. Ibu Musa menolak tawaran itu dengan halus dan mengatakan kepada permaisuri bahwa dia mempunyai suami dan anak-anak dan tidak sampai hati meninggalkan mereka. Dia memohon agar permaisuri mengizinkannya membawa Musa ke rumahnya. Permaisuri tidak merasa keberatan atas usul itu dan mengizinkan Musa dibawa ke rumah ibunya. Permaisuri memberinya perongkosan yang cukup. Di samping itu, permaisuri juga memberinya hadiah berupa uang, pakaian, dan lain sebagainya. Akhirnya kembalilah ibu Musa ke rumah membawa anak kandungnya dengan hati yang senang dan gembira.\n\nAllah telah menghilangkan semua kegelisahan dan kekhawatiran ibu Musa dan menggantinya dengan ketenteraman, kemuliaan, dan rezeki yang melimpah dan mengembalikan Musa untuk tinggal bersama ibunya.",
          "13": "Ayat ini menerangkan bahwa janji Allah kepada ibu Musa telah terlaksana yaitu mengembalikan Musa kepadanya supaya hatinya menjadi tenteram dan tidak lagi merasa sedih. Demikian pula Allah telah menepati janji-Nya untuk mengangkat Musa menjadi rasul, tetapi kebanyakan manusia tidak mengetahuinya. Siapa yang mengira bahwa seorang anak yang telah diincar maut karena dia anak dari Bani Israil kemudian disayangi dan diasuh dalam istana dengan penuh rasa cinta dan kasih dengan harapan dia akan berjasa bila dia dewasa. Akan tetapi, ternyata anak itu akan menjadi rasul dan menentang kekuasaan Fir'aun, bahkan meruntuhkan kerajaan itu sendiri.",
          "14": "Pada ayat-ayat ini diterangkan bahwa setelah dewasa, Allah mengaruniakan kepada Musa ilmu dan hikmah karena ketaatan dan kepatuhannya kepada Tuhan serta kesabarannya menghadapi berbagai cobaan. Sudah sewajarnyalah bila Musa mengetahui dari ibunya bagaimana ia sampai dapat tinggal di istana keluarga raja Fir'aun, padahal ia hanya anak orang biasa dari Bani Israil yang selalu dihina dan diperhamba oleh Fir'aun dan kaumnya. Hal ini akan menimbulkan simpati Musa kepada Bani Israil walaupun Fir'aun telah berjasa mendidik dan mengasuhnya semenjak kecil sampai menjadi seorang laki-laki dewasa yang sehat wal afiat, baik fisik maupun mentalnya.\n\nRasa simpati kepada kerabat dan kaumnya adalah naluri yang tidak dapat dipisahkan dari jiwa seseorang, apalagi dari diri Musa yang setiap hari melihat Bani Israil ditindas dan dianiaya oleh orang-orang Qibthi penduduk negeri Mesir. Akan tetapi, berkat kesabaran yang dimilikinya, sebagai karunia Allah, ia dapat menahan hatinya sampai Allah memberikan jalan baginya untuk mengangkat kaumnya dari lembah kehinaan dan penderitaan. Karena kesabaran, kebaikan budi dan tingkah laku, serta kepatuhannya menjalankan ajaran agama, Musa dikaruniai Allah ilmu dan hikmah sebagai persiapan untuk diangkat menjadi rasul. Ia diutus untuk menyampaikan risalah Allah kepada kaumnya dan Fir'aun yang sangat sombong, takabur, dan mengangkat dirinya sebagai tuhan.",
          "15": "Pada suatu hari, Musa menyelinap masuk ke kota tanpa diketahui orang banyak, ketika orang-orang sedang tidur siang hari sesudah waktu Zuhur. Di sana ia melihat dua orang sedang berkelahi, yang seorang dari kaum Bani Israil dan seorang lagi dari penduduk asli negeri Mesir yang dianggapnya sebagai musuh karena selalu menghina dan menganggap rendah golongan Bani Israil. Orang yang berasal dari Bani Israil berteriak meminta tolong untuk melepaskan diri dari kekejaman lawannya.\n\nDidorong rasa fanatik kepada kaumnya, dengan cepat Musa memburu orang Mesir itu. Karena amarah dan tanpa memikirkan akibat perbuatannya, Musa memukul orang Mesir itu dengan sekuat tenaga. Akibat pukulan itu, orang Mesir itu roboh seketika dan mati. Sebenarnya Musa tidak berniat sama sekali hendak membunuhnya, tetapi ternyata orang itu mati hanya dengan sekali pukulan saja. Musa amat menyesal atas ketelanjurannya dan menganggap tindakannya itu salah, tindakan yang tergopoh-gopoh. Dia berkata kepada dirinya sendiri bahwa perbuatannya adalah perbuatan setan yang selalu memperdayakan manusia agar melakukan kezaliman dan maksiat. Sesungguhnya ia telah terperosok masuk perangkap setan yang menjadi musuh manusia dan selalu berusaha untuk menyesatkannya.",
          "16": "Pada ayat ini dijelaskan bahwa di saat menyadari kesalahannya, Musa memohon ampun kepada Tuhan, seraya berkata, \"Sesungguhnya aku telah menganiaya diriku sendiri dengan melakukan pembunuhan terhadap orang yang tidak boleh dibunuh. Maka ampunilah dosaku dan janganlah Engkau siksa aku karena perbuatan yang tidak kusengaja itu.\" Allah Yang Maha Pengampun dan Maha Penyayang terhadap hamba-Nya, mengampuni kesalahan Musa. Dengan pengampunan itu, hati Musa menjadi tenteram dan bebas dari kebimbangan dan kesusahan memikirkan nasibnya karena melakukan perbuatan dosa. Sesungguhnya pengampunan itu adalah rahmat dan karunia Allah. Di antara karunia Allah kepada Musa disebutkan dalam firman-Nya:\n\nDan engkau pernah membunuh seseorang, lalu Kami selamatkan engkau dari kesulitan (yang besar) dan Kami telah mencobamu dengan beberapa cobaan (yang berat). (thaha/20: 40)\n\nMusa berjanji tidak akan melakukan kesalahan itu lagi dan tidak akan menjadi penolong bagi orang yang melakukan kesalahan. Apalagi pertolongan itu akan menyebabkan penganiayaan atau pembunuhan dan mencelakakan diri sendiri.",
          "17": "Pada ayat ini dijelaskan bahwa di saat menyadari kesalahannya, Musa memohon ampun kepada Tuhan, seraya berkata, \"Sesungguhnya aku telah menganiaya diriku sendiri dengan melakukan pembunuhan terhadap orang yang tidak boleh dibunuh. Maka ampunilah dosaku dan janganlah Engkau siksa aku karena perbuatan yang tidak kusengaja itu.\" Allah Yang Maha Pengampun dan Maha Penyayang terhadap hamba-Nya, mengampuni kesalahan Musa. Dengan pengampunan itu, hati Musa menjadi tenteram dan bebas dari kebimbangan dan kesusahan memikirkan nasibnya karena melakukan perbuatan dosa. Sesungguhnya pengampunan itu adalah rahmat dan karunia Allah. Di antara karunia Allah kepada Musa disebutkan dalam firman-Nya:\n\nDan engkau pernah membunuh seseorang, lalu Kami selamatkan engkau dari kesulitan (yang besar) dan Kami telah mencobamu dengan beberapa cobaan (yang berat). (thaha/20: 40)\n\nMusa berjanji tidak akan melakukan kesalahan itu lagi dan tidak akan menjadi penolong bagi orang yang melakukan kesalahan. Apalagi pertolongan itu akan menyebabkan penganiayaan atau pembunuhan dan mencelakakan diri sendiri.",
          "18": "Pengampunan Allah telah menjadikan hatinya lega dan lapang, tetapi bagaimana dengan penduduk asli Mesir di mana ia hidup di kalangan mereka? Apakah mereka akan membiarkan saja bila pembunuhan itu mereka ketahui? Inilah yang sangat mengganggu ketenteraman hati Musa dan selalu menjadi beban pikirannya. Oleh sebab itu, dengan sembunyi-sembunyi Musa mencari informasi apakah perbuatannya itu telah diketahui orang, dan bila mereka telah mengetahuinya, bagaimana sikap mereka? Tindakan apakah yang akan mereka ambil terhadapnya? \n\nKetika ia menyusuri kota itu, kelihatan olehnya orang yang ditolong dahulu dan berteriak lagi minta tolong agar ia membantunya sekali lagi melawan orang Mesir yang lain. Rupanya orang yang ditolongnya dahulu itu kembali terlibat dalam perkelahian dengan orang Mesir lainnya. Mungkin orang itu meminta kepadanya supaya ia membunuh orang Mesir itu sebagaimana ia telah membunuh dahulu. Tergambarlah dalam otaknya bagaimana ia telah dosa dengan pembunuhan itu, tetapi Tuhan dengan rahmat dan kasih sayang-Nya, telah mengampuni kesalahannya. Apakah ia akan berbuat kesalahan lagi, apalagi ia telah berjanji dengan Tuhannya bahwa dia tidak akan mengulangi lagi perbuatan itu. \n\nOleh sebab itu, Musa berkata kepada orang Israil itu bahwa ia adalah orang yang sesat. Akan tetapi, tergambar pula dalam pikirannya bagaimana nasib kaumnya yang terhina dan selalu dianiaya oleh orang-orang Mesir, maka bangkit pulalah rasa amarahnya dan hampir saja ia menyerang orang Mesir itu. Namun sebelum ia menyerang, orang Mesir itu membentaknya dengan mengatakan apakah ia hendak membunuhnya seperti ia membunuh kawannya kemarin? Rupanya orang itu sudah mengenali wajah Musa karena orang-orang di kota ramai membicarakan pembunuhan itu dan pelakunya. \n\nKemudian orang Mesir itu membentaknya dan mengatakan, \"Sesungguhnya engkau telah bertindak sewenang-wenang di muka bumi. Engkau bukanlah termasuk orang-orang yang berbuat baik.\" Dengan bentakan itu, Musa sadar dan ingat akan janjinya bahwa dia tidak akan mengulangi kesalahannya lagi sehingga dia tidak jadi memukul orang itu.\n\nMenurut pendapat sebagian mufasir yang mengucapkan kata-kata tersebut kepada Musa bukanlah orang Mesir tetapi orang Israil yang telah ditolongnya, karena Musa menuduhnya sebagai orang yang sesat dan hendak memukulnya.",
          "19": "Pengampunan Allah telah menjadikan hatinya lega dan lapang, tetapi bagaimana dengan penduduk asli Mesir di mana ia hidup di kalangan mereka? Apakah mereka akan membiarkan saja bila pembunuhan itu mereka ketahui? Inilah yang sangat mengganggu ketenteraman hati Musa dan selalu menjadi beban pikirannya. Oleh sebab itu, dengan sembunyi-sembunyi Musa mencari informasi apakah perbuatannya itu telah diketahui orang, dan bila mereka telah mengetahuinya, bagaimana sikap mereka? Tindakan apakah yang akan mereka ambil terhadapnya? \n\nKetika ia menyusuri kota itu, kelihatan olehnya orang yang ditolong dahulu dan berteriak lagi minta tolong agar ia membantunya sekali lagi melawan orang Mesir yang lain. Rupanya orang yang ditolongnya dahulu itu kembali terlibat dalam perkelahian dengan orang Mesir lainnya. Mungkin orang itu meminta kepadanya supaya ia membunuh orang Mesir itu sebagaimana ia telah membunuh dahulu. Tergambarlah dalam otaknya bagaimana ia telah dosa dengan pembunuhan itu, tetapi Tuhan dengan rahmat dan kasih sayang-Nya, telah mengampuni kesalahannya. Apakah ia akan berbuat kesalahan lagi, apalagi ia telah berjanji dengan Tuhannya bahwa dia tidak akan mengulangi lagi perbuatan itu. \n\nOleh sebab itu, Musa berkata kepada orang Israil itu bahwa ia adalah orang yang sesat. Akan tetapi, tergambar pula dalam pikirannya bagaimana nasib kaumnya yang terhina dan selalu dianiaya oleh orang-orang Mesir, maka bangkit pulalah rasa amarahnya dan hampir saja ia menyerang orang Mesir itu. Namun sebelum ia menyerang, orang Mesir itu membentaknya dengan mengatakan apakah ia hendak membunuhnya seperti ia membunuh kawannya kemarin? Rupanya orang itu sudah mengenali wajah Musa karena orang-orang di kota ramai membicarakan pembunuhan itu dan pelakunya. \n\nKemudian orang Mesir itu membentaknya dan mengatakan, \"Sesungguhnya engkau telah bertindak sewenang-wenang di muka bumi. Engkau bukanlah termasuk orang-orang yang berbuat baik.\" Dengan bentakan itu, Musa sadar dan ingat akan janjinya bahwa dia tidak akan mengulangi kesalahannya lagi sehingga dia tidak jadi memukul orang itu.\n\nMenurut pendapat sebagian mufasir yang mengucapkan kata-kata tersebut kepada Musa bukanlah orang Mesir tetapi orang Israil yang telah ditolongnya, karena Musa menuduhnya sebagai orang yang sesat dan hendak memukulnya.",
          "20": "Pada ayat ini, Allah menerangkan bahwa seorang laki-laki dari kaum Fir'aun, yang bersimpati kepada Musa, ikut menghadiri musyawarah yang diadakan Fir'aun bersama pembesar-pembesarnya. Dalam musyawarah diputuskan bahwa Musa harus dibunuh. Orang laki-laki yang ikut musyawarah tersebut datang menjumpai Musa untuk memberitahukan kepadanya rencana jahat itu, karena ia sangat bersimpati dan hormat kepadanya. Ia minta supaya Musa segera meninggalkan Mesir. Kalau tidak, mungkin ia akan tertangkap dan dibunuh karena mereka sedang menyiapkan tentara rahasia untuk mengepung dan menangkapnya. Ia menyatakan kepada Musa semua yang dibicarakannya itu adalah benar dan ia menasihati Musa agar lari dengan segera. Nasihat itu benar-benar timbul dari hatinya yang ikhlas demi keselamatan Musa sendiri.",
          "21": "Mendengar nasihat yang dikemukakan oleh orang itu dan melihat sikapnya yang menampakkan kejujuran dan keikhlasan, dengan segera Musa berangkat dalam keadaan selalu waspada, karena di belakangnya beberapa orang tentara Fir‘aun telah siap-siap untuk mengepung dan menangkapnya. Alangkah beratnya tekanan yang diderita Musa. Walaupun demikian, ia tetap berusaha menyelamatkan dirinya dan berdoa kepada Allah, “Hai Tuhanku Yang Mahakuasa, Yang Maha Pengasih lagi Maha Penyayang, bebaskanlah aku dari cengkeraman kaum Fir‘aun yang aniaya. Allah mengabulkan doanya dan menunjukkannya jalan menuju Madyan.\n\nMenurut riwayat, Fir‘aun memerintahkan kepada tentaranya supaya mengejar Musa sampai ke jalan-jalan kecil dan melarang mereka melalui jalan raya karena ia yakin bahwa Musa tidak mungkin akan menempuh jalan itu.",
          "22": "Setelah Musa mengetahui bahwa jalan yang ditempuhnya itu adalah jalan yang biasa dilalui orang menuju ke Madyan, ia yakin bahwa ia tidak akan tersesat menempuh padang pasir yang luas itu. Apalagi ia telah berdoa kepada Tuhannya agar selalu ditunjuki ke jalan yang lurus. Akan tetapi, walaupun jalan yang ditempuhnya itu adalah jalan raya yang biasa dilalui orang, namun jarak yang harus ditempuhnya sangat jauh sekali, sedangkan dia tidak membawa bekal karena ia tergesa-gesa meninggalkan kota Mesir.\n\nDiriwayatkan bahwa Musa berjalan selama delapan hari delapan malam, tanpa makanan dan dengan kaki telanjang. Tak ada yang bisa dimakan kecuali daun-daun kayu. Namun demikian, hatinya tetap tabah dan semangatnya tetap membaja karena ia luput dari kejaran Fir'aun. Dia telah selamat dari jebakan Fir'aun di waktu kecilnya, padahal banyak bayi laki-laki dari Bani Israil mati dibunuh, dan sekarang ia telah bebas dari kejaran Fir'aun di waktu ia sudah dewasa. Semua itu adalah karena rahmat dan lindungan Allah. Oleh karena itu, ia yakin dalam perjalanan yang jauh dan sulit itu, ia akan tetap berada dalam lindungan-Nya.",
          "23": "Pada ayat ini dijelaskan bahwa pada akhirnya sampailah Musa ke sebuah sumber mata air di kota Madyan. Dilihatnya di sana orang-orang sedang ramai berdesak-desakan mengambil air dan memberi minum binatang ternak mereka. Di tempat yang agak rendah, tampak olehnya dua orang gadis memegang dan menahan tali kambingnya yang selalu hendak maju ke arah orang-orang yang mengambil air karena sudah sangat haus. Melihat hal itu, timbullah rasa kasihan dalam hati Musa, lalu ia dekati kedua gadis itu hendak menanyakan mengapa tidak ikut bersama orang banyak mengambil air dan memberi minum kambing mereka. Keduanya menjawab, \"Kami tidak dapat mengambil air kecuali orang-orang itu semuanya telah selesai mengambilnya, karena kami tidak kuat berebut dan berdesak-desakan dengan orang banyak. Bapak kami sudah sangat tua, sehingga tidak sanggup datang ke mari untuk mengambil air. Itulah sebabnya kami terpaksa menunggu orang-orang itu pergi dan kami hanya dapat mengambil air, jika ada sisa-sisa air yang ditinggalkan mereka.\"",
          "24": "Dengan cepat Musa mengambil air untuk kedua gadis itu agar memberi minum kambing mereka. Karena kelelahan, ia berlindung di bawah sebatang pohon sambil merasakan lapar dan haus karena sudah beberapa hari tidak makan kecuali daun-daunan. Musa berdoa kepada Allah karena ia sangat membutuhkan rahmat dan kasih sayang-Nya, untuk melenyapkan penderitaan yang dialaminya.",
          "25": "Pada ayat ini dijelaskan bagaimana akhir penderitaan yang dialami Musa dengan dikabulkan doanya oleh Allah. Tak disangka-sangka, datanglah salah seorang dari kedua gadis itu dengan agak malu-malu dan berkata kepada Musa bahwa ayahnya mengundang Musa datang ke rumahnya untuk sekadar membalas budi baik Musa yang telah menolong mereka mengambil air minum dan memberi minum binatang ternak mereka. Musa dapat memahami bahwa kedua gadis itu berasal dari keluarga orang baik-baik, karena melihat sikapnya yang sopan dan di waktu datang kepadanya dan mendengar bahwa yang mengundang datang ke rumahnya itu bukan dia sendiri melainkan ayahnya. Kalau gadis itu sendiri yang mengundang, mungkin timbul kesan yang tidak baik terhadapnya.\n\nPara mufasir berbeda pendapat tentang ayah gadis itu apakah dia Nabi Syuaib atau bukan. Sebagian ulama berpendapat bahwa ayah kedua gadis itu adalah seorang pemuka agama yang saleh dan telah berusia lanjut. Adapun pendapat yang mengatakan bahwa ayah wanita itu adalah Nabi Syuaib tidak bisa diterima karena Nabi Syuaib hidup jauh sebelum Nabi Musa. \n\nAkhirnya berangkatlah Musa bersama gadis itu ke rumah orang tua mereka. Setelah sampai, Musa menceritakan kepada orang tua gadis itu riwayat hidupnya bersama Fir'aun, bagaimana kesombongan dan penghinaannya terhadap Bani Israil, sampai kepada keputusan dan perintah untuk membunuhnya, sehingga ia lari dari Mesir karena takut dibunuh. Orang tua itu mendengarkan cerita Musa dengan penuh perhatian. Setelah Musa selesai bercerita, orang tua itu berkata kepadanya, \"Engkau tidak perlu merasa takut dan khawatir karena engkau telah lepas dari kekuasaan orang-orang zalim itu. Mereka tidak akan dapat menangkapmu, karena engkau telah berada di luar batas kerajaan mereka.\" Dengan demikian, hati Musa merasa tenteram karena ia sudah mendapat perlindungan di rumah seorang pemuka agama yang besar pengaruhnya di kawasan tersebut.",
          "26": "Rupanya orang tua itu tidak mempunyai anak laki-laki dan tidak pula mempunyai pembantu. Oleh sebab itu, yang mengurus semua urusan keluarga itu hanyalah kedua putrinya saja, sampai keduanya terpaksa menggembala kambing mereka, di samping mengurus rumah tangga. Terpikir oleh salah seorang putri itu untuk meminta tolong kepada Musa yang tampaknya amat baik sikap dan budi pekertinya dan kuat tenaganya menjadi pembantu di rumah ini. \n\nPutri itu mengusulkan kepada bapaknya agar mengangkat Musa sebagai pembantu mereka untuk menggembala kambing, mengambil air, dan sebagainya karena dia seorang yang jujur, dapat dipercaya, dan kuat tenaganya. Usul itu berkenan di hati bapaknya, bahkan bukan hanya ingin mengangkatnya sebagai pembantu, malah ia hendak mengawinkan salah satu putrinya dengan Musa.",
          "27": "Dengan segera orang tua itu mengajak Musa berbincang. Dengan terus terang dia mengatakan keinginannya untuk mengawinkan Musa dengan salah seorang putrinya. Sebagai mahar perkawinan ini, Musa harus bekerja menggembalakan kambing selama delapan tahun, kalau Musa menyanggupi bekerja sepuluh tahun maka itu lebih baik. Ini adalah tawaran yang amat simpatik dan amat melegakan hati Musa, sebagai seorang pelarian yang ingin menghindarkan diri dari maut, seorang yang belum yakin akan masa depannya, apakah ia akan terlunta-lunta di negeri orang, karena tidak tentu arah yang akan ditujunya. Apalagi yang lebih berharga dan lebih membahagiakan dari tawaran itu? Tanpa ragu-ragu Musa telah menetapkan dalam hatinya untuk menerima tawaran tersebut.\n\nPara ulama mengambil dalil dengan ayat ini bahwa seorang bapak boleh meminta seorang laki-laki untuk menjadi suami putrinya. Hal ini banyak terjadi di masa Rasulullah saw, bahkan ada di antara wanita yang menawarkan dirinya supaya dikawini oleh Rasulullah saw atau supaya beliau mengawinkan mereka dengan siapa yang diinginkannya.\n\nUmar pernah menawarkan anaknya Hafsah (yang sudah janda) kepada Abu Bakar tetapi Abu Bakar hanya diam. Kemudian ditawarkan kepada 'Utsman, tetapi 'Utsman meminta maaf karena keberatan. Hal ini diberitahukan Abu Bakar kepada Nabi. Beliau pun menenteramkan hatinya dengan mengatakan, \"Semoga Allah akan memberikan kepada Hafsah orang yang lebih baik dari Abu Bakar dan 'Utsman.\" Kemudian Hafsah dikawini oleh Rasulullah.",
          "28": "Musa menerima tawaran itu dan berjanji kepada orang tua kedua gadis itu bahwa dia akan memenuhi syarat-syarat yang disepakati dan akan memenuhi salah satu dari dua masa yang ditawarkan, yaitu delapan atau sepuluh tahun. Sesudah itu tidak ada kewajiban lagi yang harus dibebankan kepadanya. Musa juga menyatakan bahwa Allah yang menjadi saksi atas kebenaran apa yang telah diikrarkan bersama.",
          "29": "Ayat ini menerangkan bahwa setelah Musa menunaikan tugasnya selama sepuluh tahun dengan sebaik-baiknya, dia pun pamit kepada mertuanya untuk kembali ke Mesir, yang merupakan kampung halamannya, bersama istrinya. Tentu saja tidak ada alasan bagi mertuanya untuk menahannya karena semua ketentuan yang telah ditetapkan untuk mengawini anaknya sudah dipenuhi Musa. Hanya saja sebagai orang tua, ia tidak akan sampai hati melepaskan anak menantunya begitu saja, tanpa memberikan sekadar bekal di jalan. Mertuanya membekali secukupnya dan memberikan kepadanya beberapa ekor kambing. \n\nMusa lalu berangkat bersama istrinya menempuh jalan yang pernah ditempuhnya dahulu sewaktu dia lari dari Mesir. Di tengah jalan, dia berhenti di suatu tempat untuk melepaskan lelah. Karena malam telah tiba dan keadaan gelap gulita, maka ia mencoba menyalakan api dengan batu. Akan tetapi, rabuknya tidak mau menyala sehingga ia hampir putus asa karena ia tidak dapat mengerjakan sesuatu dalam gelap gulita itu. Udara pun sangat dingin sehingga dia dan keluarganya tidak akan dapat bertahan lama, tanpa ada api untuk berdiang. \n\nDalam keadaan demikian, dari jauh dia melihat nyala api di sebelah kanan Gunung Tur. Dia lalu berkata kepada istrinya untuk menunggu di tempatnya karena ia akan pergi ke tempat api itu. Semoga orang-orang di sana dapat memberikan petunjuk kepadanya tentang perjalanan ini atau ia dapat membawa sepotong kayu penyuluh supaya mereka dapat menghangatkan badan dari udara dingin yang tak tertahankan.",
          "30": "Musa berjalan ke arah api yang dilihatnya itu. Tatkala dia sudah berada di dekat api itu, ia diseru oleh suatu suara di lembah sebelah kanannya. Ia mendengar seruan yang menyatakan kepadanya bahwasanya itu adalah seruan Allah, Tuhan sekalian alam. Musa mendengar seruan Tuhannya di malam yang sunyi senyap, di lembah dalam keadaan sendiri, dan tak seorang pun yang menemaninya. Bagaimana Musa dapat mendengar Kalam Ilahi langsung dari Tuhannya? Karena hal itu adalah suatu hal yang gaib, tidak ada yang mengetahuinya kecuali Allah. Dia telah mengilhamkan kepada Musa keyakinan bahwa yang berbicara dengannya adalah Tuhan sekalian alam. Lembah di mana Musa berdiri dijadikan tempat yang penuh berkah karena di sanalah Musa mendengar firman Tuhannya dan diangkat menjadi rasul.",
          "31": "Kemudian Allah memerintahkan kepada Musa supaya melemparkan tongkatnya. Musa dengan patuh melemparkan tongkatnya, tetapi tongkat itu berubah menjadi ular besar yang bergerak dengan cepat dan gesit. Musa sangat terkejut dan merasa ngeri serta takut melihat ular itu. Dengan serta merta, ia lari tanpa menoleh ke belakang. Tidak ada yang dipikirkannya kecuali menyelamatkan diri dari gigitan ular yang dahsyat itu.\n\nDi waktu itu Tuhan berseru lagi agar Musa kembali ke tempat semula dan jangan takut kepada ular itu. Ular itu hanyalah tongkatnya yang berubah menjadi ular dan tidak akan mengganggunya. Tidak ada sesuatu pun yang dapat mengganggu ketenteramannya. Ini adalah mukjizat yang Allah berikan kepada Musa untuk menghadapi Fir'aun yang sombong dan takabur. Hati Musa merasa aman dan tenteram setelah mendengar bahwa keamanannya dijamin oleh Allah.",
          "32": "Kemudian Allah memerintahkan Musa supaya memasukkan tangannya ke baju. Perintah ini pun dilaksanakan Musa dengan taat dan patuh. Ketika ia mengeluarkan tangannya dari leher bajunya, ia melihat tangannya berubah menjadi putih bercahaya dan bersinar bukan karena sakit sopak atau yang lainnya. Musa kaget, terkejut, dan merasa takut. Akan tetapi, segera sesudah itu turun pula perintah Tuhan untuk menghilangkan rasa terkejut dan takut yang telah menguasai dirinya supaya dia mendekapkan kedua tangannya ke dada.\n\nKemudian Allah menegaskan kepada Musa bahwa dua mukjizat yang diberikan kepadanya adalah untuk menunjukkan kekuasaan-Nya. Musa diperintahkan untuk memperlihatkan kedua mukjizat itu kepada Fir'aun yang sombong dan fasik ketika Musa menyerunya agar dia beriman kepada Allah dan meninggalkan kesesatan yang dianutnya. Ketika itu, Musa mengerti bahwa di atas pundaknya telah dibebankan risalah yang harus disampaikan kepada Fir'aun dan kaumnya, serta kepada Bani Israil sendiri. Ini berarti bahwa dia telah menjadi rasul. Dengan demikian, apa yang dijanjikan Allah kepada ibu Musa bahwa putranya akan dikembalikan ke haribaannya telah terlaksana di waktu Musa masih kecil. Sekarang terlaksana pula janji Allah yang kedua bahwa Dia mengangkat Musa menjadi rasul. \n\nSebelum ini, yang mendorong Musa meninggalkan Madyan menuju Mesir adalah perasaan rindu kepada kampung halaman dan sanak keluarganya. Ia berani melakukan hal itu karena dia berharap orang Mesir telah lupa akan peristiwa pembunuhan yang dilakukannya di masa lampau sehingga ia dapat memasuki Mesir secara diam-diam. Akan tetapi, ia sekarang harus kembali ke sana secara terang-terangan dan menentang kekuasaan Fir'aun yang perkasa. Dengan begitu, Fir'aun dan kaumnya pasti akan membunuhnya. Dia mulai merasa khawatir terhadap dirinya kalau dia pergi sendirian. Hal yang lebih dikhawatirkannya adalah kalau ia terbunuh oleh Fir'aun, tentu risalah Tuhannya tidak akan sampai kepada kaumnya (Bani Israil).",
          "33": "Musa mengadukan kepada Tuhannya bahwa dulu dia pernah membunuh seorang anak muda. Hal itu telah tersiar luas di kalangan orang Mesir, dan Fir'aun telah menetapkan untuk membunuhnya. Hal itu sangat mengkhawatirkan Musa, siapa tahu setibanya di sana, Fir'aun dan kaumnya telah bersiap-siap untuk membunuhnya. Dengan demikian risalah yang telah dibebankan kepadanya menjadi terlantar. \n\nMusa juga mengadukan bahwa ia mempunyai seorang saudara bernama Harun yang lebih fasih perkataannya daripadanya, lebih pandai berdebat dan memberikan keterangan. Dengan kefasihannya, Harun akan dapat membelanya, bila Fir'aun dan kaumnya membuat tuduhan-tuduhan yang mungkin memberatkannya.",
          "34": "Musa mengadukan kepada Tuhannya bahwa dulu dia pernah membunuh seorang anak muda. Hal itu telah tersiar luas di kalangan orang Mesir, dan Fir'aun telah menetapkan untuk membunuhnya. Hal itu sangat mengkhawatirkan Musa, siapa tahu setibanya di sana, Fir'aun dan kaumnya telah bersiap-siap untuk membunuhnya. Dengan demikian risalah yang telah dibebankan kepadanya menjadi terlantar. \n\nMusa juga mengadukan bahwa ia mempunyai seorang saudara bernama Harun yang lebih fasih perkataannya daripadanya, lebih pandai berdebat dan memberikan keterangan. Dengan kefasihannya, Harun akan dapat membelanya, bila Fir'aun dan kaumnya membuat tuduhan-tuduhan yang mungkin memberatkannya.",
          "35": "Allah mengabulkan permintaan Musa dan berjanji mengangkat Harun menjadi rasul dan pendampingnya (wazir). Allah juga menenteramkan hatinya yang selalu diliputi kekhawatiran karena beratnya beban yang dipikulkan kepadanya. Allah menjanjikan bahwa Dia akan memberikan kepada Musa dan saudaranya kekuatan yang tak dapat dikalahkan oleh kekuatan apa pun di dunia apalagi kekuatan Fir'aun yang sangat terbatas. \n\nDengan hati yang aman dan tenteram, Musa kembali ke tempat istrinya yang ditinggalkannya. Dia menceritakan kepadanya semua kejadian yang dialaminya, yaitu dia telah diangkat Allah menjadi rasul. Mendengar cerita Musa, hati istrinya menjadi tenteram. Musa lalu berangkat bersama keluarganya menuju Mesir didorong oleh cita-cita yang suci yaitu menyampaikan risalah Allah kepada Fir'aun dan Bani Israil. Di Mesir, Harun telah bersiap-siap untuk memikul risalah itu dan membantu saudaranya.",
          "36": "Musa lalu datang kepada Fir'aun dan kaumnya untuk menyeru mereka kepada agama tauhid dengan memberikan bukti-bukti yang nyata dan keterangan yang kuat dan jelas. Dengan demikian, tidak ada alasan bagi mereka menolak kebenaran yang dikemukakannya. Akan tetapi, serta merta mereka menolak apa yang diucapkan oleh Musa. Ketika mereka telah terpojok dan tidak dapat lagi membantah kebenaran yang dibawanya, mereka lalu menuduh semua itu hanya sihir belaka dan mereka tidak pernah mendengar apa yang diucapkan Musa dari nenek moyang mereka. \n\nDemikianlah sikap orang-orang kafir terhadap rasul-rasul yang menyeru kepada agama yang benar seperti tersebut dalam firman-Nya:\n\nDemikianlah setiap kali seorang rasul yang datang kepada orang-orang yang sebelum mereka, mereka (kaumnya) pasti mengatakan, \"Dia itu pesihir atau orang gila.\" (adz-dzariyat/51: 52).",
          "37": "Tuduhan Fir'aun dan kaumnya bahwa bukti-bukti yang dikemukakan Musa hanya sihir belaka dijawabnya dengan tenang dan tidak keluar dari adab dan sopan santun berdebat, tanpa menuduh lawannya bahwa mereka telah sesat. Musa mengatakan kepada mereka bahwa Tuhannya yang lebih mengetahui siapa sebenarnya yang membawa petunjuk dari Allah dan siapa sebenarnya yang beruntung yang akan mendapat kebahagiaan di akhirat. Di balik itu, dalam hatinya ia yakin sepenuhnya dialah yang benar, dialah orang yang beruntung dan siapa yang menentang kebenaran yang dibawanya pasti akan merugi dan menyesal. Jawaban ini sama dengan jawaban yang diberikan oleh Nabi Muhammad kepada kaum musyrikin yang menentangnya, seperti tersebut dalam firman Allah:\n\nKatakanlah (Muhammad), \"Siapakah yang memberi rezeki kepadamu dari langit dan dari bumi?\" Katakanlah, \"Allah,\" dan sesungguhnya kami atau kamu (orang-orang musyrik), pasti berada dalam kebenaran atau dalam kesesatan yang nyata. (Saba'/34: 24) \n\nWalaupun demikian, Musa tetap menegaskan bahwa orang zalim tidak akan memperoleh kemenangan. Ini adalah sebagai isyarat kepada Fir'aun dan kaumnya bahwa mereka tidak akan menang. Mereka pasti akan kalah dan hancur karena mereka adalah orang-orang yang sombong dan aniaya.",
          "38": "Ayat ini menerangkan bahwa setelah kehabisan alasan dan dalil untuk membantah keterangan Musa dan bukti-bukti yang dikemukakannya, Fir'aun memerintahkan kepada kaumnya supaya jangan percaya kepada berita dusta yang dikemukakan Musa. Selama ini tidak ada seorang pun yang berani mendakwahkan bahwa ada Tuhan selain dia. Semenjak dahulu selama Mesir diperintah oleh Fir'aun, yang silih berganti, tak seorang pun yang mengingkari bahwa Fir'aun adalah tuhan-tuhan yang berkuasa di muka bumi. Mata hati rakyat dikelabui dengan dongeng dan khurafat yang menyatakan bahwa manusia harus tunduk kepada kekuasaan Fir'aun. Dia selalu melakukan tindakan yang kejam dan bengis terhadap orang yang berani mengingkari kekuasaannya sebagai tuhan dengan menyiksa dan memenjarakan bahkan membunuhnya. Hal ini disebutkan dalam firman Allah:\n\nKemudian dia mengumpulkan (pembesar-pembesarnya) lalu berseru (memanggil kaumnya). (Seraya) berkata, \"Akulah tuhanmu yang paling tinggi.\" (an-Nazi'at/79: 23-24)\n\nFirman Allah:\n\nDia (Fir'aun) berkata, \"Sungguh, jika engkau menyembah Tuhan selain aku, pasti aku masukkan engkau ke dalam penjara.\" (asy-Syu'ara'/26: 29)\n\nImam Fakhruddin ar-Razi berpendapat bahwa Fir'aun mendakwakan dirinya sebagai tuhan maksudnya bukan dia yang menciptakan langit, bumi, lautan, gunung-gunung, dan manusia seluruhnya karena hal itu tidak akan dapat diterima oleh akal. Maksudnya adalah supaya orang memperhambakan diri kepadanya. Dia hanya menolak adanya tuhan yang harus dipatuhi dan di sembah selain dia.\n\nLalu Fir'aun memerintahkan kepada wazirnya, Haman, supaya menyalakan api yang besar untuk membuat batu bata yang banyak dan mendirikan bangunan yang tinggi supaya dia dapat naik ke langit melihat Tuhan yang didakwahkan Musa. Fir'aun lalu menegaskan bahwa Musa adalah pembohong besar. Senada dengan ini, Allah berfirman:\n\nDan Fir'aun berkata, \"Wahai Haman! Buatkanlah untukku sebuah bangunan yang tinggi agar aku sampai ke pintu-pintu, (yaitu) pintu-pintu langit, agar aku dapat melihat Tuhannya Musa, tetapi aku tetap memandangnya seorang pendusta.\" Dan demikianlah dijadikan terasa indah bagi Fir'aun perbuatan buruknya itu, dan dia tertutup dari jalan (yang benar); dan tipu daya Fir'aun itu tidak lain hanyalah membawa kerugian. (al-Mu'min/40: 36-37)",
          "39": "Pada ayat ini, Allah menegaskan bahwa Fir'aun dan tentaranya sangat sombong dan takabur. Fir'aun menganggap dan mengaku hanya dialah penguasa yang mutlak di muka bumi. Siapa saja yang menantangnya dianggap salah dan durhaka. Kalau dikatakan kepadanya ada Tuhan yang lebih besar daripada kekuasaannya, Fir'aun menjadi kalap, dan tak dapat lagi menguasai dirinya, seperti memerintahkan dengan segera membuat suatu hal yang mustahil, seperti membuat bangunan setinggi langit agar dia dapat berhadapan dengan Tuhan Yang Mahakuasa lagi Mahaperkasa.\n\nFir'aun dan kaumnya mengira bahwa mereka tidak akan dibangkitkan, tidak akan diperhitungkan apa yang telah dikerjakan selama hidup di dunia, dan tidak ada yang akan menyiksa bila mereka melakukan kezaliman dan kekejaman. Memang demikianlah kepercayaan mereka karena pengaruh kesombongan dan ketakaburan itu. Mereka membuat piramida yang besar untuk kuburan mereka yang diisi dengan perabot yang lengkap dan serba mewah serta pakaian dan perhiasan yang indah-indah, untuk dinikmati sesudah mati.\n\nKarena kesombongan dan ketakaburan itu, Allah mengazab mereka di dunia dan akhirat. Di dunia Fir'aun ditenggelamkan bersama tentaranya ke dalam lautan, dan di akhirat mereka akan disiksa dalam neraka.\n\nDemikianlah nasib yang telah ditetapkan Allah bagi orang yang takabur dan sombong, berbuat zalim dan aniaya terhadap Allah dan sesamanya. Sebenarnya kelanjutan kisah Fir'aun bisa ditemukan pada surah-surah lain dalam Al-Qur'an seperti Surah al-A'raf, Yunus, thaha, dan sebagainya. Akan tetapi, Allah hendak menegaskan di sini bagaimana nasib orang-orang yang durhaka yang tidak lagi mempergunakan akal dan pikirannya sehingga tertutuplah hatinya untuk menerima kebenaran dari mana pun datangnya, sehingga dia menjadi sombong dan takabur. Hal itu layak menjadi perhatian dan pelajaran bagi seluruh manusia.",
          "40": "Pada ayat ini, Allah menegaskan bahwa Fir'aun dan tentaranya sangat sombong dan takabur. Fir'aun menganggap dan mengaku hanya dialah penguasa yang mutlak di muka bumi. Siapa saja yang menantangnya dianggap salah dan durhaka. Kalau dikatakan kepadanya ada Tuhan yang lebih besar daripada kekuasaannya, Fir'aun menjadi kalap, dan tak dapat lagi menguasai dirinya, seperti memerintahkan dengan segera membuat suatu hal yang mustahil, seperti membuat bangunan setinggi langit agar dia dapat berhadapan dengan Tuhan Yang Mahakuasa lagi Mahaperkasa.\n\nFir'aun dan kaumnya mengira bahwa mereka tidak akan dibangkitkan, tidak akan diperhitungkan apa yang telah dikerjakan selama hidup di dunia, dan tidak ada yang akan menyiksa bila mereka melakukan kezaliman dan kekejaman. Memang demikianlah kepercayaan mereka karena pengaruh kesombongan dan ketakaburan itu. Mereka membuat piramida yang besar untuk kuburan mereka yang diisi dengan perabot yang lengkap dan serba mewah serta pakaian dan perhiasan yang indah-indah, untuk dinikmati sesudah mati.\n\nKarena kesombongan dan ketakaburan itu, Allah mengazab mereka di dunia dan akhirat. Di dunia Fir'aun ditenggelamkan bersama tentaranya ke dalam lautan, dan di akhirat mereka akan disiksa dalam neraka.\n\nDemikianlah nasib yang telah ditetapkan Allah bagi orang yang takabur dan sombong, berbuat zalim dan aniaya terhadap Allah dan sesamanya. Sebenarnya kelanjutan kisah Fir'aun bisa ditemukan pada surah-surah lain dalam Al-Qur'an seperti Surah al-A'raf, Yunus, thaha, dan sebagainya. Akan tetapi, Allah hendak menegaskan di sini bagaimana nasib orang-orang yang durhaka yang tidak lagi mempergunakan akal dan pikirannya sehingga tertutuplah hatinya untuk menerima kebenaran dari mana pun datangnya, sehingga dia menjadi sombong dan takabur. Hal itu layak menjadi perhatian dan pelajaran bagi seluruh manusia.",
          "41": "Ayat ini memberi julukan kepada Fir'aun dan kaumnya yang durhaka bahwa mereka adalah pemimpin-pemimpin yang membawa manusia ke neraka karena mereka telah menyesatkan manusia dan memaksa setiap orang untuk kafir terhadap Tuhannya. Mereka merasa bebas melakukan kezaliman sekehendak hatinya, tanpa ada rasa keadilan dan rasa kasih sayang.\n\nSebenarnya mereka ini telah melakukan dua kesalahan, kesalahan bagi diri mereka sendiri dan kesalahan menyesatkan orang lain. Maka pantaslah bila mereka menerima siksaan yang berlipat ganda, siksaan terhadap kesesatan sendiri dan siksaan karena menyesatkan orang lain. Oleh karena itu, tidak akan ada penolong bagi mereka di akhirat nanti dan tidak ada yang akan membebaskan dari siksa Allah.",
          "42": "Ayat ini memberi julukan kepada Fir'aun dan kaumnya yang durhaka bahwa mereka adalah pemimpin-pemimpin yang membawa manusia ke neraka karena mereka telah menyesatkan manusia dan memaksa setiap orang untuk kafir terhadap Tuhannya. Mereka merasa bebas melakukan kezaliman sekehendak hatinya, tanpa ada rasa keadilan dan rasa kasih sayang.\n\nSebenarnya mereka ini telah melakukan dua kesalahan, kesalahan bagi diri mereka sendiri dan kesalahan menyesatkan orang lain. Maka pantaslah bila mereka menerima siksaan yang berlipat ganda, siksaan terhadap kesesatan sendiri dan siksaan karena menyesatkan orang lain. Oleh karena itu, tidak akan ada penolong bagi mereka di akhirat nanti dan tidak ada yang akan membebaskan dari siksa Allah.",
          "43": "Ayat ini menerangkan bahwa Allah telah menurunkan kepada Musa kitab Taurat sebagai rahmat baginya dan bagi kaumnya, yang telah lama tertindas dan teraniaya di bawah kekuasaan Fir'aun. Di dalamnya terdapat hikmah dan hukum yang membimbing manusia menuju kebahagiaan dunia dan akhirat. Di sini tampak perbedaan yang besar dan nyata dalam perlakuan Allah terhadap pemimpin-pemimpin dan kaum yang durhaka, sombong dan takabur dengan perlakuannya terhadap pemimpin yang saleh dan ikhlas serta taat kepada-Nya.\n\nKepada golongan pertama, seperti Fir'aun dan kaumnya, diturunkan malapetaka dan siksaan sehingga dia ditenggelamkan bersama tentaranya ke dalam laut. Kepada golongan kedua, seperti Musa, Harun, dan kaumnya, diturunkan Kitab yang akan menjadi petunjuk bagi mereka dalam menempuh kehidupan, baik di dunia maupun di akhirat. Demikianlah sunatullah yang berlaku semenjak dahulu kala. Berapa banyaknya umat-umat yang terdahulu yang telah dibinasakan-Nya dengan berbagai macam cara seperti yang terjadi pada kaum Nabi Nuh, Nabi Saleh, Nabi Hud, dan lain-lain.\n\nDari Abu Sa'id al-Khudri bersumber dari Nabi saw, beliau bersabda, \"Setelah diturunkannya kitab Taurat di atas bumi Allah tidak lagi membinasakan suatu kaum dengan azab dari langit atau bumi kecuali penduduk negeri yang diubah menjadi kera, mereka adalah orang Bani Israil sepeninggal Nabi Musa, lalu Nabi saw membaca ayat ini (al-Qasas/28: 43). (Riwayat al-hakim)",
          "44": "Ayat ini menerangkan bahwa Muhammad saw tidak pernah berada di sisi sebelah barat Lembah Suci thuwa, tempat Allah mewahyukan lembaran-lembaran Taurat kepada Musa. Ketika itu, Allah membebankan urusan-urusan kenabian kepadanya. Karena tidak termasuk salah seorang dari rombongan 70 orang yang telah terpilih untuk mendengarkan secara terperinci hal-hal yang diwahyukan Allah kepada Musa, maka Muhammad saw tidak mungkin menerangkan semua itu, kecuali dengan jalan wahyu dari Allah. Muhammad saw dapat menyampaikan hal-hal gaib yang telah lama terjadi serta tidak disaksikan dan dilihatnya sama sekali, padahal ia adalah seorang 'ummi tidak dapat membaca dan menulis, berada di tengah-tengah kaum yang 'ummi pula, dan tidak mengetahui sedikit pun tentang hal-hal tersebut. Hal itu merupakan bukti nyata bahwa Muhammad benar-benar nabi dan rasul Allah. Semua itu disampaikan dan dikisahkannya melalui perantaraan wahyu dari Allah. Firman Allah:\n\nDan mereka berkata, \"Mengapa dia tidak membawa tanda (bukti) kepada kami dari Tuhannya?\" Bukankah telah datang kepada mereka bukti (yang nyata) sebagaimana yang tersebut di dalam kitab-kitab yang dahulu? (thaha/20: 133)",
          "45": "Ayat ini menerangkan bahwa Allah telah menciptakan generasi demi generasi sejak Nabi Musa sampai kepada Nabi Muhammad dalam waktu yang panjang dan merupakan masa kekosongan, sehingga pengetahuan mereka berkurang, akhlak mereka menurun dan telah menjurus kepada kehancuran dan dekadensi moral. Pada waktu itu terasa benar perlunya diutus seorang rasul untuk membimbing dan memberi petunjuk kepada mereka ke jalan yang benar. Maka diutuslah Nabi Muhammad saw dan dia diberitahu oleh Allah keadaan dan ihwal nabi-nabi terdahulu, begitu juga keadaan dan hal ikhwal Nabi Musa. Allah juga menerangkan pada ayat ini bahwa Muhammad tidak tinggal bersama-sama penduduk Madyan untuk menanyakan dan mempelajari kisah Nabi Musa dari orang-orang yang menyaksikan kisah itu sendiri. Semua itu diketahui oleh Nabi Muhammad dengan perantaraan wahyu yang diturunkan kepadanya.",
          "46": "Ayat ini menerangkan bahwa Nabi Muhammad tidak berada di dekat Gunung Tur pada waktu Allah menyeru Nabi Musa dan ketika terjadi munajat antara keduanya. Peristiwa itu diketahui oleh Muhammad dengan perantaraan kitab suci Al-Qur'an yang diwahyukan kepadanya sebagai rahmat Allah yang di dalamnya dibentangkan kisah tersebut. Juga terdapat hal-hal yang mendatangkan maslahat dan kebahagiaan bagi mereka di dunia dan di akhirat, agar Muhammad memberi peringatan kepada kaum Quraisy yang belum pernah memperoleh peringatan sebelumnya. Selain ayat ini sebagai dalil yang jelas atas kerasulan Muhammad saw, juga sebagai dalil atas kemukjizatan Al-Qur'an, karena ia menceritakan peristiwa yang telah terjadi beratus-ratus tahun. Padahal Rasulullah tidak menyaksikan peristiwa tersebut apalagi hadir di tengah-tengah mereka.",
          "47": "Ayat ini menerangkan bahwa salah satu hikmah pengutusan Muhammad kepada mereka adalah untuk menolak alasan-alasan mereka, ketika kelak mendapat azab yang pedih atas kekafiran mereka terhadap Allah dan dosa-dosa yang telah diperbuatnya. Seandainya Muhammad belum diutus sedangkan azab menimpa mereka, tentu mereka akan mengemukakan alasan dan hujah. Mereka akan berkata, \"Wahai Tuhan kami! Kenapa tidak diutus seorang rasul kepada kami sebelum kemurkaan-Mu menimpa kami, dan azab-Mu diturunkan kepada kami, agar kami dapat mengikuti petunjuk-petunjuk-Mu, mengamalkan ayat-ayat yang ada di dalam kitab-Mu yang diturunkan kepada rasul itu, sehingga kami percaya atas ketuhanan-Mu dan membenarkan rasul yang Engkau utus itu?\"\n\nOleh sebab itu, jauh sebelum mereka dimurkai dan diazab oleh Allah, Muhammad telah diutus kepada mereka untuk memberi peringatan dan ancaman dengan kemurkaan dan azab yang akan ditimpakan kalau mereka tetap dalam agama nenek moyang mereka, menyembah berhala, mempersekutukan Allah. Dengan demikian, tidak ada jalan bagi mereka untuk mengemukakan alasan-alasan dan hujah. Itulah sunatullah yang berlaku pada tiap-tiap umat. Hal ini ditegaskan dalam ayat lain dalam Al-Qur'an seperti firman Allah:\n\nRasul-rasul itu adalah sebagai pembawa berita gembira dan pemberi peringatan, agar tidak ada alasan bagi manusia untuk membantah Allah setelah rasul-rasul itu diutus. Allah Mahaperkasa, Mahabijaksana. (an-Nisa'/4: 165)\n\nDan firman-Nya:\n\nBarang siapa berbuat sesuai dengan petunjuk (Allah), maka sesungguhnya itu untuk (keselamatan) dirinya sendiri; dan barang siapa tersesat maka sesungguhnya (kerugian) itu bagi dirinya sendiri. Dan seorang yang berdosa tidak dapat memikul dosa orang lain, tetapi Kami tidak akan menyiksa sebelum Kami mengutus seorang rasul. (al-Isra'/17: 15)\n\nSalah satu hikmat pengutusan para rasul adalah untuk membendung dan menolak alasan yang akan dikemukakan mereka. Hikmah diturunkannya kitab suci Al-Qur'an juga untuk menolak alasan mereka yang akan mengatakan bahwa mereka tidak beriman karena kitab samawi hanya diturunkan kepada dua golongan saja yaitu Yahudi dan Nasrani, sebagaimana firman Allah swt:\n\n(Kami turunkan Al-Qur'an itu) agar kamu (tidak) mengatakan, \"Kitab itu hanya diturunkan kepada dua golongan sebelum kami (Yahudi dan Nasrani) dan sungguh, kami tidak memperhatikan apa yang mereka baca.\" (al-An'am/6: 156)",
          "48": "Ayat ini menerangkan bahwa ketika Muhammad diutus kepada kaum Quraisy yang belum pernah didatangi oleh seorang rasul yang dibekali kitab suci Al-Qur'an, mereka menyombongkan diri, menentang, dan memperlihatkan kesesatan. Mereka berkata, \"Mengapa ia tidak memiliki mukjizat sebagaimana halnya Nabi Musa yang diberi mukjizat, seperti tongkat menjadi ular, lautan terbelah dengan pukulan tongkatnya, tangannya menjadi putih, dinaungi oleh awan, dan lain-lain. Firman Allah:\n\nMaka boleh jadi engkau (Muhammad) hendak meninggalkan sebagian dari apa yang diwahyukan kepadamu dan dadamu sempit karenanya, karena mereka akan mengatakan, \"Mengapa tidak diturunkan kepadanya harta (kekayaan) atau datang bersamanya malaikat?\" Sungguh, engkau hanyalah seorang pemberi peringatan dan Allah pemelihara segala sesuatu. (Hud/11: 12)\n\nUcapan kaum Quraisy itu dijawab bahwa orang-orang yang durhaka dan sombong pada masa Nabi Musa telah ingkar kepada mukjizat yang diberikan kepada Musa dahulu. Bahkan mereka menuduh Musa dan Harun adalah dua ahli sihir yang saling membantu. Apakah orang-orang kafir Mekah akan mengikuti apa yang telah diperbuat kaum Nabi Musa? Apakah mereka akan mengingkari apa yang didatangkan Muhammad, dan mengatakan bahwa Musa dan Muhammad adalah ahli sihir? Apakah mereka juga tidak akan mempercayai risalah dan mukjizat keduanya? \n\nMengenai tuduhan bahwa keduanya adalah ahli sihir pada ayat ini, Said bin Jubair, Mujahid, dan Ibnu Zaid berpendapat bahwa yang dimaksud dengan \"keduanya adalah ahli sihir\" ialah Musa dan Harun. Ini adalah ucapan orang-orang Yahudi pada permulaan kerasulan. Sedangkan Ibnu 'Abbas dan al-hasan al-Basri berpendapat bahwa yang dimaksud dengan keduanya adalah ahli sihir yaitu Musa dan Muhammad saw, dan ini adalah ucapan orang-orang musyrikin bangsa Arab.",
          "49": "Allah menyuruh Muhammad menantang orang-orang kafir Mekah yang mengatakan bahwa Musa dan Muhammad adalah ahli sihir, dan Taurat dan Al-Qur'an adalah sihir belaka, untuk mendatangkan sebuah kitab dari sisi Allah yang lebih memberi petunjuk dan lebih mendatangkan kemaslahatan daripada kedua kitab itu. Nabi menegaskan kepada mereka bahwa dia bersedia meninggalkan Al-Qur'an apabila mereka itu benar dalam pengakuan mereka, dan benar-benar dapat mendatangkan kitab yang dimaksud.",
          "50": "Ayat ini menerangkan bahwa kalau orang-orang musyrik itu tidak dapat memenuhi tantangan Nabi mendatangkan kitab dari sisi Allah yang lebih menjamin kebahagiaan daripada Taurat dan Al-Qur'an, maka itu berarti bahwa pembangkangan mereka sesungguhnya hanyalah dorongan hawa nafsu belaka, dan mengikuti ajakan setan yang tidak beralasan sama sekali. Orang-orang yang hanya mengikuti hawa nafsunya dan menuruti bujukan setan tanpa ada petunjuk dari Allah, adalah orang-orang yang sangat sesat bahkan paling sesat. Oleh sebab itu, Allah melarang mengikuti hawa nafsu karena akan menyesatkan dari jalan yang benar. Orang-orang yang sesat dari jalan Allah akan mendapat azab yang berat, firman Allah:\n\n(Allah berfirman), \"Wahai Daud! Sesungguhnya engkau Kami jadikan khalifah (penguasa) di bumi, maka berilah keputusan (perkara) di antara manusia dengan adil dan janganlah engkau mengikuti hawa nafsu, karena akan menyesatkan engkau dari jalan Allah. Sungguh, orang-orang yang sesat dari jalan Allah akan mendapat azab yang berat, karena mereka melupakan hari perhitungan.\" (shad/38: 26)\n\nPada akhir ayat 50 ini ditegaskan bahwa Allah tidak akan memberi petunjuk kepada orang yang zalim dan selalu meninggalkan perintah Allah, melanggar larangan-Nya, mendustakan rasul-Nya, mengikuti kemauan hawa nafsu, dan lebih mengutamakan ketaatan kepada setan daripada ketaatan kepada Allah. Orang-orang zalim itu akan mendapat azab yang amat pedih di akhirat. Firman Allah:\n\nMaka sungguh, mereka (yang disembah itu) telah mengingkari apa yang kamu katakan, maka kamu tidak akan dapat menolak (azab) dan tidak dapat (pula) menolong (dirimu), dan barang siapa di antara kamu berbuat zalim, niscaya Kami rasakan kepadanya azab yang besar. (al-Furqan/25: 19)\n\nDan firman-Nya:\n\nTetapi golongan-golongan (yang ada) saling berselisih di antara mereka; maka celakalah orang-orang yang zalim karena azab pada hari yang pedih (Kiamat). (az-Zukhruf43: 65)",
          "51": "Ayat ini menerangkan bahwa Allah menurunkan Al-Qur'an secara bertahap, sebagian demi sebagian sesuai dengan kebijaksanaan yang telah digariskan-Nya, agar mudah dibaca, diingat, dipahami, dan bisa memantapkan hati dan menguatkan iman. Ini merupakan jawaban atas permintaan orang-orang kafir yang menghendaki Al-Qur'an itu diturunkan sekaligus. Firman Allah:\n\nDan orang-orang kafir berkata, \"Mengapa Al-Qur'an itu tidak diturunkan kepadanya sekaligus?\" Demikianlah agar Kami memperteguh hatimu (Muhammad) dengannya dan Kami membacakannya secara tartil (berangsur-angsur, perlahan dan benar). (al-Furqan/25: 32)",
          "52": "Ayat ini menerangkan bahwa Ahli Kitab yang percaya kepada Taurat dan Injil, dan bertemu dengan masa kenabian Muhammad saw, juga percaya kepada Al-Qur'an. Mereka menemukan dalam kitab suci mereka berita yang menggembirakan tentang Al-Qur'an dan kecocokan sifat-sifat Al-Qur'an dengan sifat-sifat yang dijelaskan di dalam kitab mereka. Hal ini dijelaskan pula di dalam ayat yang lain: \n\nDan sesungguhnya di antara Ahli Kitab ada yang beriman kepada Allah, dan kepada apa yang diturunkan kepada kamu, dan yang diturunkan kepada mereka, karena mereka berendah hati kepada Allah. (ali 'Imran/3: 199) \n\nDan firman-Nya:\n\nOrang-orang yang telah Kami beri Kitab, mereka membacanya sebagaimana mestinya, mereka itulah yang beriman kepadanya. (al-Baqarah/2: 121)",
          "53": "Ayat ini menerangkan bahwa apabila Al-Qur'an dibacakan kepada mereka, mereka mengakui bahwa Al-Qur'an itu benar-benar dari Allah. Bahkan, mereka telah membenarkannya sebelum diturunkan karena mereka telah menemukan sifat-sifat Muhammad dan sifat-sifat Al-Qur'an dalam kitab suci mereka. Kepercayaan Ahli Kitab kepada Al-Qur'an sudah sejak dulu karena nenek moyang mereka membaca uraian tentang sifat-sifat Al-Qur'an dalam kitab suci mereka. Kebiasaan ini berlaku turun-temurun sampai ke anak cucunya jauh sebelum Al-Qur'an itu diturunkan.",
          "54": "Ayat ini menerangkan bahwa orang-orang yang percaya kepada Al-Qur'an sesudah mereka percaya kepada kitab-kitab suci sebelumnya, akan diberikan pahala dua kali lipat. Pahala atas kepercayaan mereka kepada kitab-kitab suci mereka, dan pahala atas kepercayaan mereka kepada Al-Qur'an. Diperlukan kesabaran dan ketabahan untuk mempertahankan kepercayaan mereka. Fitnah dan cobaan yang harus dihadapi tentu sangat berat, bahkan mereka mendapat perlakuan yang tidak wajar karena mereka mengikuti Muhammad dan menganut agamanya.\n\nAda tiga macam orang yang mendapat pahala dua kali lipat sebagaimana dijelaskan di dalam sabda Nabi Muhammad:\n\nTiga golongan orang yang diberi pahala, masing-masing dua kali lipat. Seorang Ahli Kitab yang percaya kepada nabinya, kemudian ia mendapati masa (Muhammad saw) maka ia beriman pula kepadanya dan mengikutinya serta membenarkannya maka baginya dua pahala. Hamba sahaya yang menunaikan hak Allah 'Azza wa Jalla dan hak tuannya, maka baginya dua pahala. Dan seorang yang mempunyai hamba sahaya perempuan lalu ia memberi makan, dan memberinya pendidikan yang baik, kemudian ia memerdekakannya lalu menikahinya, maka baginya dua pahala.\" (Riwayat al-Bukhari dari Abu Musa al-Asy'ari).\n\nSelain kesabaran dan ketabahan, mereka juga mempunyai beberapa sifat yang menjadikan mereka dekat kepada Allah, antara lain:\n\n1.Mereka menolak kejahatan dengan kebaikan. Apa yang mereka dengar yang menyakitkan hati, berupa cacian dan sebagainya, tidak dibalas tetapi disambut dengan tenang bahkan dimaafkan. \n\n2.Mereka menginfakkan rezeki yang diberikan Allah ke jalan yang benar. Mereka memperoleh rezeki juga dengan halal dan baik. Mereka mengeluarkan zakat, belanja rumah tangga, bederma untuk pembangunan masjid, madrasah, pengajian, pembinaan dan pemeliharaan anak yatim, dan lain sebagainya. Dalam firman-Nya:\n\nDan infakkanlah (hartamu) di jalan Allah. (al-Baqarah/2: 195) \n\nDan firman-Nya:\n\nWahai orang-orang yang beriman! Infakkanlah sebagian dari hasil usahamu yang baik-baik. (al-Baqarah/2: 267)",
          "55": "Ayat ini menerangkan tentang sifat yang ketiga dari orang-orang yang mendekatkan diri kepada Allah yaitu apabila mereka mendengar perkataan yang tidak bermanfaat, baik mengenai urusan dunia maupun akhirat, seperti cacian, cemoohan, dan sebagainya, mereka berpaling dan tidak melayaninya. Apabila mereka diperlakukan kasar atau disakiti dengan kata-kata atau perbuatan, mereka tidak membalasnya dengan tindakan serupa. Akan tetapi, mereka menghadapinya dengan tenang dan berkata, \"Bagi kami amal-amal kami, kamu tidak akan diberi pahala dan tidak pula diganjar karenanya. Bagimu amal-amalmu, kami tidak akan menuntut sedikit pun dari perbuatan itu, dan tidak akan berusaha membalasnya. Kedamaian atasmu, kami tidak ingin berbuat sebagaimana kamu berbuat.\" Firman Allah:\n\nDan orang-orang yang tidak memberikan kesaksian palsu, dan apabila mereka bertemu dengan (orang-orang) yang mengerjakan perbuatan-perbuatan yang tidak berfaedah, mereka berlalu dengan menjaga kehormatan dirinya. (al-Furqan/25: 72) \n\nDiriwayatkan oleh Muhammad bin Ishak bahwa telah berkunjung kepada Rasulullah di Mekah dua puluh orang lebih dari kaum Nasara Habasyah setelah mendengar berita tentang beliau. Mereka menemui Nabi di dalam masjid, kemudian mereka duduk bersama-sama. Di sekeliling Ka'bah pada waktu itu tokoh-tokoh kaum Quraisy sedang duduk berkumpul. Rasulullah kemudian menyeru kaum Nasara Habasyah untuk beriman kepada Allah dan membacakan kepada mereka Al-Qur'an. Setelah mereka mendengar ayat-ayat Al-Qur'an, mereka menangis tersedu-sedu dan dengan spontan beriman kepada Allah serta percaya kepada beliau dan membenarkannya. Mereka mengetahui bahwa sifat-sifat yang mereka saksikan pada diri Rasulullah sama dengan sifat-sifat yang telah diterangkan di dalam kitab suci mereka. \n\nKetika meninggalkan Nabi Muhammad, mereka dicegat oleh Abu Jahal bin Hisyam dan beberapa orang Quraisy dan mereka mengatakan, \"Semoga Allah menggagalkan niatmu, kalian diutus oleh teman-teman kalian hanya untuk mengetahui sifat-sifat pribadi Muhammad lalu memberitahukan kepada mereka. Akan tetapi, kenyataannya kalian sudah terpengaruh lalu meninggalkan agama kalian dan membenarkan apa yang dikatakan Muhammad. Kami tidak melihat ada rombongan yang lebih bodoh dari kalian.\" Mendengar kata-kata pedas dan tajam dari Abu Jahal bin Hisyam, mereka menjawab, \"Selamat tinggal buat kamu, kami tidak akan membalas dan berbuat jahat kepadamu. Bagi kami amal-amal kami, dan bagimu amal-amalmu.\"",
          "56": "Ayat ini menerangkan bahwa Muhammad tidak dapat menjadikan kaumnya untuk taat dan menganut agama yang dibawanya, sekalipun ia berusaha sekuat tenaga. Ia hanya berkewajiban menyampaikan dan hanya Allah yang akan memberi petunjuk kepada orang yang dikehendaki-Nya. Dia yang mempunyai kebijaksanaan yang mendalam dan alasan yang cukup. Hal tersebut ditegaskan pula pada ayat lain di dalam Al-Qur'an.\n\nBukanlah kewajibanmu (Muhammad) menjadikan mereka mendapat petunjuk, tetapi Allah-lah yang memberi petunjuk kepada siapa yang Dia kehendaki. (al-Baqarah/2: 272) \n\nDan firman-Nya:\n\nDan kebanyakan manusia tidak akan beriman walaupun engkau sangat menginginkannya. (Yusuf/12:103)\n\nPada akhir ayat ini, Allah menegaskan bahwa Dia lebih mengetahui siapa orang-orang yang bersedia dan pantas menerima hidayah itu. Di antara mereka ialah orang-orang Ahli Kitab yang pernah dikisahkan peristiwanya pada ayat-ayat yang lalu. Sebaliknya orang-orang yang tidak bersedia menerima hidayah seperti beberapa kerabat Nabi, maka hidayah tidak akan diberikan kepada mereka.",
          "57": "Diriwayatkan oleh Ibnu Jarir dari Ibnu 'Abbas bahwa ayat ini turun berkenaan dengan al-haris bin Utsman bin 'Abd Manaf ketika ia dan beberapa orang Quraisy lainnya mendatangi Nabi saw dan mereka berkata kepada Nabi, \"Kami telah mengetahui bahwa apa yang engkau katakan itu benar. Akan tetapi, yang menghalangi kami mengikuti agamamu ialah orang-orang Arab yang akan memusuhi dan mengusir kami dari negeri kami, dan kami tidak mempunyai kesanggupan sedikit pun untuk melawan mereka.\"\n\nAyat ini menerangkan bahwa sebagian orang musyrik Mekah mengemukakan alasan yang tidak dapat diterima oleh pikiran yang sehat. Mereka berkata, \"Jika kami mengikuti petunjuk yang diberikan Muhammad kepada kami, dan agama yang diturunkan kepadanya, kami khawatir akan diusir dari negeri kami. Orang-orang musyrik serta tokoh-tokoh bangsa Arab juga akan memusuhi kami dengan kekerasan sedang kami tidak mampu melawan mereka.\" Dengan peringatan ini tampak bahwa mereka lebih takut kepada makhluk daripada Tuhan yang menciptakan mereka. Mereka tidak pernah membayangkan azab yang akan ditimpakan kepada mereka. \n\nMereka lupa bahwa mereka berada di daerah Haram yang sangat dihormati sejak dahulu kala, aman dan mendapat aneka macam rezeki dan buah-buahan. Apakah mereka mengira akan tetap aman dan sejahtera di daerah Haram yang aman itu kalau mereka tetap dalam kekafiran dan kemusyrikan. Tidak sedikit di antara mereka yang tidak mengetahui dan menyadari nikmat dan azab Allah yang akan diberikan kepada setiap orang sesuai dengan amal baik dan buruk mereka.\n\nMereka seharusnya mengetahui bahwa rezeki yang berlimpah itu datang dari Allah. Oleh karena itu, Dialah yang patut ditakuti dan ditaati bukan manusia, makhluk yang lemah dan serba kekurangan.",
          "58": "Banyak penduduk negeri yang semula hidup bersenang-senang dengan kekayaan berlimpah ruah, tetapi karena mereka selalu membuat kerusakan dan tidak mensyukuri nikmat Allah, maka Allah menghancurkan negeri mereka dan hanya sedikit saja rumah-rumah mereka yang tersisa. Padahal Allah tidak akan menghancurkan suatu negeri selama penduduk negeri itu berbuat kebaikan, firman Allah:\n\nDan Tuhanmu tidak akan membinasakan negeri-negeri secara zalim, selama penduduknya orang-orang yang berbuat kebaikan. (Hud/11: 117) \n\nSetelah kaum itu hancur, maka tempat tinggal mereka menjadi gersang dan tidak dimakmurkan lagi, hingga negeri itu kembali kepada pemiliknya yang hakiki, yaitu Allah. Firman Allah:\n\nDan Allah telah membuat suatu perumpamaan (dengan) sebuah negeri yang dahulunya aman lagi tenteram, rezeki datang kepadanya melimpah ruah dari segenap tempat, tetapi (penduduk)nya mengingkari nikmat-nikmat Allah, karena itu Allah menimpakan kepada mereka bencana kelaparan dan ketakutan, disebabkan apa yang mereka perbuat. (an-Nahl/16: 112)",
          "59": "Ayat ini menerangkan bahwa sesuai dengan sunah-Nya, Allah tidak pernah membinasakan suatu kota, kecuali terlebih dahulu mengutus seorang rasul ke kota itu untuk membacakan kepada penduduknya ayat-ayat Allah yang berisi kebenaran. Rasul itu ditugaskan untuk menyeru dan memberi peringatan kepada mereka supaya mereka itu beriman kepada Allah, namun mereka tidak mengindahkannya. Firman Allah:\n\nKami tidak akan menyiksa sebelum Kami mengutus seorang rasul. (al-Isra'/17: 15)\n\nSesudah Allah mengutus rasul untuk membimbing penduduk kota itu ke jalan yang lurus, memberi petunjuk kepada kebenaran, tetapi mereka tetap melakukan kezaliman dan mendustakan rasul, mengingkari ayat-ayat-Nya, maka Dia akan membinasakan kota itu beserta penduduknya. \n\nPembinasaan umat secara besar-besaran sebagaimana terjadi pada umat-umat terdahulu tidak terjadi pada umat Nabi Muhammad. Beliau adalah nabi terakhir yang diutus bagi seluruh alam, sehingga pembinasaan total sudah tidak terjadi lagi. Yang ada hanyalah pembinasaan parsial atau lokal seperti bencana penyakit, bencana alam, gempa bumi, gelombang tsunami, dan sebagainya.\n\nPengutusan Muhammad saw sebagai nabi terakhir berarti Allah tidak akan mengutus nabi atau rasul setelah beliau. Sedangkan tugas“tugas dakwah dan tanggung jawab memberi peringatan kepada umat terletak di pundak para ulama.",
          "60": "Ayat ini menerangkan bahwa apa yang diberikan Allah bagi manusia baik berupa harta benda maupun keturunan hanya merupakan kesenangan duniawi. Kehidupan dunia dengan segala perhiasannya belum tentu menjamin keselamatan dan kebahagiaan mereka. Sebaliknya, pahala yang ada di sisi Allah yang diberikan kepada hamba-hamba-Nya yang taat adalah lebih baik, karena yang demikian itu kekal dan abadi. Berbeda dengan kesenangan duniawi yang dipujanya karena waktunya terbatas sekali, dan sesudah itu habis dan punah. Firman Allah:\n\nDan apa yang di sisi Allah lebih baik bagi orang-orang yang berbakti. (ali 'Imran/3: 198) \n\nApa yang ada di sisimu akan lenyap, dan apa yang ada di sisi Allah adalah kekal. (an-Nahl/16: 96) \n\nDan kehidupan dunia ini hanya senda-gurau dan permainan. Dan sesungguhnya negeri akhirat itulah kehidupan yang sebenarnya, sekiranya mereka mengetahui. (al-'Ankabut/29:64)\n\nSedangkan kamu (orang-orang kafir) memilih kehidupan dunia, padahal kehidupan akhirat itu lebih baik dan lebih kekal. (al-A'la/87: 16-17)\n\nAyat ini ditutup dengan pertanyaan yang bernada ejekan sekaligus peringatan dari Allah. Mengapa mereka tidak mau menggunakan akalnya, dan berpikir secara mendalam sehingga mereka mengetahui mana yang baik dan mana yang tidak. Apakah menurut mereka kehidupan dunia dengan segala kenikmatannya yang fana dan bisa dinikmati dalam waktu yang sangat singkat lebih baik daripada kehidupan akhirat yang kekal dan abadi itu.",
          "61": "Ayat ini dimulai dengan pertanyaan untuk meyakinkan agar orang-orang kafir itu dengan penuh kesadaran berpikir dan membandingkan tentang mana yang lebih baik. Apakah orang-orang yang dijanjikan Allah apabila mereka taat dan menuruti perintah dan menjauhi larangan-Nya akan dikaruniai nikmat di akhirat yang tidak pernah dilihat oleh mata, didengar oleh telinga, dan tidak pernah terlintas dalam hati seseorang dan mereka benar-benar memperolehnya di akhirat.\n\nMana yang lebih baik antara orang yang taat menjalankan perintah Allah dan menjauhi larangan dengan orang yang memilih kesenangan duniawi tetapi tidak menaati perintah Allah dan mengerjakan larangan-larangan-Nya. Menurut akal yang sehat, tentu golongan pertama lebih baik dari golongan kedua. Ayat ini menunjukkan bahwa orang kafir diberi kesenangan duniawi, tetapi di akhirat dimasukkan ke dalam neraka. Firman Allah:\n\nSungguh, Jahanam itu seburuk-buruk tempat menetap dan tempat kediaman. (al-Furqan/25: 66)\n\nSedang orang mukmin yang sabar dan tabah menghadapi berbagai cobaan dunia, karena yakin akan janji Allah, di akhirat nanti mereka dimasukkan ke dalam surga. Firman Allah:\n\nPenghuni-penghuni surga pada hari itu paling baik tempat tinggalnya dan paling indah tempat istirahatnya. (al-Furqan/25: 24)\n\nPerumpamaan surga yang dijanjikan kepada orang yang bertakwa (ialah seperti taman), mengalir di bawahnya sungai-sungai; senantiasa berbuah dan teduh. (ar-Ra'd/13: 35)",
          "62": "Pada ayat ini, Allah memerintahkan Nabi saw untuk memperingatkan kaumnya tentang hari ketika Allah memanggil orang-orang yang menyesatkan dan menghalang-halangi manusia dari jalan Allah. Allah akan berkata kepada mereka, \"Mana sekutu-sekutu-Ku? Mana malaikat, jin, dan berhala-berhala yang kamu anggap sekutu-sekutu-Ku di dunia? Dapatkah semuanya itu melepaskan dari azab yang menimpamu?\" Tentu tidak. Hal ini dikemukakan sekedar penghinaan kepada mereka. Sejalan dengan ayat ini Allah berfirman:\n\nDan kamu benar-benar datang sendiri-sendiri kepada Kami sebagaimana Kami ciptakan kamu pada mulanya, dan apa yang telah Kami karuniakan kepadamu, kamu tinggalkan di belakangmu (di dunia). Kami tidak melihat pemberi syafaat (pertolongan) besertamu yang kamu anggap bahwa mereka itu sekutu-sekutu (bagi Allah). Sungguh, telah terputuslah (semua pertalian) antara kamu dan telah lenyap dari kamu apa yang dahulu kamu sangka (sebagai sekutu Allah). (al-An'am/6: 94)",
          "63": "Ayat ini menerangkan jawaban para penyesat dan pengajak kepada kekafiran yang berusaha melepaskan diri dari tanggung jawabnya menyesatkan orang lain. Mereka telah dipastikan mendapat kemurkaan dan yang telah mendapat ancaman dari Allah dengan firman-Nya:\n\nPasti akan Aku penuhi neraka Jahanam dengan jin dan manusia bersama-sama. (as-Sajdah/32: 13)\n\nPara pengajak kepada kekafiran itu akhirnya masuk ke dalam neraka. Mereka berkata, \"Wahai Tuhan kami, mereka itulah yang telah kami sesatkan sebagaimana kami juga sesat. Kami sekadar mengajak mereka lalu mereka mengikuti ajakan kami yang menyesatkan itu dengan kemauan sendiri. Tidak ada paksaan sama sekali dari kami.\" Ketika mereka diajak untuk beriman kepada Allah, mereka tidak menghiraukannya sama sekali padahal ajakan itu adalah ajakan yang sebenarnya. Peristiwa semacam ini sama dengan peristiwa yang akan terjadi di akhirat yaitu dialog antara setan dengan manusia yang telah disesatkannya, sebagaimana firman Allah:\n\nDan setan berkata ketika perkara (hisab) telah diselesaikan, \"Sesungguhnya Allah telah menjanjikan kepadamu janji yang benar, dan aku pun telah menjanjikan kepadamu tetapi aku menyalahinya. Tidak ada kekuasaan bagiku terhadapmu, melainkan (sekadar) aku menyeru kamu lalu kamu mematuhi seruanku, oleh sebab itu janganlah kamu mencerca aku, tetapi cercalah dirimu sendiri. Aku tidak dapat menolongmu, dan kamu pun tidak dapat menolongku. Sesungguhnya aku tidak membenarkan perbuatanmu mempersekutukan aku (dengan Allah) sejak dahulu.\" Sungguh, orang yang zalim akan mendapat siksaan yang pedih. (Ibrahim/14: 22) \n\nPembelaan diri setan dengan mengatakan bahwa orang yang sesat itu mematuhi ajakannya dengan kemauan mereka sendiri, bukan tekanan darinya karena ia tidak punya kekuasaan atas manusia, dikuatkan oleh firman Allah kepada Iblis:\n\nSesungguhnya kamu (Iblis) tidak kuasa atas hamba-hamba-Ku, kecuali mereka yang mengikutimu, yaitu orang yang sesat. (al-hijr/15: 42)\n\nPemimpin-pemimpin yang menyesatkan itu menyatakan tidak bertanggung jawab kepada Allah atas perbuatan pengikut-pengikutnya, dengan alasan bahwa mereka tidak menyembah kepada-Nya tetapi kepada berhala-berhala. Kejadian seperti ini disebutkan dalam ayat yang lain yaitu firman Allah:\n\n(Yaitu) ketika orang-orang yang diikuti berlepas tangan dari orang-orang yang mengikuti, dan mereka melihat azab, dan (ketika) segala hubungan antara mereka terputus. (al-Baqarah/2: 166)",
          "64": "Pada ayat ini diterangkan bahwa mereka yang menyekutukan Allah dengan tuhan-tuhan dan sembahan-sembahan lain di dunia, disuruh memanggil tuhan-tuhan mereka yang dijadikan sekutu Allah untuk menolak azab yang menimpa mereka. Ketika mereka memanggilnya, berhala-berhala itu tentu tidak bisa menjawab karena tidak berdaya sedikit pun. Hal ini dilakukan hanya untuk memperlihatkan kebodohan mereka yang disaksikan oleh segenap penghuni akhirat. Mereka yang memanggil dan yang dipanggil yakin bahwa mereka akan diseret ke neraka karena dosa-dosa mereka, dan mereka sudah tidak dapat mengelak dan lari ke tempat lain, sebagaimana firman Allah:\n\nDan orang yang berdosa melihat neraka, lalu mereka menduga bahwa mereka akan jatuh ke dalamnya, dan mereka tidak menemukan tempat berpaling darinya. (al-Kahf/18: 53)\n\nSetelah menyaksikan azab yang akan menimpa mereka, ketika itu mereka menyesal seandainya dahulu ketika masih hidup di dunia mereka menerima petunjuk dan beriman kepada Allah. Akan tetapi, pengandaian itu hanya merupakan angan-angan yang tidak mungkin terlaksana.",
          "65": "Sesudah dinyatakan kepada mereka bahwa tindakan mereka mempersekutukan Allah adalah sesat, maka sebagai cercaan atas perbuatannya, itu pada ayat ini ditanyakan kepada mereka tentang bagaimana cara mereka menyambut seruan para rasul untuk membersihkan diri dari penyembahan berhala, dan mengajak berakidah tauhid, mengesakan Allah. Mereka diam seribu bahasa, tidak dapat mengemukakan sedikit pun alasan sebagai jawaban dari pernyataan yang dilontarkan. Mereka bingung tidak tahu apa yang mesti dikatakan. Oleh karena itu, mereka saling bertanya, seperti orang yang sedang menghadapi kesulitan. Mereka tertunduk karena malu dan menyesal. Apabila para rasul tidak dapat menjawab pertanyaan yang dimajukan kepadanya tentang jawaban dan sambutan kaumnya mengenai seruannya kepada mereka, tentu orang-orang yang sesat dan menyesatkan di dunia yang tidak mengindahkan seruan nabi-nabi lebih cemas lagi. Firman Allah:\n\n(Ingatlah) pada hari ketika Allah mengumpulkan para rasul, lalu Dia bertanya (kepada mereka), \"Apa jawaban (kaummu) terhadap (seruan)mu?\" Mereka (para rasul) menjawab, \"Kami tidak tahu (tentang itu). Sesungguhnya Engkaulah Yang Maha Mengetahui segala yang gaib.\" (al-Ma'idah/5: 109)",
          "66": "Sesudah dinyatakan kepada mereka bahwa tindakan mereka mempersekutukan Allah adalah sesat, maka sebagai cercaan atas perbuatannya, itu pada ayat ini ditanyakan kepada mereka tentang bagaimana cara mereka menyambut seruan para rasul untuk membersihkan diri dari penyembahan berhala, dan mengajak berakidah tauhid, mengesakan Allah. Mereka diam seribu bahasa, tidak dapat mengemukakan sedikit pun alasan sebagai jawaban dari pernyataan yang dilontarkan. Mereka bingung tidak tahu apa yang mesti dikatakan. Oleh karena itu, mereka saling bertanya, seperti orang yang sedang menghadapi kesulitan. Mereka tertunduk karena malu dan menyesal. Apabila para rasul tidak dapat menjawab pertanyaan yang dimajukan kepadanya tentang jawaban dan sambutan kaumnya mengenai seruannya kepada mereka, tentu orang-orang yang sesat dan menyesatkan di dunia yang tidak mengindahkan seruan nabi-nabi lebih cemas lagi. Firman Allah:\n\n(Ingatlah) pada hari ketika Allah mengumpulkan para rasul, lalu Dia bertanya (kepada mereka), \"Apa jawaban (kaummu) terhadap (seruan)mu?\" Mereka (para rasul) menjawab, \"Kami tidak tahu (tentang itu). Sesungguhnya Engkaulah Yang Maha Mengetahui segala yang gaib.\" (al-Ma'idah/5: 109)",
          "67": "Betapapun banyaknya dosa seseorang, termasuk menyekutukan Allah yang merupakan dosa yang paling besar, bila ia tobat dan kembali kepada kebenaran, serta beribadah kepada-Nya, membenarkan nabi-Nya, mengerjakan perintah-Nya, dan meninggalkan larangan-Nya, tentu ia termasuk orang-orang yang beruntung dan berbahagia di akhirat. Kejahatannya diganti oleh Allah dengan kebajikan. Ia mendapat karunia dan masuk ke surga yang penuh nikmat. Ia tinggal di dalamnya kekal untuk selama-lamanya, sebagaimana firman Allah :\n\nDan orang-orang yang tidak mempersekutukan Allah dengan sembahan lain dan tidak membunuh orang yang diharamkan Allah kecuali dengan (alasan) yang benar, dan tidak berzina; dan barang siapa melakukan demikian itu, niscaya dia mendapat hukuman yang berat, (yakni) akan dilipatgandakan azab untuknya pada hari Kiamat dan dia akan kekal dalam azab itu, dalam keadaan terhina, kecuali orang-orang yang bertobat dan beriman dan mengerjakan kebajikan; maka kejahatan mereka diganti Allah dengan kebaikan. Allah Maha Pengampun, Maha Penyayang. (al-Furqan/25: 68-70)",
          "68": "Ayat ini menerangkan bahwa Allah yang menciptakan apa yang dikehendaki-Nya. Dia satu-satunya yang berwenang memilih dan menentukan sesuatu hal, baik yang tampak maupun yang tidak, sebagaimana firman-Nya:\n\nApakah (pantas) Allah yang menciptakan itu tidak mengetahui? Dan Dia Mahahalus, Maha Mengetahui. (al-Mulk/67: 14)\n\nDan firman-Nya:\n\nDan tidakkah mereka tahu bahwa Allah mengetahui apa yang mereka sembunyikan dan apa yang mereka nyatakan? (al-Baqarah/2: 77) \n\nAllah Maha Mengetahui semua makhluk-Nya, mengetahui hal ihwal, watak, dan karakternya. Kemudian Dia memilih dari hamba-hamba-Nya, siapa di antara mereka yang berhak dan wajar menerima hidayah dan diangkat menjadi rasul yang mampu melaksanakan tugasnya. Firman Allah:\n\nAllah lebih mengetahui di mana Dia menempatkan tugas kerasulan-Nya. (al-An'am/6: 124) \n\nBila Allah telah menentukan sesuatu, maka manusia tidak dapat memilih sesuai keinginannya. Ia harus menerima dan menaati apa yang telah ditetapkan Allah. Firman Allah:\n\nDan tidaklah pantas bagi laki-laki yang mukmin dan perempuan yang mukmin, apabila Allah dan Rasul-Nya telah menetapkan suatu ketetapan, akan ada pilihan (yang lain) bagi mereka tentang urusan mereka. (al-Ahzab/33: 36)\n\nAyat ini diakhiri dengan satu penjelasan bahwa Allah Mahasuci dan Mahatinggi dari apa yang mereka persekutukan. Tidak ada seorang pun yang dapat menghalangi pilihan-Nya dan membatalkan ketentuan-Nya. Bagaimanapun keinginan dan kegigihan Nabi Muhammad memberi petunjuk untuk mengislamkan pamannya, Abu thalib, dan bagaimanapun kehendak dan kesungguhan penduduk Mekah supaya diutus seorang rasul dari kalangan mereka, semuanya itu gagal dan tidak terlaksana. Hanya pilihan dan ketentuan Allah yang berlaku dan menjadi kenyataan.",
          "69": "Ayat ini menerangkan bahwa apa yang disembunyikan di dalam hati dan apa yang dinyatakan seseorang, pasti Allah mengetahuinya. Firman Nya:\n\nSama saja (bagi Allah), siapa di antaramu yang merahasiakan ucapannya dan siapa yang berterus terang dengannya; dan siapa yang bersembunyi pada malam hari dan yang berjalan pada siang hari. (ar-Ra'd/13: 10) \n\nDan firman-Nya:\n\nDialah Tuhan) yang mengetahui semua yang gaib dan semua yang tampak. Mahatinggi (Allah) dari apa yang mereka persekutukan. (al-Mu'minun/23: 92) \n\n(70) Pada ayat ini, Allah menerangkan bahwa Dialah yang Maha Esa, tidak ada yang berhak disembah melainkan Allah. Dialah yang mengetahui segala sesuatu dan Dia pula yang berkuasa atasnya. Dialah yang berhak dipuji segala perbuatan-Nya, karena Dialah yang memberikan segala kenikmatan yang kita peroleh baik di dunia maupun di akhirat. Segala peraturan dan ketentuan yang telah digariskan-Nya harus berlaku dan terlaksana. Tidak mungkin diganggu gugat karena Dia berada di atas segala makhluk-Nya, Hakim Yang Paling Adil, yang menentukan dan menetapkan bahwa yang benar itu benar dan yang salah itu salah. Kepada-Nya segala sesuatu akan dikembalikan, firman Allah:\n\nHanya kepada Allah segala urusan dikembalikan. (al-Anfal/8: 44) \n\nDi hari Kiamat, tiap-tiap orang dibalas setimpal dengan perbuatannya di dunia. Kalau baik dibalas dengan surga, dan kalau jahat dibalas dengan siksa di neraka.",
          "70": "Pada ayat ini, Allah menerangkan bahwa Dialah yang Maha Esa, tidak ada yang berhak disembah melainkan Allah. Dialah yang mengetahui segala sesuatu dan Dia pula yang berkuasa atasnya. Dialah yang berhak dipuji segala perbuatan-Nya, karena Dialah yang memberikan segala kenikmatan yang kita peroleh baik di dunia maupun di akhirat. Segala peraturan dan ketentuan yang telah digariskan-Nya harus berlaku dan terlaksana. Tidak mungkin diganggu gugat karena Dia berada di atas segala makhluk-Nya, Hakim Yang Paling Adil, yang menentukan dan menetapkan bahwa yang benar itu benar dan yang salah itu salah. Kepada-Nya segala sesuatu akan dikembalikan, firman Allah: Hanya kepada Allah segala urusan dikembalikan. (al-Anfal/8: 44) Di hari Kiamat, tiap-tiap orang dibalas setimpal dengan perbuatannya di dunia. Kalau baik dibalas dengan surga, dan kalau jahat dibalas dengan siksa di neraka.",
          "71": "Pada ayat ini, Allah menyuruh Rasul-Nya supaya bertanya kepada orang-orang yang mempersekutukan-Nya. Andai kata Allah menjadikan malam ini terus menerus sepanjang masa sampai hari Kiamat tanpa ada siang yang menyelinginya, apakah di antara sembahan-sembahan mereka itu kuasa dan mampu mendatangkan siang untuk dapat dimanfaatkan cahayanya? Apakah kaum musyrikin itu tidak mempergunakan pendengarannya? Mereka itu seakan-akan tuli. Kalaulah mereka mempergunakan akal sebaik-baiknya, tentu mereka akan insaf dan sadar serta mengetahui dengan yakin bahwa hanya Allah Yang Mahakuasa yang dapat mendatangkan malam untuk menggantikan siang apabila dikehendaki. Dia mendatangkan siang untuk menghapuskan malam apabila Dia kehendaki dan tiada sesuatu pun yang dapat melakukan yang demikian itu.\n\nFirman Allah:\n\nDan Kami jadikan malam dan siang sebagai dua tanda (kebesaran Kami), kemudian Kami hapuskan tanda malam dan Kami jadikan tanda siang itu terang. (al-Isra'/17: 12)",
          "72": "Kandungan ayat ini kebalikan dari ayat sebelumnya. Pada ayat ini, Allah menyuruh Rasul-Nya menanyakan kepada orang-orang musyrik, andaikata Allah menjadikan siang itu terus menerus sepanjang masa sampai di hari Kiamat tanpa ada malam silih berganti dengannya, apakah ada tuhan selain dari Allah yang mampu mendatangkan malam? Apakah mereka tidak memperhatikan tanda-tanda kekuasaan Allah yang sempurna? Seakan-akan mereka tidak punya pikiran. \n\nSekiranya mereka memperhatikan dengan baik, tentu mereka akan mengambil kesimpulan bahwa tidak ada yang layak disembah kecuali Tuhan yang telah memberikan karunia dan nikmat yang tak terhingga banyaknya dan kuasa menjadikan siang dan malam itu silih berganti untuk terciptanya suatu keseimbangan. Siang dijadikan terang untuk mencari rezeki dengan segala kemampuan yang ada. Kemudian siang itu lenyap digantikan oleh malam yang suasananya cocok digunakan untuk melepaskan dan menghilangkan kelelahan agar tenaga dan pikiran kembali pulih guna mencari rezeki pada keesokan harinya. Firman Allah:\n\nDan Dia (pula) yang menjadikan malam dan siang silih berganti bagi orang yang ingin mengambil pelajaran atau yang ingin bersyukur.(al-Furqan/25: 62)\n\nMenurut kajian ilmiah, sinar matahari dalam ilmu pengetahuan fisika merupakan pancaran gelombang energi yang dihasilkan dari reaksi nuklir fusi dan fisi yang terjadi di permukaan matahari secara berkesinambungan. Ketika sinar ini dipancarkan secara terus menerus dan dalam waktu cukup lama akan menimbulkan panas \n\nApa yang akan terjadi sekiranya siang terus menerus sampai hari Kiamat? Sudah pasti keadaan udara dan hawa dari detik ke detik, dari menit ke menit dan dari jam ke jam akan menjadi semakin panas. Dalam waktu 100 jam saja udara bisa mencapai temperatur di atas titik didih 100ÂºC. Karenanya, lautan, danau, sungai, dan sebagainya akan mendidih dan menggelegak. Dapat dibayangkan apa yang akan terjadi sekiranya seluruh sungai, danau, dan samudera mendidih airnya? Begitu juga darah yang mengalir di dalam tubuh kita juga turut mendidih. Dalam keadaan demikian, tidak ada satu pun makhluk yang dapat hidup. Semuanya akan mati dan musnah menjadi debu-debu yang beterbangan. \n\nAllah juga menjadikan malam sebagai waktu istirahat bagi manusia. Semuanya itu bertujuan agar manusia dapat mem-bayangkan betapa hebatnya kekuasaan Allah dan juga perlindungan yang diberikan-Nya untuk kehidupan setiap makhluk ciptaan-Nya khususnya manusia yang dikaruniai akal pikiran yang sempurna.",
          "73": "Pergantian siang dan malam dengan fungsinya masing-masing, yaitu siang digunakan untuk berusaha mencari rezeki dan malam digunakan untuk istirahat dan melepaskan lelah, sehingga pulih kembali tenaga yang telah dipergunakan pada siang harinya, adalah merupakan rahmat besar dari Allah yang tak ternilai harganya dan wajib disyukuri. Nikmat yang tak disyukuri akan hilang lenyap dicabut dan ditarik kembali oleh Allah. Sebaliknya nikmat yang disyukuri dengan memanfaatkannya sebaik-baiknya sesuai dengan perintah Allah, akan bertambah terus. Firman Allah:\n\nDan (ingatlah) ketika Tuhanmu memaklumkan, \"Sesungguhnya jika kamu bersyukur, niscaya Aku akan menambah (nikmat) kepadamu, tetapi jika kamu mengingkari (nikmat-Ku), maka pasti azab-Ku sangat berat.\" (Ibrahim/14: 7)",
          "74": "Ayat ini menerangkan bahwa di hari Kiamat Allah akan memanggil orang-orang musyrik dan berkata kepada mereka, \"Di mana sekutu-sekutu-Ku yang kalian anggap sebagai sekutu-Ku di dunia? Dapatkah mereka itu melepaskan kalian dari keadaan yang menghimpit sekarang ini.\" Sengaja orang musyrik dipanggil pada waktu itu untuk mengikrarkan suatu kesaksian atas penyembahan mereka selain dari Allah. Ini juga bertujuan supaya mereka mengetahui bahwa mempersekutukan Allah itu adalah sebab paling utama atas kemurkaan-Nya, sebagaimana mengesakan-Nya adalah sebab utama atas rida-Nya.",
          "75": "Allah menerangkan bahwa di hari Kiamat Dia akan mendatangkan saksi atas tiap-tiap umat. Tiap rasul akan menjadi saksi atas umatnya masing-masing, sampai di mana sambutan dan penerimaan umatnya itu kepada agama yang dibawanya dari Allah. Nabi Muhammad pun akan menjadi saksi pada umatnya nanti di hari Kiamat, sebagaimana firman Allah:\n\nDan bagaimanakah (keadaan orang kafir nanti), jika Kami mendatangkan seorang saksi (rasul) dari setiap umat dan Kami mendatangkan engkau (Muhammad) sebagai saksi atas mereka. (an-Nisa'/4: 41) \n\nOrang-orang musyrik di hari Kiamat akan dimintai pertanggungjawaban atas perbuatan syiriknya. Mereka juga dimintai keterangan dan alasan-alasan untuk membenarkan perbuatan mereka, yang tentunya mereka tidak dapat mengemukakan satu alasan pun. Pada waktu itulah mereka mengetahui bahwa mereka akan diazab untuk selama-lamanya dalam neraka. Firman Allah:\n\nMaka Aku memperingatkan kamu dengan neraka yang menyala-nyala, yang hanya dimasuki oleh orang yang paling celaka, yang mendustakan (kebenaran) dan berpaling (dari iman). (al-Lail/92: 14-16) \n\nPada waktu itu, mereka akan sadar dan yakin bahwa apa yang telah diterangkan Allah melalui nabi-Nya itulah yang benar. Lenyaplah sama sekali dari mereka segala apa yang dahulunya mereka ada-adakan di dunia seperti mendustakan rasul yang diutus kepada mereka, mempersekutukan Allah, dan sebagainya.",
          "76": "Ayat ini menerangkan bahwa Karun termasuk kaum Nabi Musa, dan masih terhitung salah seorang pamannya. Karun juga mempunyai nama lain, yaitu \"al-Munawar\" (bercahaya) karena wajahnya yang tampan. Ia paling banyak membaca kitab Taurat di antara teman-temannya dari Bani Israil, hanya dia munafik seperti halnya Samiri. Ia berlaku aniaya dan sombong terhadap sesama Bani Israil.\n\nDan sekiranya Allah melapangkan rezeki kepada hamba-hamba-Nya niscaya mereka akan berbuat melampaui batas di bumi, tetapi Dia menurunkan dengan ukuran yang Dia kehendaki. Sungguh, Dia Mahateliti terhadap (keadaan) hamba-hamba-Nya, Maha Melihat. (asy-Syura/42: 27)\n\nKekayaan melimpah ruah dan perbendaharaan harta yang banyak yang diberikan Allah kepadanya, sehingga kunci-kunci tidak sanggup dipikul oleh sejumlah orang-orang yang kuat karena beratnya, menyebabkan ia sangat bangga, berlaku aniaya, dan sombong terhadap sesamanya serta memandang remeh dan hina mereka. Ibnu 'Abbas mengatakan bahwa kunci-kunci perbendaharaan harta Karun dapat dibawa oleh empat puluh laki-laki yang kuat. \n\nSekalipun ia diperingatkan oleh kaumnya agar jangan terlalu membanggakan hartanya yang berlimpah-limpah dan kekayaan yang bertumpuk-tumpuk itu, karena Allah tidak menyukai orang yang membanggakan diri, tetapi ia tidak menggubrisnya sama sekali. Ia tetap bangga dan menyombongkan diri. Peringatan dan larangan terlalu gembira dan bangga atas pemberian Allah itu ditegaskan juga dalam ayat lain, sebagaimana firman Nya:\n\nAgar kamu tidak bersedih hati terhadap apa yang luput dari kamu, dan jangan pula terlalu gembira terhadap apa yang diberikan-Nya kepadamu. Dan Allah tidak menyukai setiap orang yang sombong dan membanggakan diri. (al-hadid/57: 23) \n\nAllah tidak menyukai orang yang sombong dan membanggakan diri. (an-Nisa'/4: 36)",
          "77": "Pada ayat ini, Allah menerangkan empat macam nasihat dan petunjuk yang ditujukan kepada Karun oleh kaumnya. Orang yang mengamalkan nasihat dan petunjuk itu akan memperoleh kesejahteraan di dunia dan akhirat.\n\n1. Orang yang dianugerahi oleh Allah kekayaan yang berlimpah ruah, perbendaharaan harta yang bertumpuk-tumpuk, serta nikmat yang banyak, hendaklah ia memanfaatkan di jalan Allah, patuh dan taat pada perintah-Nya, mendekatkan diri kepada-Nya untuk memperoleh pahala sebanyak-banyaknya di dunia dan akhirat.\n\nSabda Nabi saw:\n\nManfaatkan yang lima sebelum datang (lawannya) yang lima; mudamu sebelum tuamu, sehatmu sebelum sakitmu, kayamu sebelum miskinmu, waktu senggangmu sebelum kesibukanmu dan hidupmu sebelum matimu. (Riwayat al-Baihaqi dari Ibnu 'Abbas)\n\n2. Setiap orang dipersilakan untuk tidak meninggalkan sama sekali kesenangan dunia baik berupa makanan, minuman, pakaian, serta kesenangan-kesenangan yang lain sepanjang tidak bertentangan dengan ajaran yang telah digariskan oleh Allah. Baik Allah, diri sendiri, maupun keluarga, mempunyai hak atas seseorang yang harus dilaksanakannya. Sabda Nabi Muhammad: \n\nKerjakanlah seperti kerjanya orang yang mengira akan hidup selamanya. Dan waspadalah seperti akan mati besok. (Riwayat al-Baihaqi dari Ibnu 'Umar)\n\n3. Setiap orang harus berbuat baik sebagaimana Allah berbuat baik kepadanya, misalnya membantu orang-orang yang memerlukan, menyambung tali silaturrahim, dan lain sebagainya.\n\n4. Setiap orang dilarang berbuat kerusakan di atas bumi, dan berbuat jahat kepada sesama makhluk, karena Allah tidak menyukai orang-orang yang berbuat kerusakan.",
          "78": "Ayat ini menerangkan reaksi Karun atas nasihat dan petunjuk yang diberikan oleh kaumnya. Dengan sombong ia berkata, \"Harta yang diberikan Allah kepadaku adalah karena ilmu yang ada padaku. Allah mengetahui hal itu. Oleh karena itu, Ia rida padaku dan memberikan harta itu kepadaku.\" Tidak sedikit manusia apabila ditimpa bahaya, ia kembali kepada Tuhan, dan berdoa sepenuh hati. Semua doa yang diketahuinya dibaca dengan harapan supaya bahaya yang menimpanya itu lenyap. Jika maksudnya itu tercapai, ia kemudian lupa kepada Tuhan yang mencabut bahaya itu darinya. Bahkan, ia mengaku bahwa hal itu terjadi karena kepintarannya, karena perhitungan yang tepat, dan sebagainya. Firman Allah:\n\nMaka apabila manusia ditimpa bencana dia menyeru Kami, kemudian apabila Kami berikan nikmat Kami kepadanya dia berkata, \"Sesungguhnya aku diberi nikmat ini hanyalah karena kepintaranku.\" Sebenarnya, itu adalah ujian, tetapi kebanyakan mereka tidak mengetahui. (az-Zumar/39: 49) \n\nPengakuan seperti tersebut di atas ditolak oleh Allah dengan firman Nya, \"Apakah ia lupa ataukah tidak pernah mengetahui bahwa Allah telah membinasakan umat dahulu sebelum dia, padahal mereka itu jauh lebih kuat dan lebih banyak harta yang dikumpulkannya.\" Sekiranya Allah memberi seseorang harta kekayaan dan lainnya hanya karena kepintaran dan kebaikan yang ada padanya, sehingga Allah rida kepadanya, tentu Dia tidak akan membinasakan orang-orang dahulu yang jauh lebih kaya, kuat dan pintar dari Karun. Orang yang diridai Allah tentu tidak akan dibinasakan-Nya. Tidakkah ia menyaksikan nasib Fir'aun yang mempunyai kerajaan besar dan pengikutnya yang banyak dengan sekejap mata dihancurkan oleh Allah.\n\nPada akhir ayat ini, Allah menegaskan bahwa apabila Dia hendak mengazab orang-orang yang bergelimang dosa itu, Dia tidak akan menanyakan berapa banyak dosa yang telah diperbuatnya, begitu juga jenisnya, karena Dia Maha Mengetahui semuanya itu. Dalam ayat lain ditegaskan juga sebagai berikut:\n\nMaka pada hari itu manusia dan jin tidak ditanya tentang dosanya. (ar-Rahman/55: 39)",
          "79": "Ayat ini menerangkan bahwa pada suatu hari Karun keluar ke tengah-tengah kaumnya dengan pakaian yang megah dan perhiasan yang berlebihan dalam suatu iring-iringan yang lengkap dengan pengawal, hamba sahaya, dan inang pengasuh untuk mempertontonkan ketinggian dan kebesarannya kepada manusia. Hal yang demikian itu adalah sifat yang amat tercela, kebanggaan yang terkutuk bagi orang yang berakal dan berpikiran sehat. Hal itu menyebabkan kaumnya terbagi dua.\n\nPertama, orang-orang yang mementingkan kehidupan duniawi yang selalu berpikir dan berusaha sekuat tenaga bagaimana caranya supaya bisa hidup mewah di dunia ini. Menurut anggapan mereka, hidup yang demikian itu adalah kebahagiaan. Mereka itu berharap juga dapat memiliki sebagaimana yang dimiliki Karun yaitu harta yang bertumpuk-tumpuk dan kekayaan yang berlebih-lebihan, karena yang demikian itu dianggap sebagai keberun-tungan yang besar. \n\nDengan demikian mereka akan hidup senang, dan berbuat sekehendak hatinya merasakan kenikmatan dunia dengan segala variasinya. Keinginan manusia seperti ini sampai sekarang tetap ada, bahkan tumbuh dengan subur di tengah-tengah masyarakat. Di mana-mana kita dapat menyaksikan bahwa tidak sedikit orang yang berkeinginan keras untuk memiliki seperti apa yang telah dimiliki orang-orang kaya, pengusaha besar, dan lainnya, seperti rumah besar dengan perabot serba mewah, mobil mewah, tanah, dan sawah ladang yang berpuluh-puluh bahkan beratus hektar. Hal itu mereka lakukan sekalipun menggunakan jalan yang tidak wajar, yang tidak sesuai dengan hukum agama dan peraturan negara. Hal itu menyebabkan timbulnya kecurangan dan korupsi di mana-mana.",
          "80": "Ayat ini menerangkan kelompok kedua yaitu orang-orang yang berilmu dan berpikiran waras. Mereka menganggap bahwa cara berpikir orang-orang yang termasuk golongan pertama tadi sangat keliru, bahkan dianggap sebagai satu bencana besar dan kerugian yang nyata, karena lebih mementingkan kehidupan dunia yang fana dari kehidupan akhirat yang kekal. Golongan kedua berpendapat bahwa pahala di sisi Allah bagi orang-orang yang percaya kepada Allah dan rasul-Nya serta beramal saleh, jauh lebih baik daripada menumpuk harta. Apa yang di sisi Allah kekal abadi, sedangkan apa yang dimiliki manusia akan lenyap dan musnah, sebagaimana firman-Nya:\n\nApa yang ada di sisimu akan lenyap, dan apa yang ada di sisi Allah adalah kekal. (an-Nahl/16: 96)\n\nAyat 80 diakhiri satu penjelasan bahwa yang dapat menerima dan mengamalkan nasihat dari ayat di atas hanyalah orang-orang yang sabar dan tekun mematuhi perintah Allah, menjauhi larangan-Nya. Mereka juga menerima baik apa yang telah diberikan Allah kepadanya serta membelanjakannya untuk kepentingan diri dan masyarakat.",
          "81": "Pada ayat ini, Allah menerangkan akibat kesombongan dan keangkuhan Karun. Ia beserta rumah dan segala kemegahan dan kekayaannya dibenamkan ke dalam bumi. Tidak ada yang dapat menyelamatkannya dari azab Allah itu, baik perorangan maupun secara bersama-sama. Karun sendiri tidak dapat membela dirinya. Tidak sedikit orang yang sesat jalan, dan keliru paham tentang harta yang diberikan kepadanya. Mereka menyangka harta itu hanya untuk kemegahan dan kesenangan sehingga mereka tidak menyalurkan penggunaannya ke jalan yang diridai Allah. Oleh karena itu, Allah menimpakan azab-Nya kepada mereka.",
          "82": "Ayat ini menerangkan bahwa orang-orang yang semula bercita-cita ingin mempunyai kedudukan dan posisi terhormat seperti yang pernah dimiliki Karun, dengan seketika mengurungkan cita-citanya setelah menyaksikan azab yang ditimpakan kepada Karun. Mereka menyadari bahwa harta benda yang banyak dan kehidupan duniawi yang serba mewah, tidak mengantarkan mereka pada keridaan Allah. Dia memberi rezeki kepada yang dikehendaki-Nya, dan tidak memberi kepada yang tidak dikehendaki. Allah meninggikan dan merendahkan orang yang dikehendaki-Nya. Kesemuanya itu adalah berdasarkan kebijaksanaan Allah dan ketetapan yang telah digariskan-Nya.\n\nDiriwayatkan dari Ibnu Mas'ud bahwa Allah telah memberikan kepada manusia watak masing-masing sebagaimana Dia telah membagi-bagikan rezeki di antara mereka. Sesungguhnya Allah itu memberikan harta kepada orang yang disenangi, dan tidak menganugerahkan iman kecuali kepada orang yang disenangi dan dikasihi-Nya.\n\nMereka merasa memperoleh karunia dari Allah karena cita-cita mereka belum tercapai. Andaikata sudah tercapai, tentu mereka dibenamkan juga ke dalam bumi sebagaimana yang telah dialami Karun. Pengertian mereka bertambah mantap bahwa tidak beruntung orang-orang yang mengingkari nikmat Allah, mendustakan rasul-Nya, dan pahala yang dijanjikan di akhirat bagi orang yang taat kepada-Nya. Mereka akan dimusnahkan oleh azab, firman Allah:\n\nDan sungguh, telah datang kepada mereka seorang rasul dari (kalangan) mereka sendiri, tetapi mereka mendustakannya, karena itu mereka ditimpa azab dan mereka adalah orang yang zalim. (an-Nahl/16: 113)",
          "83": "Ayat ini menerangkan bahwa kebahagiaan dan segala kenikmatan di akhirat disediakan untuk orang-orang yang tidak takabur, tidak menyombongkan diri, dan tidak berbuat kerusakan di muka bumi seperti menganiaya dan sebagainya. Mereka itu bersifat rendah hati, tahu menempatkan diri kepada orang yang lebih tua dan lebih banyak ilmunya. Kepada yang lebih muda dan kurang ilmunya, mereka mengasihi, tidak takabur, dan menyom-bongkan diri. Orang yang takabur dan menyombongkan diri tidak disukai Allah, akan mendapat siksa yang amat pedih, dan tidak masuk surga di akhirat nanti, sebagaimana firman Allah:\n\nAdapun orang-orang yang beriman dan mengerjakan kebajikan, Allah akan menyempurnakan pahala bagi mereka dan menambah sebagian dari karunia-Nya. Sedangkan orang-orang yang enggan (menyembah Allah) dan menyombongkan diri, maka Allah akan mengazab mereka dengan azab yang pedih. Dan mereka tidak akan mendapatkan pelindung dan penolong selain Allah. (an-Nisa'/4: 173) \n\nSabda Rasulullah saw:\n\nTidak akan masuk surga orang yang ada di dalam hatinya sifat takabur, sekalipun sebesar zarah. (Riwayat Muslim dan Abu Dawud dari Ibnu Mas'ud) \n\nAyat 83 ini ditutup dengan penjelasan bahwa kesudahan yang baik berupa surga diperoleh orang-orang yang takwa kepada Allah dengan mengamalkan perintah-Nya, menjauhi larangan-Nya, tidak takabur dan tidak menyombongkan diri seperti Fir'aun dan Karun.",
          "84": "Ayat ini menerangkan bahwa siapa yang di akhirat datang dengan membawa satu amal kebajikan, akan dibalas dengan yang lebih baik, dan dilipatgandakan sebanyak-banyaknya. Tidak ada yang mengetahui berapa kelipatannya kecuali Allah sebagai karunia dan rahmat dari-Nya. Rasulullah saw bersabda:\n\nSiapa yang bermaksud akan mengerjakan satu kebaikan, kemudian tidak jadi dikerjakannya, Allah mencatat pahala pada sisi-Nya satu kebaikan yang sempurna, kalau ia bermaksud mengerjakan satu kebaikan lalu dikerjakannya, maka Allah mencatat (pahala) dengan sepenuh kebaikan sampai tujuh ratus kali lipat, bahkan lipat ganda yang lebih banyak lagi. (Riwayat al-Bukhari dan Muslim dari Ibnu 'Abbas)\n\nDalam hadis lain Rasulullah bersabda:\n\nDan barang siapa yang bermaksud mengerjakan satu kejahatan kemudian tidak dikerjakannya, maka ditulislah oleh Allah swt di sisi-Nya satu kebaikan yang sempurna, dan kalau ia bermaksud mengerjakan kemudian dikerjakannya, maka Allah mencatatkan baginya hanya satu kejahatan saja. (Riwayat al-Bukhari dan Muslim dari Ibnu 'Abbas)\n\nHal ini sesuai dengan firman Allah:\n\nDan barang siapa membawa kejahatan, maka disungkurkanlah wajah mereka ke dalam neraka. Kamu tidak diberi balasan, melainkan (setimpal) dengan apa yang telah kamu kerjakan. (an-Naml/27: 90)",
          "85": "Pada ayat ini, Allah menerangkan bahwa Dialah yang mewajibkan kepada Muhammad mengamalkan isi Al-Qur'an, dan melaksanakan hukum-hukum dan perintah yang ada di dalamnya. Dia pulalah yang akan mengembalikan Muhammad ke tanah suci Mekah, tanah tumpah darahnya dalam keadaan menang dan merebutnya kembali dari kaum yang telah mengusirnya dari sana. Muhammad saw kembali ke Mekah dengan satu kemenangan besar bagi kaum Muslimin, karena dengan demikian ia dapat mengembangkan Islam dengan bebas dan dapat menekan kehendak kaum musyrikin. Ini adalah janji dari Allah ketika Muhammad selalu disakiti dan mendapat tekanan yang berat dari kaumnya bahwa dia akan hijrah meninggalkan Mekah, dan akan kembali dalam keadaan menang. \n\nSelain kembali ke Mekah, ada yang berpendapat Allah mengembalikan Rasul kepada kematian atau mengembalikan ke surga, sebagaimana firman Allah:\n\nKatakanlah (Muhammad), \"Wahai kaumku! Berbuatlah menurut kedudukanmu, aku pun berbuat (demikian). Kelak kamu akan mengetahui, siapa yang akan memperoleh tempat (terbaik) di akhirat (nanti). Sesungguhnya orang-orang yang zalim itu tidak akan beruntung. (al-An'am/6: 135)",
          "86": "Ayat ini menerangkan bahwa Muhammad tidak pernah mengharapkan diturunkannya Al-Qur'an kepadanya untuk mengetahui berita-berita orang-orang sebelumnya, dan hal-hal yang terjadi sesudahnya, antara lain seperti agama yang mengandung kebahagiaan bagi manusia di dunia dan akhirat, dan juga adab-adab yang meninggikan derajat mereka dan mencerdaskan akal pikiran mereka. Sekalipun demikian, Allah menurunkan semuanya itu kepada Muhammad sebagai rahmat dari-Nya.\n\nPada ayat ini, Allah melarang Nabi Muhammad dan umatnya untuk membantu perjuangan orang-orang kafir dalam bentuk apa pun. Umat Muhammad justru dituntut untuk membantu memperkuat perjuangan umat Islam. Oleh karena itu, hendaklah ia memuji Tuhannya atas nikmat yang dikaruniakan kepadanya dengan penurunan kitab suci Al-Qur'an. Nabi saw tidak perlu menolong dan membantu orang-orang musyrik yang mengingkari Kitab suci Al-Qur'an itu, tetapi hendaklah ia memisahkan diri dan berpaling dari mereka sesuai dengan firman Allah:\n\nMaka sampaikanlah (Muhammad) secara terang-terangan segala apa yang diperintahkan (kepadamu) dan berpalinglah dari orang yang musyrik. (al-hijr/15: 94)",
          "87": "Allah menganjurkan kepada Muhammad agar tidak mengindahkan tipu daya orang-orang kafir, dan jangan sekali-kali terpengaruh sehingga mereka berhasil menghalang-halangi penyampaian ayat-ayat suci Al-Qur'an sesudah diturunkan kepadanya. Allah selalu bersamanya dan menguatkan serta memenangkan agama-Nya dari orang-orang kafir. Bahkan Nabi saw diperintahkan menyeru kaumnya ke jalan Allah dan menyampaikan agama-Nya kepada mereka, menyembah hanya kepada Allah saja yang tidak ada sekutu bagi-Nya. Pada akhir ayat ini, Allah menekankan supaya Muhammad jangan sekali-kali meninggalkan dakwahnya, dan selalu menyampaikan risalahnya kepada kaum musyrikin, supaya dia tidak seperti mereka, bermaksiat menyalahi perintah-Nya. Di ayat lain diterangkan:\n\nDan jangan sekali-kali kamu masuk golongan orang-orang musyrik. (al-An'am/6: 14",
          "88": "Pada ayat ini, Allah melarang Nabi Muhammad menyembah sembahan lain selain Allah, karena tiada Tuhan yang patut disembah kecuali Allah, sebagaimana firman Nya:\n\n(Dialah) Tuhan timur dan barat, tidak ada tuhan selain Dia, maka jadikanlah Dia sebagai pelindung. (al-Muzzammil/73: 9) \n\nAllah itu kekal abadi sekalipun semua makhluk yang ada sudah mati dan binasa. Firman Allah:\n\nSemua yang ada di bumi itu akan binasa, tetapi wajah Tuhanmu yang memiliki kebesaran dan kemuliaan tetap kekal. (ar-Rahman/55: 26-27) \n\nDan sabda Nabi Muhammad saw:\n\nUngkapan paling benar yang diucapkan penyair adalah yang diucapkan oleh Labid, yaitu: \"Ketahuilah setiap sesuatu selain dari Allah akan binasa.\" (Riwayat al-Bukhari dan Muslim dari Abu Hurairah)\n\nAllah-lah yang mempunyai kerajaan, dan berbuat sekehendak-Nya. Dia-lah yang menentukan segala sesuatu yang akan berlaku kepada semua makhluk. Kepada-Nyalah akan dikembalikan semuanya, dan dibalas menurut amal perbuatannya masing-masing. Kalau ia beramal baik, taat, dan patuh kepada perintah Allah, akan dimasukkan ke dalam surga. Sebaliknya kalau ia berbuat maksiat dan bergelimang dosa, akan dimasukkan ke dalam neraka. Nabi saw bersabda sebagaimana diriwayatkan dari Abu Hurairah:\n\nSemua umatku akan masuk surga kecuali yang tidak mau. Barang siapa taat kepadaku, maka ia masuk ke dalam surga, dan barang siapa durhaka kepadaku, maka sungguh ia telah enggan. (Riwayat al-Bukhari dari Abu Hurairah)."
        }
      }
    }
  }
}