{
  "name": "As-Sajdah",
  "name_translations": {
    "ar": "السجدة",
    "en": "The Prostration",
    "id": "Sajdah"
  },
  "number_of_ayah": 30,
  "number_of_surah": 32,
  "place": "Mecca",
  "recitations": [{
    "name": "Mishari Rashid al-`Afasy",
    "audio_url": "https://download.quranicaudio.com/quran/mishaari_raashid_al_3afaasee/032.mp3"
  }, {
    "name": "Abdur-Rahman as-Sudais",
    "audio_url": "https://download.quranicaudio.com/quran/abdurrahmaan_as-sudays/032.mp3"
  }, {
    "name": "Saad al-Ghamdi",
    "audio_url": "https://download.quranicaudio.com/quran/sa3d_al-ghaamidi/complete/032.mp3"
  }],
  "type": "Makkiyah",
  "verses": [{
    "number": 1,
    "text": "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ الٓمٓ",
    "translation_en": "Alif, Lam, Meem.",
    "translation_id": "Alif Laam Miim"
  }, {
    "number": 2,
    "text": "تَنزِيلُ ٱلْكِتَٰبِ لَا رَيْبَ فِيهِ مِن رَّبِّ ٱلْعَٰلَمِينَ",
    "translation_en": "[This is] the revelation of the Book about which there is no doubt from the Lord of the worlds.",
    "translation_id": "Turunnya Al-Quran yang tidak ada keraguan di dalamnya, (adalah) dari Tuhan semesta alam."
  }, {
    "number": 3,
    "text": "أَمْ يَقُولُونَ ٱفْتَرَىٰهُ بَلْ هُوَ ٱلْحَقُّ مِن رَّبِّكَ لِتُنذِرَ قَوْمًا مَّآ أَتَىٰهُم مِّن نَّذِيرٍ مِّن قَبْلِكَ لَعَلَّهُمْ يَهْتَدُونَ",
    "translation_en": "Or do they say, \"He invented it\"? Rather, it is the truth from your Lord, [O Muhammad], that you may warn a people to whom no warner has come before you [so] perhaps they will be guided.",
    "translation_id": "Tetapi mengapa mereka (orang kafir) mengatakan: \"Dia Muhammad mengada-adakannya\". Sebenarnya Al-Quran itu adalah kebenaran dari Rabbmu, agar kamu memberi peringatan kepada kaum yang belum datang kepada mereka orang yang memberi peringatan sebelum kamu; mudah-mudahan mereka mendapat petunjuk."
  }, {
    "number": 4,
    "text": "ٱللَّهُ ٱلَّذِى خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضَ وَمَا بَيْنَهُمَا فِى سِتَّةِ أَيَّامٍ ثُمَّ ٱسْتَوَىٰ عَلَى ٱلْعَرْشِ مَا لَكُم مِّن دُونِهِۦ مِن وَلِىٍّ وَلَا شَفِيعٍ أَفَلَا تَتَذَكَّرُونَ",
    "translation_en": "It is Allah who created the heavens and the earth and whatever is between them in six days; then He established Himself above the Throne. You have not besides Him any protector or any intercessor; so will you not be reminded?",
    "translation_id": "Allah lah yang menciptakan langit dan bumi dan apa yang ada di antara keduanya dalam enam masa, kemudian Dia bersemayam di atas 'Arsy. Tidak ada bagi kamu selain dari pada-Nya seorang penolongpun dan tidak (pula) seorang pemberi syafa'at. Maka apakah kamu tidak memperhatikan?"
  }, {
    "number": 5,
    "text": "يُدَبِّرُ ٱلْأَمْرَ مِنَ ٱلسَّمَآءِ إِلَى ٱلْأَرْضِ ثُمَّ يَعْرُجُ إِلَيْهِ فِى يَوْمٍ كَانَ مِقْدَارُهُۥٓ أَلْفَ سَنَةٍ مِّمَّا تَعُدُّونَ",
    "translation_en": "He arranges [each] matter from the heaven to the earth; then it will ascend to Him in a Day, the extent of which is a thousand years of those which you count.",
    "translation_id": "Dia mengatur urusan dari langit ke bumi, kemudian (urusan) itu naik kepada-Nya dalam satu hari yang kadarnya adalah seribu tahun menurut perhitunganmu"
  }, {
    "number": 6,
    "text": "ذَٰلِكَ عَٰلِمُ ٱلْغَيْبِ وَٱلشَّهَٰدَةِ ٱلْعَزِيزُ ٱلرَّحِيمُ",
    "translation_en": "That is the Knower of the unseen and the witnessed, the Exalted in Might, the Merciful,",
    "translation_id": "Yang demikian itu ialah Tuhan Yang mengetahui yang ghaib dan yang nyata, Yang Maha Perkasa lagi Maha Penyayang."
  }, {
    "number": 7,
    "text": "ٱلَّذِىٓ أَحْسَنَ كُلَّ شَىْءٍ خَلَقَهُۥ وَبَدَأَ خَلْقَ ٱلْإِنسَٰنِ مِن طِينٍ",
    "translation_en": "Who perfected everything which He created and began the creation of man from clay.",
    "translation_id": "Yang membuat segala sesuatu yang Dia ciptakan sebaik-baiknya dan Yang memulai penciptaan manusia dari tanah."
  }, {
    "number": 8,
    "text": "ثُمَّ جَعَلَ نَسْلَهُۥ مِن سُلَٰلَةٍ مِّن مَّآءٍ مَّهِينٍ",
    "translation_en": "Then He made his posterity out of the extract of a liquid disdained.",
    "translation_id": "Kemudian Dia menjadikan keturunannya dari saripati air yang hina."
  }, {
    "number": 9,
    "text": "ثُمَّ سَوَّىٰهُ وَنَفَخَ فِيهِ مِن رُّوحِهِۦ وَجَعَلَ لَكُمُ ٱلسَّمْعَ وَٱلْأَبْصَٰرَ وَٱلْأَفْـِٔدَةَ قَلِيلًا مَّا تَشْكُرُونَ",
    "translation_en": "Then He proportioned him and breathed into him from His [created] soul and made for you hearing and vision and hearts; little are you grateful.",
    "translation_id": "Kemudian Dia menyempurnakan dan meniupkan ke dalamnya roh (ciptaan)-Nya dan Dia menjadikan bagi kamu pendengaran, penglihatan dan hati; (tetapi) kamu sedikit sekali bersyukur."
  }, {
    "number": 10,
    "text": "وَقَالُوٓا۟ أَءِذَا ضَلَلْنَا فِى ٱلْأَرْضِ أَءِنَّا لَفِى خَلْقٍ جَدِيدٍۭ بَلْ هُم بِلِقَآءِ رَبِّهِمْ كَٰفِرُونَ",
    "translation_en": "And they say, \"When we are lost within the earth, will we indeed be [recreated] in a new creation?\" Rather, they are, in [the matter of] the meeting with their Lord, disbelievers.",
    "translation_id": "Dan mereka berkata: \"Apakah bila kami telah lenyap (hancur) dalam tanah, kami benar-benar akan berada dalam ciptaan yang baru?\" Bahkan mereka ingkar akan menemui Tuhannya."
  }, {
    "number": 11,
    "text": "قُلْ يَتَوَفَّىٰكُم مَّلَكُ ٱلْمَوْتِ ٱلَّذِى وُكِّلَ بِكُمْ ثُمَّ إِلَىٰ رَبِّكُمْ تُرْجَعُونَ",
    "translation_en": "Say, \"The angel of death will take you who has been entrusted with you. Then to your Lord you will be returned.\"",
    "translation_id": "Katakanlah: \"Malaikat maut yang diserahi untuk (mencabut nyawa)mu akan mematikanmu, kemudian hanya kepada Tuhanmulah kamu akan dikembalikan\"."
  }, {
    "number": 12,
    "text": "وَلَوْ تَرَىٰٓ إِذِ ٱلْمُجْرِمُونَ نَاكِسُوا۟ رُءُوسِهِمْ عِندَ رَبِّهِمْ رَبَّنَآ أَبْصَرْنَا وَسَمِعْنَا فَٱرْجِعْنَا نَعْمَلْ صَٰلِحًا إِنَّا مُوقِنُونَ",
    "translation_en": "If you could but see when the criminals are hanging their heads before their Lord, [saying], \"Our Lord, we have seen and heard, so return us [to the world]; we will work righteousness. Indeed, we are [now] certain.\"",
    "translation_id": "Dan, jika sekiranya kamu melihat mereka ketika orang-orang yang berdosa itu menundukkan kepalanya di hadapan Tuhannya, (mereka berkata): \"Ya Tuhan kami, kami telah melihat dan mendengar, maka kembalikanlah kami (ke dunia), kami akan mengerjakan amal saleh, sesungguhnya kami adalah orang-orang yang yakin\"."
  }, {
    "number": 13,
    "text": "وَلَوْ شِئْنَا لَءَاتَيْنَا كُلَّ نَفْسٍ هُدَىٰهَا وَلَٰكِنْ حَقَّ ٱلْقَوْلُ مِنِّى لَأَمْلَأَنَّ جَهَنَّمَ مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ أَجْمَعِينَ",
    "translation_en": "And if We had willed, We could have given every soul its guidance, but the word from Me will come into effect [that] \"I will surely fill Hell with jinn and people all together.",
    "translation_id": "Dan kalau Kami menghendaki niscaya Kami akan berikan kepada tiap-tiap jiwa petunjuk, akan tetapi telah tetaplah perkataan dari pada-Ku: \"Sesungguhnya akan Aku penuhi neraka jahannam itu dengan jin dan manusia bersama-sama\"."
  }, {
    "number": 14,
    "text": "فَذُوقُوا۟ بِمَا نَسِيتُمْ لِقَآءَ يَوْمِكُمْ هَٰذَآ إِنَّا نَسِينَٰكُمْ وَذُوقُوا۟ عَذَابَ ٱلْخُلْدِ بِمَا كُنتُمْ تَعْمَلُونَ",
    "translation_en": "So taste [punishment] because you forgot the meeting of this, your Day; indeed, We have [accordingly] forgotten you. And taste the punishment of eternity for what you used to do.\"",
    "translation_id": "Maka rasailah olehmu (siksa ini) disebabkan kamu melupakan akan pertemuan dengan harimu ini. Sesungguhnya Kami telah melupakan kamu (pula) dan rasakanlah siksa yang kekal, disebabkan apa yang selalu kamu kerjakan."
  }, {
    "number": 15,
    "text": "إِنَّمَا يُؤْمِنُ بِـَٔايَٰتِنَا ٱلَّذِينَ إِذَا ذُكِّرُوا۟ بِهَا خَرُّوا۟ سُجَّدًا وَسَبَّحُوا۟ بِحَمْدِ رَبِّهِمْ وَهُمْ لَا يَسْتَكْبِرُونَ",
    "translation_en": "Only those believe in Our verses who, when they are reminded by them, fall down in prostration and exalt [Allah] with praise of their Lord, and they are not arrogant.",
    "translation_id": "Sesungguhnya orang yang benar-benar percaya kepada ayat-ayat Kami adalah mereka yang apabila diperingatkan dengan ayat-ayat itu mereka segera bersujud seraya bertasbih dan memuji Rabbnya, dan lagi pula mereka tidaklah sombong."
  }, {
    "number": 16,
    "text": "تَتَجَافَىٰ جُنُوبُهُمْ عَنِ ٱلْمَضَاجِعِ يَدْعُونَ رَبَّهُمْ خَوْفًا وَطَمَعًا وَمِمَّا رَزَقْنَٰهُمْ يُنفِقُونَ",
    "translation_en": "They arise from [their] beds; they supplicate their Lord in fear and aspiration, and from what We have provided them, they spend.",
    "translation_id": "Lambung mereka jauh dari tempat tidurnya dan mereka selalu berdoa kepada Rabbnya dengan penuh rasa takut dan harap, serta mereka menafkahkan apa apa rezeki yang Kami berikan."
  }, {
    "number": 17,
    "text": "فَلَا تَعْلَمُ نَفْسٌ مَّآ أُخْفِىَ لَهُم مِّن قُرَّةِ أَعْيُنٍ جَزَآءًۢ بِمَا كَانُوا۟ يَعْمَلُونَ",
    "translation_en": "And no soul knows what has been hidden for them of comfort for eyes as reward for what they used to do.",
    "translation_id": "Tak seorangpun mengetahui berbagai nikmat yang menanti, yang indah dipandang sebagai balasan bagi mereka, atas apa yang mereka kerjakan."
  }, {
    "number": 18,
    "text": "أَفَمَن كَانَ مُؤْمِنًا كَمَن كَانَ فَاسِقًا لَّا يَسْتَوُۥنَ",
    "translation_en": "Then is one who was a believer like one who was defiantly disobedient? They are not equal.",
    "translation_id": "Apakah orang-orang beriman itu sama dengan orang-orang yang fasik? Mereka tidak sama."
  }, {
    "number": 19,
    "text": "أَمَّا ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّٰلِحَٰتِ فَلَهُمْ جَنَّٰتُ ٱلْمَأْوَىٰ نُزُلًۢا بِمَا كَانُوا۟ يَعْمَلُونَ",
    "translation_en": "As for those who believed and did righteous deeds, for them will be the Gardens of Refuge as accommodation for what they used to do.",
    "translation_id": "Adapun orang-orang yang beriman dan mengerjakan amal saleh, maka bagi mereka jannah tempat kediaman, sebagai pahala terhadap apa yang mereka kerjakan."
  }, {
    "number": 20,
    "text": "وَأَمَّا ٱلَّذِينَ فَسَقُوا۟ فَمَأْوَىٰهُمُ ٱلنَّارُ كُلَّمَآ أَرَادُوٓا۟ أَن يَخْرُجُوا۟ مِنْهَآ أُعِيدُوا۟ فِيهَا وَقِيلَ لَهُمْ ذُوقُوا۟ عَذَابَ ٱلنَّارِ ٱلَّذِى كُنتُم بِهِۦ تُكَذِّبُونَ",
    "translation_en": "But as for those who defiantly disobeyed, their refuge is the Fire. Every time they wish to emerge from it, they will be returned to it while it is said to them, \"Taste the punishment of the Fire which you used to deny.\"",
    "translation_id": "Dan adapun orang-orang yang fasik (kafir) maka tempat mereka adalah jahannam. Setiap kali mereka hendak keluar daripadanya, mereka dikembalikan ke dalamnya dan dikatakan kepada mereka: \"Rasakanlah siksa neraka yang dahulu kamu mendustakannya\"."
  }, {
    "number": 21,
    "text": "وَلَنُذِيقَنَّهُم مِّنَ ٱلْعَذَابِ ٱلْأَدْنَىٰ دُونَ ٱلْعَذَابِ ٱلْأَكْبَرِ لَعَلَّهُمْ يَرْجِعُونَ",
    "translation_en": "And we will surely let them taste the nearer punishment short of the greater punishment that perhaps they will repent.",
    "translation_id": "Dan Sesungguhnya Kami merasakan kepada mereka sebahagian azab yang dekat (di dunia) sebelum azab yang lebih besar (di akhirat), mudah-mudahan mereka kembali (ke jalan yang benar)."
  }, {
    "number": 22,
    "text": "وَمَنْ أَظْلَمُ مِمَّن ذُكِّرَ بِـَٔايَٰتِ رَبِّهِۦ ثُمَّ أَعْرَضَ عَنْهَآ إِنَّا مِنَ ٱلْمُجْرِمِينَ مُنتَقِمُونَ",
    "translation_en": "And who is more unjust than one who is reminded of the verses of his Lord; then he turns away from them? Indeed We, from the criminals, will take retribution.",
    "translation_id": "Dan siapakah yang lebih zalim daripada orang yang telah diperingatkan dengan ayat-ayat Tuhannya, kemudian ia berpaling daripadanya? Sesungguhnya Kami akan memberikan pembalasan kepada orang-orang yang berdosa."
  }, {
    "number": 23,
    "text": "وَلَقَدْ ءَاتَيْنَا مُوسَى ٱلْكِتَٰبَ فَلَا تَكُن فِى مِرْيَةٍ مِّن لِّقَآئِهِۦ وَجَعَلْنَٰهُ هُدًى لِّبَنِىٓ إِسْرَٰٓءِيلَ",
    "translation_en": "And We certainly gave Moses the Scripture, so do not be in doubt over his meeting. And we made the Torah guidance for the Children of Israel.",
    "translation_id": "Dan Sesungguhnya Kami telah berikan kepada Musa Al-Kitab (Taurat), maka janganlah kamu (Muhammad) ragu menerima (Al-Quran itu) dan Kami jadikan Al-Kitab (Taurat) itu petunjuk bagi Bani Israil."
  }, {
    "number": 24,
    "text": "وَجَعَلْنَا مِنْهُمْ أَئِمَّةً يَهْدُونَ بِأَمْرِنَا لَمَّا صَبَرُوا۟ وَكَانُوا۟ بِـَٔايَٰتِنَا يُوقِنُونَ",
    "translation_en": "And We made from among them leaders guiding by Our command when they were patient and [when] they were certain of Our signs.",
    "translation_id": "Dan Kami jadikan di antara mereka itu pemimpin-pemimpin yang memberi petunjuk dengan perintah Kami ketika mereka sabar. Dan adalah mereka meyakini ayat-ayat Kami."
  }, {
    "number": 25,
    "text": "إِنَّ رَبَّكَ هُوَ يَفْصِلُ بَيْنَهُمْ يَوْمَ ٱلْقِيَٰمَةِ فِيمَا كَانُوا۟ فِيهِ يَخْتَلِفُونَ",
    "translation_en": "Indeed, your Lord will judge between them on the Day of Resurrection concerning that over which they used to differ.",
    "translation_id": "Sesungguhnya Tuhanmu Dialah yang memberikan keputusan di antara mereka pada hari kiamat tentang apa yang selalu mereka perselisihkan padanya."
  }, {
    "number": 26,
    "text": "أَوَلَمْ يَهْدِ لَهُمْ كَمْ أَهْلَكْنَا مِن قَبْلِهِم مِّنَ ٱلْقُرُونِ يَمْشُونَ فِى مَسَٰكِنِهِمْ إِنَّ فِى ذَٰلِكَ لَءَايَٰتٍ أَفَلَا يَسْمَعُونَ",
    "translation_en": "Has it not become clear to them how many generations We destroyed before them, [as] they walk among their dwellings? Indeed in that are signs; then do they not hear?",
    "translation_id": "Dan apakah tidak menjadi petunjuk bagi mereka, berapa banyak umat sebelum mereka yang telah Kami binasakan sedangkan mereka sendiri berjalan di tempat-tempat kediaman mereka itu. Sesungguhnya pada yang demikian itu terdapat tanda-tanda (kekuasaan Allah). Maka apakah mereka tidak mendengarkan?"
  }, {
    "number": 27,
    "text": "أَوَلَمْ يَرَوْا۟ أَنَّا نَسُوقُ ٱلْمَآءَ إِلَى ٱلْأَرْضِ ٱلْجُرُزِ فَنُخْرِجُ بِهِۦ زَرْعًا تَأْكُلُ مِنْهُ أَنْعَٰمُهُمْ وَأَنفُسُهُمْ أَفَلَا يُبْصِرُونَ",
    "translation_en": "Have they not seen that We drive the water [in clouds] to barren land and bring forth thereby crops from which their livestock eat and [they] themselves? Then do they not see?",
    "translation_id": "Dan apakah mereka tidak memperhatikan, bahwasanya Kami menghalau (awan yang mengandung) air ke bumi yang tandus, lalu Kami tumbuhkan dengan air hujan itu tanaman yang daripadanya makan hewan ternak mereka dan mereka sendiri. Maka apakah mereka tidak memperhatikan?"
  }, {
    "number": 28,
    "text": "وَيَقُولُونَ مَتَىٰ هَٰذَا ٱلْفَتْحُ إِن كُنتُمْ صَٰدِقِينَ",
    "translation_en": "And they say, \"When will be this conquest, if you should be truthful?\"",
    "translation_id": "Dan mereka bertanya: \"Bilakah kemenangan itu (datang) jika kamu memang orang-orang yang benar?\""
  }, {
    "number": 29,
    "text": "قُلْ يَوْمَ ٱلْفَتْحِ لَا يَنفَعُ ٱلَّذِينَ كَفَرُوٓا۟ إِيمَٰنُهُمْ وَلَا هُمْ يُنظَرُونَ",
    "translation_en": "Say, [O Muhammad], \"On the Day of Conquest the belief of those who had disbelieved will not benefit them, nor will they be reprieved.\"",
    "translation_id": "Katakanlah: \"Pada hari kemenangan itu tidak berguna bagi orang-orang kafir, iman mereka dan tidak pula mereka diberi tangguh\"."
  }, {
    "number": 30,
    "text": "فَأَعْرِضْ عَنْهُمْ وَٱنتَظِرْ إِنَّهُم مُّنتَظِرُونَ",
    "translation_en": "So turn away from them and wait. Indeed, they are waiting.",
    "translation_id": "Maka berpalinglah kamu dari mereka dan tunggulah, sesungguhnya mereka (juga) menunggu."
  }],
  "tafsir": {
    "id": {
      "kemenag": {
        "name": "Kemenag",
        "source": "Aplikasi Quran Kementrian Agama Republik Indonesia",
        "text": {
          "1": "Lihat Tafsir Alif Lam Mim pada Surah al-Baqarah/2: 1 (Jilid I).",
          "2": "Ayat ini menerangkan bahwa Al-Qur'an yang diturunkan kepada Muhammad ini benar-benar wahyu dari Allah, Tuhan semesta alam. Al- Qur'an ini bukanlah buatan tukang sihir, bukan mantra-mantra tukang tenung, dan bukan pula buatan Muhammad, tidak ada keraguan padanya sedikit pun.\n\nAyat ini merupakan bantahan bagi dakwaan orang-orang kafir yang menyatakan bahwa Al-Qur'an ini adalah syair yang digubah oleh penyair, dan ada yang mengatakan gubahan tukang tenung. Ada juga yang mengatakan bahwa Al-Qur'an itu hanyalah dongengan-dongengan purbakala saja, serta ada pula yang mengatakan bahwa dia adalah buatan Muhammad.\n\nAllah berfirman:\n\nDan mereka berkata, \"(Itu hanya) dongeng-dongeng orang-orang terdahulu, yang diminta agar dituliskan, lalu dibacakanlah dongeng itu kepadanya setiap pagi dan petang.\" (al-Furqan/25: 5)",
          "3": "Ayat ini menerangkan bahwa sikap orang-orang musyrik seperti yang diterangkan ayat di atas adalah sikap yang tidak layak. Tidak pantas mereka menuduh Muhammad telah melakukan kedustaan dengan mengatakan bahwa ia telah membuat-buat Al-Qur'an, padahal mereka benar-benar telah mengetahui keadaan Muhammad, sejak ia masih kecil sampai ia dewasa dan diangkat menjadi rasul. Bahkan mereka memberi gelar dengan \"Al-Amin\" (orang kepercayaan) karena mereka sangat percaya kepada Muhammad. Akan tetapi, tiba-tiba mereka menuduhnya sebagai pendusta.\n\nOleh karena itu, Allah menegaskan bahwa semua yang disampaikan Muhammad itu adalah benar. Al-Qur'an benar-benar berasal dari Allah dan diturunkan kepadanya untuk memperingatkan orang-orang musyrik pada azab akhirat yang akan ditimpakan kepada orang-orang yang mengingkari rasul yang diutus kepada mereka. Al-Qur'an berisi pelajaran dan petunjuk yang mengantar mereka menuju jalan kebahagiaan abadi.\n\nPada ayat yang lain dinyatakan pula sikap orang-orang musyrik itu terhadap Al-Qur'an. Allah berfirman:\n\nDan orang-orang kafir berkata, \"(Al-Qur'an) ini tidak lain hanyalah kebohongan yang diada-adakan oleh dia (Muhammad), dibantu oleh orang-orang lain,\" Sungguh, mereka telah berbuat zalim dan dusta yang besar. (al-Furqan/25: 4)",
          "4": "Ayat ini menerangkan bahwa Tuhan yang telah menurunkan Al-Qur'an kepada Muhammad saw itu adalah Tuhan Pencipta langit dan bumi dan segala sesuatu yang ada di antara keduanya dalam enam masa. Maksud enam masa dalam ayat ini bukanlah hari (masa) yang dikenal seperti sekarang ini, tetapi adalah hari sebelum adanya langit dan bumi. Hari pada waktu sekarang ini adalah setelah adanya langit dan bumi, serta setelah adanya peredaran bumi mengelilingi matahari dan sebagainya.\n\nSetelah menciptakan langit dan bumi, Allah pun bersemayam di atas 'Arasy, sesuai dengan kekuasaan dan kebesaran-Nya. (lihat al-A'raf/7: 54) Allah menegaskan bahwa tidak seorang pun yang dapat mengurus segala urusannya, menolak bahaya, malapetaka, dan siksa. Tidak seorang pun yang dapat memberi syafaat ketika azab menimpanya, kecuali Allah semata, karena Dialah Yang Mahakuasa menentukan segala sesuatu.\n\nKemudian Allah memperingatkan, \"Apakah kamu hai manusia tidak dapat mengambil pelajaran dan memikirkan apa yang selalu kamu lihat itu? Kenapa kamu masih juga menyembah selain Allah?\"",
          "5": "Hanya Allah-lah yang mengurus, mengatur, mengadakan, dan melenyapkan segala yang ada di dunia ini. Segala yang terjadi itu adalah sesuai dengan kehendak dan ketetapan-Nya, tidak ada sesuatu pun yang menyimpang dari kehendak-Nya itu. Pengaturan Allah dimulai dari langit hingga sampai ke bumi, kemudian urusan itu naik kembali kepada-Nya.\n\nSemua yang tersebut pada ayat ini merupakan gambaran dari kebesaran dan kekuasaan Allah, agar manusia mudah memahaminya. Kemudian Dia menggambarkan pula waktu yang digunakan Allah mengurus, mengatur, dan menyelesaikan segala urusan alam semesta ini, yaitu selama sehari. Akan tetapi, ukuran sehari itu sama lamanya dengan 1000 tahun dari ukuran tahun yang dikenal manusia di dunia ini.\n\nPerkataan seribu tahun dalam bahasa Arab tidak selamanya berarti 1000 dalam arti sebenarnya, tetapi kadang-kadang digunakan untuk menerangkan banyaknya sesuatu jumlah atau lamanya waktu yang diperlukan. Dalam ayat ini bilangan seribu itu digunakan untuk menyatakan lamanya waktu kehidupan alam semesta ini sejak diciptakan Allah pertama kali sampai kehancurannya di hari Kiamat, kemudian kembalinya segala urusan ke tangan Allah, yaitu hari berhisab. Semua itu menempuh waktu yang lama sekali, sehingga sukar bagi manusia menghitungnya.\n\nDalam ayat yang lain digunakan perkataan ribuan itu untuk menerangkan lamanya waktu yang dibutuhkan seandainya manusia ingin naik menghadap Allah, sekalipun para malaikat hanya perlu sehari saja. Allah berfirman:\n\nPara malaikat dan Jibril naik (menghadap) kepada Tuhan, dalam sehari setara dengan lima puluh ribu tahun. (al-Ma'arij/70: 4)\n\nAda pula yang berpendapat bahwa maksud ayat ini ialah segala urusan dunia ini kembali kepada Allah di hari Kiamat dalam waktu satu hari, yang sama lamanya dengan 1000 tahun waktu di dunia ini. Sebagian mufasir menafsirkan ayat ini, \"Para malaikat naik kepada Allah ke langit dalam satu hari. Jika jarak itu ditempuh oleh selain malaikat, maka ia memerlukan waktu 1000 tahun.\"\n\nRasulullah saw dalam malam mi'raj pernah naik ke langit bersama malaikat Jibril menghadap Allah. Jarak itu ditempuh dalam waktu kurang lebih setengah malam.",
          "6": "Ayat ini menerangkan bahwa Tuhan yang menciptakan, mengatur, dan mengurus langit dan bumi serta segala yang ada padanya itu adalah Tuhan Yang Maha Mengetahui. Dia Maha Mengetahui segala yang gaib, yang tersembunyi dalam hati, yang akan terjadi, dan yang telah terjadi. Dia juga Maha Mengetahui segala yang dapat dilihat dan yang tidak dapat dilihat oleh mata. Dialah Tuhan Yang Mahakuasa, Mahakekal Rahmat-Nya dan Dia pulalah Yang menciptakan seluruh makhluk dengan bentuk yang baik, serasi serta dengan faedah dan kegunaan yang hanya Dia saja yang mengetahuinya.\n\nJika diperhatikan seluruh makhluk yang ada di alam ini sejak dari yang besar sampai kepada yang sekecil-kecilnya akan timbul dugaan bahwa di antara makhluk itu ada yang besar faedahnya dan ada pula yang dirasa tidak berfaedah atau tidak berguna sama sekali, bahkan dapat menimbulkan bahaya bagi manusia, seperti ular berbisa, hama-hama penyakit menular, tanaman yang mengandung racun, dan sebagainya. Dugaan ini akan timbul jika masing-masing makhluk itu dilihat secara terpisah, tidak dalam satu kesatuan alam semesta ini.\n\nJika makhluk-makhluk itu dilihat dalam satu kesatuan alam semesta, dimana antara yang satu dengan yang lain mempunyai hubungan erat, akan terlihat bahwa semua makhluk itu ada faedah dan kegunaannya dalam menjaga keseimbangan dan kelestarian alam ini. Bahkan terlihat dengan nyata bahwa usaha-usaha sebagian manusia, baik secara sengaja atau tidak, merusak dan membunuh sebagian makhluk hidup, menimbulkan pencemar-an di alam ini, sehingga kelestariannya terganggu. Salah satu contoh ialah dengan adanya obat pembasmi hama, banyak cacing dan bakteri yang musnah. Akibatnya, proses pembusukan sampah menjadi terganggu. Padahal bakteri dan cacing itu dianggap binatang yang tidak ada gunanya sama sekali. Penebangan hutan mengakibatkan tanah menjadi gundul, sehingga banyak terjadi banjir dan tanah longsor di musim hujan, serta kekeringan pada musim kemarau. \n\nSemua itu akibat keserakahan manusia. Hal itu bisa dikategorikan sebagai perbuatan merusak di bumi. Akibat yang ditimbulkannya bisa luas dan memberi efek domino (beruntun).\n\nBerdasarkan paparan di atas nyatalah bahwa segala sesuatu yang diciptakan Allah, ada faedahnya, tetapi banyak manusia yang tidak mau memperhatikannya.\n\nKemudian ayat ini menerangkan bahwa Dia menciptakan manusia dari tanah. Maksudnya ialah Allah menciptakan Adam dari tanah kemudian menciptakan anak cucu Adam dari sari pati tanah yang diperoleh oleh ayah dan ibu dari makanan berupa hewan dan tumbuh-tumbuhan yang semuanya berasal dari tanah.\n\nDalam ayat 7 dinyatakan bahwa manusia diciptakan dari tanah, tetapi pada ayat ini ditegaskan bahwa hanya pada permulaannya saja manusia diciptakan dari tanah. Dengan ayat ini dapat pula ditafsirkan bahwa ada fase lain setelah awal penciptaan sebelum ciptaan tersebut menjadi manusia. Jika hal tersebut memang terjadi demikian, banyak pertanyaan lain yang masih tersisa, antara lain (1) apakah awal penciptaan manusia sama dan bersamaan dengan awal penciptaan makhluk hidup bumi lainnya (lihat tafsir Surah al- An'am ayat 2), (2) apakah fase setelah penciptaan awal tersebut manusia berkembang melalui bentuk antara seperti halnya proses evolusi makhluk hidup lainnya yang kini banyak dipercayai (lihat Surah ar-Rum/30 ayat 20), atau (3) manusia tercipta melalui proses khusus yang berbeda dari makhluk hidup lainnya (al-Ahzab/33 ayat 33).",
          "7": "Ayat ini menerangkan bahwa Tuhan yang menciptakan, mengatur, dan mengurus langit dan bumi serta segala yang ada padanya itu adalah Tuhan Yang Maha Mengetahui. Dia Maha Mengetahui segala yang gaib, yang tersembunyi dalam hati, yang akan terjadi, dan yang telah terjadi. Dia juga Maha Mengetahui segala yang dapat dilihat dan yang tidak dapat dilihat oleh mata. Dialah Tuhan Yang Mahakuasa, Mahakekal Rahmat-Nya dan Dia pulalah Yang menciptakan seluruh makhluk dengan bentuk yang baik, serasi serta dengan faedah dan kegunaan yang hanya Dia saja yang mengetahuinya.\n\nJika diperhatikan seluruh makhluk yang ada di alam ini sejak dari yang besar sampai kepada yang sekecil-kecilnya akan timbul dugaan bahwa di antara makhluk itu ada yang besar faedahnya dan ada pula yang dirasa tidak berfaedah atau tidak berguna sama sekali, bahkan dapat menimbulkan bahaya bagi manusia, seperti ular berbisa, hama-hama penyakit menular, tanaman yang mengandung racun, dan sebagainya. Dugaan ini akan timbul jika masing-masing makhluk itu dilihat secara terpisah, tidak dalam satu kesatuan alam semesta ini.\n\nJika makhluk-makhluk itu dilihat dalam satu kesatuan alam semesta, dimana antara yang satu dengan yang lain mempunyai hubungan erat, akan terlihat bahwa semua makhluk itu ada faedah dan kegunaannya dalam menjaga keseimbangan dan kelestarian alam ini. Bahkan terlihat dengan nyata bahwa usaha-usaha sebagian manusia, baik secara sengaja atau tidak, merusak dan membunuh sebagian makhluk hidup, menimbulkan pencemar-an di alam ini, sehingga kelestariannya terganggu. Salah satu contoh ialah dengan adanya obat pembasmi hama, banyak cacing dan bakteri yang musnah. Akibatnya, proses pembusukan sampah menjadi terganggu. Padahal bakteri dan cacing itu dianggap binatang yang tidak ada gunanya sama sekali. Penebangan hutan mengakibatkan tanah menjadi gundul, sehingga banyak terjadi banjir dan tanah longsor di musim hujan, serta kekeringan pada musim kemarau. \n\nSemua itu akibat keserakahan manusia. Hal itu bisa dikategorikan sebagai perbuatan merusak di bumi. Akibat yang ditimbulkannya bisa luas dan memberi efek domino (beruntun).\n\nBerdasarkan paparan di atas nyatalah bahwa segala sesuatu yang diciptakan Allah, ada faedahnya, tetapi banyak manusia yang tidak mau memperhatikannya.\n\nKemudian ayat ini menerangkan bahwa Dia menciptakan manusia dari tanah. Maksudnya ialah Allah menciptakan Adam dari tanah kemudian menciptakan anak cucu Adam dari sari pati tanah yang diperoleh oleh ayah dan ibu dari makanan berupa hewan dan tumbuh-tumbuhan yang semuanya berasal dari tanah.\n\nDalam ayat 7 dinyatakan bahwa manusia diciptakan dari tanah, tetapi pada ayat ini ditegaskan bahwa hanya pada permulaannya saja manusia diciptakan dari tanah. Dengan ayat ini dapat pula ditafsirkan bahwa ada fase lain setelah awal penciptaan sebelum ciptaan tersebut menjadi manusia. Jika hal tersebut memang terjadi demikian, banyak pertanyaan lain yang masih tersisa, antara lain (1) apakah awal penciptaan manusia sama dan bersamaan dengan awal penciptaan makhluk hidup bumi lainnya (lihat tafsir Surah al- An'am ayat 2), (2) apakah fase setelah penciptaan awal tersebut manusia berkembang melalui bentuk antara seperti halnya proses evolusi makhluk hidup lainnya yang kini banyak dipercayai (lihat Surah ar-Rum/30 ayat 20), atau (3) manusia tercipta melalui proses khusus yang berbeda dari makhluk hidup lainnya (al-Ahzab/33 ayat 33).",
          "8": "Ayat ini menerangkan bahwa Allah menciptakan keturunan manusia dari sperma, yaitu air yang sedikit dan memancar, yang bertemu dengan sel telur. Hasil pertemuan ini disebut dengan nuthfah.",
          "9": "Kemudian di dalam rahim perempuan, Allah menyempurnakan kejadian nuthfah itu, sehingga berbentuk manusia. Kemudian ditiupkan roh ke dalamnya. Dengan demikian bergeraklah janin yang kecil itu. Setelah nyata kepadanya tanda-tanda kehidupan, Allah menganugerahkan kepadanya pen-dengaran, penglihatan, akal, perasaan, dan sebagainya.\n\nManusia pada permulaan hidupnya di dalam rahim ibu, sekalipun telah dianugerahi mata, telinga, dan otak, tetapi ia belum dapat melihat, mendengar, dan berpikir. Hal itu baru diperolehnya setelah ia lahir, dan semakin lama panca inderanya itu dapat berfungsi dengan sempurna.\n\nPada akhir ayat ini, Allah mengatakan bahwa hanya sedikit manusia yang mau mensyukuri nikmat Allah yang telah dilimpahkan kepadanya.",
          "10": "Ayat ini menerangkan tentang pertanyaan orang-orang musyrik kepada Rasulullah saw, yang menunjukkan keingkaran dan kesombongan mereka. Mereka berkata, \"Apakah apabila daging dan tulang belulang kami telah hancur menjadi tanah, mungkinkah kami dihidupkan lagi seperti semula?\"\n\nDari pertanyaan di atas tergambar bahwa menurut mereka mustahil manusia dapat hidup kembali setelah mati dan tubuhnya hancur menjadi tanah. Mereka tidak dapat menggambarkan dalam pikirannya bagaimana besarnya kekuasaan Allah. Jika mereka ingin mencapai kebenaran, mereka dapat mencari bukti-bukti kekuasaan dan kebesaran Allah pada penciptaan manusia. Mereka dahulu tidak ada, kemudian menjadi ada. Tentu menciptakan kembali yang pernah ada lebih mudah bagi Allah. Sebenarnya jika mereka mau berpikir tentu mereka sampai kepada kesimpulan bahwa segala sesuatu itu adalah sama mudahnya bagi Allah, tidak ada yang sukar bagi-Nya.\n\nOrang-orang musyrik itu bukan hanya mengingkari kekuasaan Allah, tetapi juga mengingkari adanya hari kebangkitan, yaitu hari semua manusia dihadapkan di Mahkamah Agung Ilahiah.",
          "11": "Ayat ini menolak anggapan orang-orang musyrik yang menyatakan bahwa hari Kiamat itu tidak ada. Dalam ayat ini dikatakan, \"Hai orang-orang musyrik, sesungguhnya malaikat yang bertugas mencabut nyawa manusia, benar-benar menjaga waktu, maka mereka mencabut nyawa orang itu tepat pada waktunya, tidak mundur sesaat pun, dan tidak pula dipercepat walau sesaat.\" Hal ini berlaku bagi semua orang-orang musyrik itu, dan mereka tidak dapat lari dari ketetapan Allah ini. Kemudian mereka dibangkitkan kembali di hari Kiamat dan diminta pertanggungjawaban semua perbuatannya dengan adil.",
          "12": "Allah memberitahukan kepada Rasul-Nya bahwa ia akan merasa ngeri jika melihat keadaan orang-orang yang mengingkari hari Kiamat ketika mereka menundukkan kepala di hadapan Allah karena malu dan takut atas segala tindakan dan perbuatan mereka dalam hidup di dunia. Mereka menyatakan kepada Allah bahwa mereka telah melihat kenyataan hari Kiamat itu benar-benar terjadi, dan telah merasakan pula malapetaka yang menimpa mereka pada hari itu. Mereka kemudian memohon agar diberi kesempatan untuk kembali ke dunia sehingga dapat mengikuti semua petunjuk rasul. Ketika itu, mereka mengaku benar-benar telah meyakini apa yang dahulu mereka dustakan. Mereka juga mengakui bahwa hanya Allah yang berhak disembah, yang menghidupkan dan mematikan, serta yang membangkitkan kembali, seperti saat itu.\n\nDalam ayat lain, Allah berfirman:\n\nDan seandainya engkau (Muhammad) melihat ketika mereka dihadapkan ke neraka, mereka berkata, \"Seandainya kami dikembalikan (ke dunia), tentu kami tidak akan mendustakan ayat-ayat Tuhan kami, serta menjadi orang-orang yang beriman.\" (al-An'am/6: 27)",
          "13": "Jika Allah menghendaki semua manusia mendapat taufik dan hidayah untuk beriman dan beramal saleh, tentu hal itu tidak sukar bagi-Nya. Akan tetapi, hal itu tidak sesuai dengan sunatullah yang dahulu berlaku di alam ini. Aturan dan hukum Allah yang berlaku di alam ini adalah aturan dan hukum yang paling sempurna. Menurut aturan dan hukum itu ialah menempatkan segala sesuatu di tempatnya, seperti menempatkan mata, telinga, hati, tangan, kaki, dan sebagainya berada di tempat yang layak dan wajar, sesuai dengan keindahan dan fungsinya. Di antara sunatullah itu ialah Allah akan mengisi neraka Jahanam dengan jin dan manusia yang layak bertempat tinggal di sana dan menjadi penghuninya, sebagaimana Dia akan memenuhi surga dengan orang-orang yang layak pula bertempat tinggal di sana.\n\nJika manusia memperhatikan sunatullah yang berlaku di alam ini, akan tampak suatu keserasian dan kerapian di dalamnya. Ikan yang hidup di dalam air mempunyai sirip, insang, dan berdarah dingin. Demikian pula lalat, ular, burung, dan sebagainya. Jika mata memandang ke cakrawala luas, maka di dalamnya terdapat pula sunatullah yang juga sangat rapi, sehingga planet-planet itu tidak berbenturan antara yang satu dengan yang lain.",
          "14": "Karena orang-orang musyrik mendustakan hari Kiamat, dan memandangnya sebagai suatu hal yang mustahil terjadi, serta meyakini bahwa mereka tidak akan bertemu dengan Tuhan pada hari Kiamat, mereka merasakan azab yang ditimpakan itu. Pada waktu pintu tobat telah tertutup, Allah menyatakan bahwa Ia tidak akan memperhatikan lagi permintaan mereka.\n\nPada akhir ayat ini, Allah menyebutkan bentuk azab yang ditimpakan kepada orang-orang kafir adalah azab yang kekal di dalam neraka, akibat tindakan dan perbuatan mereka itu.",
          "15": "Ayat ini menerangkan bahwa orang-orang yang beriman kepada ayat-ayat Al-Qur'an dan mengakui bahwa Muhammad itu adalah rasul Allah adalah orang-orang yang apabila diperingatkan kepada mereka ayat-ayat Allah dan dibacakan di hadapan mereka, mereka lalu bersujud kepada-Nya. Mereka juga bertasbih memuji-Nya seraya membaca, \"Subhanallahi wa bihamdihi, subhanallahil 'adhim.\" Sujud yang demikian dinamakan sujud tilawah. Hukumnya sunah, baik dalam salat maupun di luar salat.\n\nTindakan mereka itu adalah tanda ketaatan dan ketundukan mereka. Hal itu juga sebagai tanda bahwa mereka benar-benar menghayati ajaran dan petunjuk ayat-ayat yang dibacakan kepada mereka. Tidak sedikit pun terdapat sikap angkuh dan sombong dalam menghambakan diri kepada Allah. Mereka juga senang dan khusyuk dalam beribadah.",
          "16": "Pada ayat ini, Allah menerangkan tanda-tanda lain lagi bagi orang-orang yang beriman. Di antaranya adalah mereka mengurangi tidur, dan sering bangun di pertengahan malam untuk melakukan salat dan berdoa kepada Allah agar dihindarkan dari siksaan-Nya. Mereka juga menginfakkan sebagian dari rezeki yang telah mereka peroleh dari Allah.\n\nBanyak ayat-ayat Al-Qur'an dan hadis-hadis Nabi saw yang menerangkan keutamaan dan manfaat salat malam, terutama untuk mendekatkan diri kepada Allah untuk menambah kekuatan iman di dalam dada.\n\nSalat Tahajud dapat mengangkat manusia ke tempat yang terpuji, sebagaimana Allah berfirman:\n\nDan pada sebagian malam, lakukanlah salat Tahajud (sebagai suatu ibadah) tambahan bagimu: mudah-mudahan Tuhanmu mengangkatmu ke tempat yang terpuji. (al-Isra'/17: 79)\n\nPada ayat yang lain, Allah menerangkan bahwa salat dan membaca Al- Qur'an di malam hari dapat menguatkan jiwa. Dengan demikian, jiwa itu akan dapat menerima kewajiban yang lebih berat dan besar dari Allah, sebagaimana disebutkan dalam firman-Nya:\n\nWahai orang yang berselimut (Muhammad)! Bangunlah (untuk salat) pada malam hari, kecuali sebagian kecil, (yaitu) separuhnya atau kurang sedikit dari itu, atau lebih dari (seperdua) itu, dan bacalah Al-Qur'an itu dengan perlahan-lahan. Sesungguhnya Kami akan menurunkan perkataan yang berat kepadamu. Sungguh, bangun malam itu lebih kuat (mengisi jiwa); dan (bacaan pada waktu itu) lebih berkesan. (al-Muzzammil/73: 1-6)\n\nDiriwayatkan oleh at-Tirmidzi, Ibnu Majah, Ahmad, Abu Dawud, dan ath-thabrani bahwa Mu'adz bin Jabal bertanya kepada Rasulullah saw:\n\nYa Rasulullah, beritahukanlah kepadaku perbuatan yang dapat memasukkan aku ke dalam surga dan menjauhkan aku dari api neraka. Rasulullah bersabda, \"Sesungguhnya engkau benar-benar telah menanyakan sesuatu yang besar, sesungguhnya perbuatan itu mudah dilakukan oleh orang yang dimudahkan Allah baginya, Engkau menyembah Allah, tidak menyekutukan Nya dengan sesuatupun, mendirikan salat, menunaikan zakat, puasa pada bulan Ramadhan, berhaji ke Baitullah.\" Kemudian Rasulullah meneruskan sabdanya, \"Maukah engkau aku tunjukkan kepadamu pintu-pintu kebaikan? Puasa itu adalah perisai, sedekah menghapuskan kesalahan seperti air memadamkan api, dan salat pada pertengahan malam.\" Kemudian beliau membaca Tatajafa . . . sampai akhir ayat. (Riwayat at-Tirmidzi, Ibnu Majah, Ahmad, Abu Dawud, dan ath-thabrani)\n\nDiriwayatkan oleh Ibnu Jarir ath-thabari dari Ibnu 'Abbas, beliau berkata, \"Maksud \"lambung mereka jauh dari tempat tidur mereka\" ialah beribadah kepada Allah, zikir, salat, berdiri, duduk atau berbaring, mereka selalu mengingat Allah.\"",
          "17": "Ayat ini menerangkan bahwa seseorang tidak dapat mengetahui betapa besar kebahagiaan dan kesenangan yang akan diberikan Allah kepadanya di akhirat nanti, dan betapa enak dan nyamannya tinggal di dalam surga itu. Semua itu adalah balasan perbuatan baik yang telah dikerjakan selama hidup di dunia.\n\nDiriwayatkan oleh al-Bukhari dan Muslim dan imam-imam hadis yang lain dari Abu Hurairah, Rasulullah saw bersabda: \n\nAllah berfirman, \"Aku telah menyediakan untuk hamba-hamba-Ku yang saleh apa yang belum pernah mata melihatnya, belum pernah telinga mendengarnya dan belum pernah tergores di dalam hati manusia, kecuali apa yang telah Aku kemukakan kepadamu. Bacalah, jika kamu menghendakinya \"Fala talamu nafs . . . sampai akhir.\"\n\nDiriwayatkan oleh al-Firyabi, Ibnu Abi Syaibah, Ibnu Jarir ath-thabari, ath-thabrani, al-hakim dan dinyatakan sebagai hadis sahih dari Ibnu Mas'ud, ia berkata, \"Sesungguhnya termaktub dalam Taurat bahwa Allah menjanjikan kepada orang-orang yang jauh lambung mereka dari tempat tidurnya, apa yang belum dilihat mata, belum didengar telinga, belum tergores dalam hati manusia. Malaikat yang dekat kepada Tuhan tidak mengetahuinya demikian pula para rasul yang diutusnya. Sesungguhnya itu terdapat pula di dalam Al-Qur'an, sebagaimana tersebut dalam ayat ini.\"",
          "18": "Pada ayat ini diterangkan bahwa setelah menerangkan sifat-sifat orang kafir dan sifat-sifat orang-orang mukmin, Allah menyuruh membandingkan kedua sifat itu, apakah orang-orang yang mendustakan ayat-ayat Allah, tidak percaya kepada janji dan ancaman-Nya, mengingkari perintah-perintah dan larangan-larangan-Nya itu sama dengan orang-orang yang mengikuti ayat-ayat Allah, mengakui kebenaran janji dan ancaman-Nya mengikuti perintah-perintah-Nya dan menghentikan larangan-larangan-Nya? Allah menegaskan bahwa kedua golongan itu sama sekali tidak sama, amat besar perbedaannya di sisi-Nya. Orang yang tidak berpengetahuan dan tidak mempunyai pandangan yang tajam saja dapat membedakan kedua macam golongan itu. Firman Allah yang lain yang sama isinya dengan ayat ini, ialah:\n\nApakah orang-orang yang melakukan kejahatan itu mengira bahwa Kami akan memperlakukan mereka seperti orang-orang yang beriman dan yang mengerjakan kebajikan, yaitu sama dalam kehidupan dan kematian mereka? Alangkah buruknya penilaian mereka itu. (al-Jasiyah/45: 21) \n\nFirman Allah:\n\nPantaskah Kami memperlakukan orang-orang yang beriman dan mengerjakan kebajikan sama dengan orang-orang yang berbuat kerusakan di bumi? Atau pantaskah Kami menganggap orang-orang yang bertakwa sama dengan orang-orang yang jahat? (sad/38: 28)",
          "19": "Pada ayat ini dijelaskan perbedaan kedua golongan itu dan perbedaan keadaan mereka di akhirat nanti. Orang-orang yang beriman kepada Allah dan rasul-Nya, serta mengerjakan amal saleh akan diberi ganjaran pahala yang berlipat ganda di akhirat nanti. Mereka akan tinggal di rumah-rumah yang megah dengan taman-taman yang indah, sebagai balasan keimanan dan amal saleh yang mereka perbuat selama hidup di dunia. Firman Allah:\n\nNiscaya Allah mengampuni dosa-dosamu dan memasukkan kamu ke dalam surga yang mengalir di bawahnya sungai-sungai, dan ke tempat-tempat tinggal yang baik di dalam surga 'Adn. Itulah kemenangan yang agung. (ash-saff/61: 12)",
          "20": "Adapun orang-orang yang kafir, mengingkari Allah dan rasul-Nya, serta mengerjakan perbuatan-perbuatan jahat akan dibalas dengan azab neraka di akhirat nanti. Setiap mereka mendekati pintu neraka untuk keluar, mereka dikembalikan ke dalamnya lagi.\n\nJika neraka itu diibaratkan dengan kawah atau kepundan gunung berapi, maka orang-orang kafir berada di dalamnya. Nyala api dari kawah itu sedemikian berbahaya dan setiap saat menyemburkan bunga api. Dalam gambaran itu terbawa pula orang-orang kafir yang sedang diazab, mereka terlempar ke mulut kawah itu, kemudian mereka dibenamkan lagi ke dasarnya, sehingga tidak mempunyai kesempatan sedikit pun untuk keluar dari neraka itu. Di saat mereka dibenamkan kembali ke dalam neraka, kepada mereka dikatakan, \"Rasakanlah olehmu azab neraka yang dahulu kamu tidak mempercayainya sedikit pun sewaktu hidup di dunia.\"",
          "21": "Pada ayat ini, Allah menerangkan bahwa sebenarnya orang-orang kafir itu sewaktu masih hidup di dunia telah diazab oleh Allah dengan berbagai macam azab, baik yang tampak maupun yang hanya dapat dirasakan oleh mereka. Siksaan bagi mereka di dunia disebut dengan al-'adzab al-adna (azab yang dekat), sedangkan siksaan di akhirat disebut al-'adzab al-akbar (azab yang lebih besar).\n\nBanyak cobaan-cobaan yang diberikan Allah kepada manusia selama hidup di dunia, sejak dari cobaan yang kecil sampai kepada cobaan yang paling besar. Bisa juga dalam bentuk kemewahan lahiriah sampai kepada kemiskinan dan kesengsaraan. Seorang yang kaya tetapi tidak dilandasi dengan iman kepada Allah, hatinya selalu was-was dan khawatir, mungkin ada orang yang akan merampas kekayaannya itu, atau ada ahli waris yang hendak membunuhnya agar memperoleh kekayaan itu.\n\nSeorang penguasa yang tidak beriman selalu khawatir kekuasaannya akan pindah kepada orang lain. Kalau perlu, kekuasaan itu dipertahankan dengan tangan besi dan kekerasan. Kekhawatiran seperti ini pernah terjadi pada Fir'aun di kala tukang-tukang sihirnya dikalahkan oleh Nabi Musa.\n\nAllah berfirman:\n\nDia (Fir'aun) berkata, \"Apakah kamu telah beriman kepadanya (Musa) sebelum aku memberi izin kepadamu? Sesungguhnya dia itu pemimpinmu yang mengajarkan sihir kepadamu. Maka sungguh, akan kupotong tangan dan kakimu secara bersilang, dan sungguh, akan aku salib kamu pada pangkal pohon kurma dan sungguh, kamu pasti akan mengetahui siapa di antara kita yang lebih pedih dan lebih kekal siksaannya.\" (thaha/20: 71)\n\nBanyak penguasa-penguasa yang bersikap seperti Fir'aun ini. Mereka mengira bahwa merekalah yang memiliki semuanya dan merekalah yang paling berkuasa.\n\nSebenarnya Allah memberikan cobaan-cobaan dari azab duniawi itu agar semuanya menjadi pelajaran bagi orang-orang kafir itu. Hal ini bertujuan agar mereka mau beriman, beramal saleh, dan mudah-mudahan kembali ke jalan yang benar. Biarlah mereka menanggung siksa yang ringan di dunia ini asal di akhirat nanti mereka terhindar dari siksa yang amat berat.",
          "22": "Allah menerangkan bahwa orang yang paling zalim di sisi-Nya ialah orang yang telah sampai kepadanya peringatan Allah, ayat-ayat Al-Qur'an, dan petunjuk rasul, tetapi mereka berpaling dari ajaran dan petunjuk itu karena angkuh dan penyakit dengki yang ada di dalam hatinya.\n\nPada akhir ayat ini ditegaskan bahwa Allah akan menyiksa dengan azab yang pedih setiap orang yang berbuat dosa dan maksiat.\n\nDiriwayatkan oleh Ibnu Jarir ath-thabari dari Mu'adz bin Jabal, ia berkata, \"Aku mendengar Rasulullah bersabda:\n\nTiga perkara, barang siapa yang mengerjakannya, maka sesungguhnya ia telah mengerjakan perbuatan dosa: barang siapa yang telah bertekad ikut berperang di jalan yang tidak benar atau mendurhakai kedua orang ibu bapaknya atau orang yang berjalan beserta orang-orang yang zalim lalu ia menolong orang yang zalim itu. Allah berfirman, \"Sesungguhnya Kami akan memberikan pembalasan kepada orang-orang yang berdosa.\" (Riwayat Ibnu Jarir ath-thabari dari Mu'adz bin Jabal)",
          "23": "Ayat ini menerangkan bahwa Allah telah menurunkan kitab Taurat kepada Nabi Musa sebagaimana Dia telah menurunkan Al-Qur'an kepada Nabi Muhammad. Namun demikian, wahyu yang diturunkan kepada Nabi Musa itu didustakan oleh kaumnya. Musa bersama pengikutnya disiksa oleh Fir'aun dan kaumnya, sehingga mereka lari ke daerah Palestina. Demikian pula Muhammad saw telah didustakan pula oleh kaumnya, disakiti, dan ditentang sehingga beliau dan para sahabatnya hijrah ke Medinah. Itulah sunatullah yang berlaku di alam ini, selalu terjadi pertarungan antara yang hak dengan yang batil, dan antara kebaikan dan kejahatan. Semua itu merupakan cobaan bagi orang-orang yang beriman.\n\nDalam ayat ini disebut-sebut nama Musa di antara para nabi dan rasul Allah adalah karena banyak persamaan perjuangannya dengan Nabi Muhammad.\n\nAyat ini diturunkan untuk hiburan bagi Nabi Muhammad dan para sahabat yang sedang menyampaikan agama Allah kepada manusia. Dalam menyampaikan risalah itu, dia mendapat ancaman dan penganiayaan dari kaumnya. Seakan-akan dikatakan kepada mereka, \"Hai Muhammad, janganlah kamu dan pengikut-pengikutmu bersedih hati menghadapi sikap dan tindakan orang-orang musyrik itu. Hal yang demikian itu adalah wajar dan merupakan sunatullah. Ingatlah Musa dan pengikut-pengikutnya. Mereka dianiaya dan diburu oleh Fir'aun dan kaumnya, sampai mereka lari menyeberangi Laut Merah, dan mengarungi padang pasir yang tandus dan panas. Dalam keadaan demikian, banyak pula di antara pengikut-pengikutnya yang berkhianat, tetapi ia tetap tabah dan sabar. Semakin kuat tantangan dan penganiayaan yang diterimanya, semakin kuat pula usaha dan kesabarannya. Aku pasti menyayangimu dan para pengikutmu sebagaimana Aku telah menjaga pula Musa dan para pengikutnya.\"",
          "24": "Ayat ini menerangkan bahwa Allah telah menjadikan di antara Bani Israil yang mengikuti petunjuk-petunjuk-Nya menjadi pemuka masyarakat. Di antara mereka ada yang diangkat menjadi nabi dan rasul yang menyampaikan petunjuk yang benar kepada kaumnya, dan ada pula di antara mereka yang dijadikan pemimpin bagi kaumnya menuju ke jalan yang benar. Hal itu diberikan karena mereka adalah orang-orang yang beriman dan sabar melaksanakan hukum-hukum Allah. Mereka juga sabar menerima setiap cobaan yang menimpa mereka, dan mereka yakin benar akan petunjuk Allah.\n\nAllah berfirman:\n\nDan Kami berikan kepada Musa Kitab (Taurat) dan Kami menjadikannya sebagai petunjuk bagi Bani Israil (dengan firman), \"Janganlah kamu mengambil (pelindung) selain Aku.\" (al-Isra'/17",
          "25": "Ayat ini menjelaskan bahwa sesungguhnya hanya Allah yang menyelesaikan dan memberi keputusan segala perselisihan dan pertentangan soal agama antara mereka di hari Kiamat. Allah akan memberikan balasan yang setimpal kepada orang-orang yang mengingkari seruan Nabi dan memberi pahala kepada orang-orang yang mengikutinya.\n\nSebagian ahli tafsir berpendapat bahwa yang menyelesaikan pertentangan soal agama adalah Nabi Muhammad. Ia memberikan keputusan dengan adil terhadap perselisihan para rasul dengan umatnya di hari Kiamat nanti.",
          "26": "Pada ayat ini, Allah memperingatkan orang-orang musyrik Mekah yang selalu menentang dan mengingkari seruan Nabi Muhammad. Apakah belum jelas bagi mereka jalan benar yang telah ditunjukkan kepada mereka. Apakah mereka lupa dan tidak memperhatikan akibat yang diterima umat-umat dahulu yang mendustakan para rasul yang diutus kepada mereka. Bukankah orang-orang musyrik Mekah sering melakukan perdagangan ke Syiria dan Yaman. Dalam perjalanan itu, mereka menyaksikan dan melihat bekas negeri kaum 'Ad, Samud, Lut, penduduk Aikah, dan sebagainya yang telah hancur akibat tindakan mereka yang mendustakan para rasul.\n\nAyat lain yang senada dengan ayat ini ialah firman Allah:\n\nMaka betapa banyak negeri yang telah Kami binasakan karena (penduduk)nya dalam keadaan zalim, sehingga runtuh bangunan-bangunannya dan (betapa banyak pula) sumur yang telah ditinggalkan dan istana yang tinggi (tidak ada penghuninya). (al-hajj/22: 45)\n\nFirman Allah lainnya:\n\nMaka itulah rumah-rumah mereka yang runtuh karena kezaliman mereka. Sungguh, pada yang demikian itu benar-benar terdapat tanda (kekuasaan Allah) bagi orang-orang yang mengetahui. (an-Naml/27: 52)\n\nAllah mengatakan bahwa sebenarnya pada bekas reruntuhan dan tempat kediaman orang-orang yang mendustakan dan mengingkari seruan rasul itu terdapat pelajaran bagi orang-orang yang mau mengambil pelajaran. Kejadian itu menunjukkan bahwa sunatullah berlaku bagi semua orang yang zalim.",
          "27": "Ayat ini mempertanyakan apakah orang-orang kafir itu buta, sehingga tidak dapat melihat bukti-bukti kebesaran dan kekuasaan Allah? Bukankah Allah yang menghalau awan ke tempat yang kering dan tandus serta tidak mempunyai tumbuh-tumbuhan? Awan itu berubah menjadi air hujan yang menyirami tanah itu sehingga memungkinkan manusia mengalirkannya ke tanah-tanah yang kering. Tanah itu lalu menjadi subur dan ditumbuhi oleh bermacam-macam tumbuh-tumbuhan dan tanam-tanaman. Sebagian tanaman itu dimakan oleh manusia dan sebagian lagi oleh binatang ternak piaraan mereka.\n\nApakah mereka tidak melihat bukti-bukti yang demikian itu sehingga mereka dapat mengakui kebesaran dan kekuasaan Allah dalam menghidupkan manusia yang telah mati dan membangkitkan mereka dari kuburnya? Jika mau memperhatikan, mereka tentu akan sampai kepada keyakinan bahwa Allah Mahakuasa, tidak ada yang sukar bagi-Nya. Jika Dia meng-hendaki, cukuplah Dia mengatakan \"kun\" (jadilah), maka jadilah yang dikehendaki-Nya itu.",
          "28": "Dalam ayat ini dijelaskan bahwa karena keyakinan kepada agama Islam yang mereka anut, kaum Muslimin sering mengatakan nanti Allah akan memberi kemenangan kepada mereka. Pada waktu itu akan diputuskan keputusan yang adil antara manusia, termasuk antara mereka dengan orang-orang kafir.\n\nOrang-orang kafir, terutama kaum musyrik Mekah, setelah mendengarkan ucapan-ucapan kaum Muslimin itu, menanyakan hal tersebut dengan maksud untuk mengejek dan memperolok-olokkan mereka. Orang-orang kafir itu mengatakan, \"Wahai kaum Muslimin, kamu sekalian selalu mengatakan bahwa kemenangan itu akan segera kamu peroleh, padahal kamu sekalian adalah orang-orang yang tak ada gunanya dan orang-orang rendah di antara kita. Mungkinkah dakwaan kamu terwujud? Jika benar apa yang kamu katakan itu, terangkanlah kepada kami kapan terjadinya?\"",
          "29": "Ayat ini menjelaskan bahwa Muhammad mengatakan kepada orang-orang musyrik Mekah itu, termasuk juga di dalamnya orang-orang kafir, bahwa hari kemenangan dan hari penyelesaian yang adil itu ialah hari Kiamat. Pada hari itu tidak bermanfaat lagi iman seseorang yang hanya diucapkan ketika itu, padahal waktu di dunia, dia adalah orang kafir. Mereka pada hari itu tidak diberi kesempatan untuk bertobat. Tidak memberi kesempatan bertobat kepada orang-orang kafir pada hari itu adalah wajar karena mereka selama hidup di dunia telah diberi peringatan oleh rasul yang diutus kepada mereka. Rasul itu telah menunjukkan jalan kebahagiaan yang abadi kepada mereka yang termuat di dalam Al-Qur'an dan hadis, tetapi mereka tetap ingkar dan membangkang.\n\nAllah akan menetapkan hukum di antara manusia dengan adil pada hari Kiamat. Orang-orang yang berbuat baik akan dibalas dengan pahala yang baik, sedangkan orang-orang yang berbuat buruk akan diazab dengan siksaan yang pedih. Hal ini sesuai dengan firman Allah:\n\n\"Ya Tuhan kami, berilah keputusan antara kami dan kaum kami dengan hak (adil). Engkaulah pemberi keputusan terbaik.\" (al-A'raf/7: 89)",
          "30": "Karena orang-orang musyrik tetap ingkar, bahkan telah mulai menantang dan menyakiti kaum Muslimin, maka Allah memerintahkan agar Rasulullah dan kaum Muslimin berpaling dari mereka, serta tidak mengindahkan mereka lagi. Rasulullah juga diperintahkan untuk menyeru seluruh manusia agar menerima wahyu yang telah disampaikan kepadanya, sesuai dengan tugas yang diterimanya dari Allah. Hendaklah orang-orang musyrik itu menunggu azab yang akan ditimpakan Allah kepada mereka baik di dunia maupun di akhirat, sebagai balasan perbuatan jahat yang telah mereka lakukan kepada Nabi saw dan seluruh kaum Muslimin. Allah benar-benar akan menepati janji-Nya.\n\nPada akhir ayat ini, Allah menerangkan bahwa Nabi Muhammad akan melihat akibat dari sikap kebesaran hatinya dan balasan dari usahanya menyampaikan risalah Allah. Dia akan menjaga dan memelihara Nabi saw dari segala macam bahaya yang datang dari kaum musyrik itu.\n\nMenurut suatu riwayat, setelah ayat ini, turunlah ayat-ayat yang membolehkan Rasulullah saw dan para sahabat memerangi orang-orang kafir."
        }
      }
    }
  }
}