{
  "name": "Al-Ahzab",
  "name_translations": {
    "ar": "الأحزاب",
    "en": "The Clans",
    "id": "Golongan Yang Bersekutu"
  },
  "number_of_ayah": 73,
  "number_of_surah": 33,
  "place": "Medina",
  "recitations": [{
    "name": "Mishari Rashid al-`Afasy",
    "audio_url": "https://download.quranicaudio.com/quran/mishaari_raashid_al_3afaasee/033.mp3"
  }, {
    "name": "Abdur-Rahman as-Sudais",
    "audio_url": "https://download.quranicaudio.com/quran/abdurrahmaan_as-sudays/033.mp3"
  }, {
    "name": "Saad al-Ghamdi",
    "audio_url": "https://download.quranicaudio.com/quran/sa3d_al-ghaamidi/complete/033.mp3"
  }],
  "type": "Madaniyah",
  "verses": [{
    "number": 1,
    "text": "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ يَٰٓأَيُّهَا ٱلنَّبِىُّ ٱتَّقِ ٱللَّهَ وَلَا تُطِعِ ٱلْكَٰفِرِينَ وَٱلْمُنَٰفِقِينَ إِنَّ ٱللَّهَ كَانَ عَلِيمًا حَكِيمًا",
    "translation_en": "O Prophet, fear Allah and do not obey the disbelievers and the hypocrites. Indeed, Allah is ever Knowing and Wise.",
    "translation_id": "Hai Nabi, bertakwalah kepada Allah dan janganlah kamu menuruti (keinginan) orang-orang kafir dan orang-orang munafik. Sesungguhnya Allah adalah Maha Mengetahui lagi Maha Bijaksana,"
  }, {
    "number": 2,
    "text": "وَٱتَّبِعْ مَا يُوحَىٰٓ إِلَيْكَ مِن رَّبِّكَ إِنَّ ٱللَّهَ كَانَ بِمَا تَعْمَلُونَ خَبِيرًا",
    "translation_en": "And follow that which is revealed to you from your Lord. Indeed Allah is ever, with what you do, Acquainted.",
    "translation_id": "dan ikutilah apa yang diwahyukan Tuhan kepadamu. Sesungguhnya Allah adalah Maha Mengetahui apa yang kamu kerjakan."
  }, {
    "number": 3,
    "text": "وَتَوَكَّلْ عَلَى ٱللَّهِ وَكَفَىٰ بِٱللَّهِ وَكِيلًا",
    "translation_en": "And rely upon Allah; and sufficient is Allah as Disposer of affairs.",
    "translation_id": "dan bertawakkallah kepada Allah. Dan cukuplah Allah sebagai Pemelihara."
  }, {
    "number": 4,
    "text": "مَّا جَعَلَ ٱللَّهُ لِرَجُلٍ مِّن قَلْبَيْنِ فِى جَوْفِهِۦ وَمَا جَعَلَ أَزْوَٰجَكُمُ ٱلَّٰٓـِٔى تُظَٰهِرُونَ مِنْهُنَّ أُمَّهَٰتِكُمْ وَمَا جَعَلَ أَدْعِيَآءَكُمْ أَبْنَآءَكُمْ ذَٰلِكُمْ قَوْلُكُم بِأَفْوَٰهِكُمْ وَٱللَّهُ يَقُولُ ٱلْحَقَّ وَهُوَ يَهْدِى ٱلسَّبِيلَ",
    "translation_en": "Allah has not made for a man two hearts in his interior. And He has not made your wives whom you declare unlawful your mothers. And he has not made your adopted sons your [true] sons. That is [merely] your saying by your mouths, but Allah says the truth, and He guides to the [right] way.",
    "translation_id": "Allah sekali-kali tidak menjadikan bagi seseorang dua buah hati dalam rongganya; dan Dia tidak menjadikan istri-istrimu yang kamu zhihar itu sebagai ibumu, dan Dia tidak menjadikan anak-anak angkatmu sebagai anak kandungmu (sendiri). Yang demikian itu hanyalah perkataanmu di mulutmu saja. Dan Allah mengatakan yang sebenarnya dan Dia menunjukkan jalan (yang benar)."
  }, {
    "number": 5,
    "text": "ٱدْعُوهُمْ لِءَابَآئِهِمْ هُوَ أَقْسَطُ عِندَ ٱللَّهِ فَإِن لَّمْ تَعْلَمُوٓا۟ ءَابَآءَهُمْ فَإِخْوَٰنُكُمْ فِى ٱلدِّينِ وَمَوَٰلِيكُمْ وَلَيْسَ عَلَيْكُمْ جُنَاحٌ فِيمَآ أَخْطَأْتُم بِهِۦ وَلَٰكِن مَّا تَعَمَّدَتْ قُلُوبُكُمْ وَكَانَ ٱللَّهُ غَفُورًا رَّحِيمًا",
    "translation_en": "Call them by [the names of] their fathers; it is more just in the sight of Allah. But if you do not know their fathers - then they are [still] your brothers in religion and those entrusted to you. And there is no blame upon you for that in which you have erred but [only for] what your hearts intended. And ever is Allah Forgiving and Merciful.",
    "translation_id": "Panggilah mereka (anak-anak angkat itu) dengan (memakai) nama bapak-bapak mereka; itulah yang lebih adil pada sisi Allah, dan jika kamu tidak mengetahui bapak-bapak mereka, maka (panggilah mereka sebagai) saudara-saudaramu seagama dan maula-maulamu. Dan tidak ada dosa atasmu terhadap apa yang kamu khilaf padanya, tetapi (yang ada dosanya) apa yang disengaja oleh hatimu. Dan adalah Allah Maha Pengampun lagi Maha Penyayang."
  }, {
    "number": 6,
    "text": "ٱلنَّبِىُّ أَوْلَىٰ بِٱلْمُؤْمِنِينَ مِنْ أَنفُسِهِمْ وَأَزْوَٰجُهُۥٓ أُمَّهَٰتُهُمْ وَأُو۟لُوا۟ ٱلْأَرْحَامِ بَعْضُهُمْ أَوْلَىٰ بِبَعْضٍ فِى كِتَٰبِ ٱللَّهِ مِنَ ٱلْمُؤْمِنِينَ وَٱلْمُهَٰجِرِينَ إِلَّآ أَن تَفْعَلُوٓا۟ إِلَىٰٓ أَوْلِيَآئِكُم مَّعْرُوفًا كَانَ ذَٰلِكَ فِى ٱلْكِتَٰبِ مَسْطُورًا",
    "translation_en": "The Prophet is more worthy of the believers than themselves, and his wives are [in the position of] their mothers. And those of [blood] relationship are more entitled [to inheritance] in the decree of Allah than the [other] believers and the emigrants, except that you may do to your close associates a kindness [through bequest]. That was in the Book inscribed.",
    "translation_id": "Nabi itu (hendaknya) lebih utama bagi orang-orang mukmin dari diri mereka sendiri dan isteri-isterinya adalah ibu-ibu mereka. Dan orang-orang yang mempunyai hubungan darah satu sama lain lebih berhak (waris-mewarisi) di dalam Kitab Allah daripada orang-orang mukmim dan orang-orang Muhajirin, kecuali kalau kamu berbuat baik kepada saudara-saudaramu (seagama). Adalah yang demikian itu telah tertulis di dalam Kitab (Allah)."
  }, {
    "number": 7,
    "text": "وَإِذْ أَخَذْنَا مِنَ ٱلنَّبِيِّۦنَ مِيثَٰقَهُمْ وَمِنكَ وَمِن نُّوحٍ وَإِبْرَٰهِيمَ وَمُوسَىٰ وَعِيسَى ٱبْنِ مَرْيَمَ وَأَخَذْنَا مِنْهُم مِّيثَٰقًا غَلِيظًا",
    "translation_en": "And [mention, O Muhammad], when We took from the prophets their covenant and from you and from Noah and Abraham and Moses and Jesus, the son of Mary; and We took from them a solemn covenant.",
    "translation_id": "Dan (ingatlah) ketika Kami mengambil perjanjian dari nabi-nabi dan dari kamu (sendiri) dari Nuh, Ibrahim, Musa dan Isa putra Maryam, dan Kami telah mengambil dari mereka perjanjian yang teguh."
  }, {
    "number": 8,
    "text": "لِّيَسْـَٔلَ ٱلصَّٰدِقِينَ عَن صِدْقِهِمْ وَأَعَدَّ لِلْكَٰفِرِينَ عَذَابًا أَلِيمًا",
    "translation_en": "That He may question the truthful about their truth. And He has prepared for the disbelievers a painful punishment.",
    "translation_id": "agar Dia menanyakan kepada orang-orang yang benar tentang kebenaran mereka dan Dia menyediakan bagi orang-orang kafir siksa yang pedih."
  }, {
    "number": 9,
    "text": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ ٱذْكُرُوا۟ نِعْمَةَ ٱللَّهِ عَلَيْكُمْ إِذْ جَآءَتْكُمْ جُنُودٌ فَأَرْسَلْنَا عَلَيْهِمْ رِيحًا وَجُنُودًا لَّمْ تَرَوْهَا وَكَانَ ٱللَّهُ بِمَا تَعْمَلُونَ بَصِيرًا",
    "translation_en": "O you who have believed, remember the favor of Allah upon you when armies came to [attack] you and We sent upon them a wind and armies [of angels] you did not see. And ever is Allah, of what you do, Seeing.",
    "translation_id": "Hai orang-orang yang beriman, ingatlah akan nikmat Allah (yang telah dikurniakan) kepadamu ketika datang kepadamu tentara-tentara, lalu Kami kirimkan kepada mereka angin topan dan tentara yang tidak dapat kamu melihatnya. Dan adalah Allah Maha Melihat akan apa yang kamu kerjakan."
  }, {
    "number": 10,
    "text": "إِذْ جَآءُوكُم مِّن فَوْقِكُمْ وَمِنْ أَسْفَلَ مِنكُمْ وَإِذْ زَاغَتِ ٱلْأَبْصَٰرُ وَبَلَغَتِ ٱلْقُلُوبُ ٱلْحَنَاجِرَ وَتَظُنُّونَ بِٱللَّهِ ٱلظُّنُونَا۠",
    "translation_en": "[Remember] when they came at you from above you and from below you, and when eyes shifted [in fear], and hearts reached the throats and you assumed about Allah [various] assumptions.",
    "translation_id": "(Yaitu) ketika mereka datang kepadamu dari atas dan dari bawahmu, dan ketika tidak tetap lagi penglihatan(mu) dan hatimu naik menyesak sampai ke tenggorokan dan kamu menyangka terhadap Allah dengan bermacam-macam purbasangka."
  }, {
    "number": 11,
    "text": "هُنَالِكَ ٱبْتُلِىَ ٱلْمُؤْمِنُونَ وَزُلْزِلُوا۟ زِلْزَالًا شَدِيدًا",
    "translation_en": "There the believers were tested and shaken with a severe shaking.",
    "translation_id": "Disitulah diuji orang-orang mukmin dan digoncangkan (hatinya) dengan goncangan yang sangat."
  }, {
    "number": 12,
    "text": "وَإِذْ يَقُولُ ٱلْمُنَٰفِقُونَ وَٱلَّذِينَ فِى قُلُوبِهِم مَّرَضٌ مَّا وَعَدَنَا ٱللَّهُ وَرَسُولُهُۥٓ إِلَّا غُرُورًا",
    "translation_en": "And [remember] when the hypocrites and those in whose hearts is disease said, \"Allah and His Messenger did not promise us except delusion,\"",
    "translation_id": "Dan (ingatlah) ketika orang-orang munafik dan orang-orang yang berpenyakit dalam hatinya berkata: \"Allah dan Rasul-Nya tidak menjanjikan kepada kami melainkan tipu daya\"."
  }, {
    "number": 13,
    "text": "وَإِذْ قَالَت طَّآئِفَةٌ مِّنْهُمْ يَٰٓأَهْلَ يَثْرِبَ لَا مُقَامَ لَكُمْ فَٱرْجِعُوا۟ وَيَسْتَـْٔذِنُ فَرِيقٌ مِّنْهُمُ ٱلنَّبِىَّ يَقُولُونَ إِنَّ بُيُوتَنَا عَوْرَةٌ وَمَا هِىَ بِعَوْرَةٍ إِن يُرِيدُونَ إِلَّا فِرَارًا",
    "translation_en": "And when a faction of them said, \"O people of Yathrib, there is no stability for you [here], so return [home].\" And a party of them asked permission of the Prophet, saying, \"Indeed, our houses are unprotected,\" while they were not exposed. They did not intend except to flee.",
    "translation_id": "Dan (ingatlah) ketika segolongan di antara mreka berkata: \"Hai penduduk Yatsrib (Madinah), tidak ada tempat bagimu, maka kembalilah kamu\". Dan sebahagian dari mereka minta izin kepada Nabi (untuk kembali pulang) dengan berkata: \"Sesungguhnya rumah-rumah kami terbuka (tidak ada penjaga)\". Dan rumah-rumah itu sekali-kali tidak terbuka, mereka tidak lain hanya hendak lari."
  }, {
    "number": 14,
    "text": "وَلَوْ دُخِلَتْ عَلَيْهِم مِّنْ أَقْطَارِهَا ثُمَّ سُئِلُوا۟ ٱلْفِتْنَةَ لَءَاتَوْهَا وَمَا تَلَبَّثُوا۟ بِهَآ إِلَّا يَسِيرًا",
    "translation_en": "And if they had been entered upon from all its [surrounding] regions and fitnah had been demanded of them, they would have done it and not hesitated over it except briefly.",
    "translation_id": "Kalau (Yatsrib) diserang dari segala penjuru, kemudian diminta kepada mereka supaya murtad, niscaya mereka mengerjakannya; dan mereka tiada akan bertangguh untuk murtad itu melainkan dalam waktu yang singkat."
  }, {
    "number": 15,
    "text": "وَلَقَدْ كَانُوا۟ عَٰهَدُوا۟ ٱللَّهَ مِن قَبْلُ لَا يُوَلُّونَ ٱلْأَدْبَٰرَ وَكَانَ عَهْدُ ٱللَّهِ مَسْـُٔولًا",
    "translation_en": "And they had already promised Allah before not to turn their backs and flee. And ever is the promise to Allah [that about which one will be] questioned.",
    "translation_id": "Dan sesungguhnya mereka sebelum itu telah berjanji kepada Allah: \"Mereka tidak akan berbalik ke belakang (mundur)\". Dan adalah perjanjian dengan Allah akan diminta pertanggungan jawabnya."
  }, {
    "number": 16,
    "text": "قُل لَّن يَنفَعَكُمُ ٱلْفِرَارُ إِن فَرَرْتُم مِّنَ ٱلْمَوْتِ أَوِ ٱلْقَتْلِ وَإِذًا لَّا تُمَتَّعُونَ إِلَّا قَلِيلًا",
    "translation_en": "Say, [O Muhammad], \"Never will fleeing benefit you if you should flee from death or killing; and then [if you did], you would not be given enjoyment [of life] except for a little.\"",
    "translation_id": "Katakanlah: \"Lari itu sekali-kali tidaklah berguna bagimu, jika kamu melarikan diri dari kematian atau pembunuhan, dan jika (kamu terhindar dari kematian) kamu tidak juga akan mengecap kesenangan kecuali sebentar saja\"."
  }, {
    "number": 17,
    "text": "قُلْ مَن ذَا ٱلَّذِى يَعْصِمُكُم مِّنَ ٱللَّهِ إِنْ أَرَادَ بِكُمْ سُوٓءًا أَوْ أَرَادَ بِكُمْ رَحْمَةً وَلَا يَجِدُونَ لَهُم مِّن دُونِ ٱللَّهِ وَلِيًّا وَلَا نَصِيرًا",
    "translation_en": "Say, \"Who is it that can protect you from Allah if He intends for you an ill or intends for you a mercy?\" And they will not find for themselves besides Allah any protector or any helper.",
    "translation_id": "Katakanlah: \"Siapakah yang dapat melindungi kamu dari (takdir) Allah jika Dia menghendaki bencana atasmu atau menghendaki rahmat untuk dirimu?\" Dan orang-orang munafik itu tidak memperoleh bagi mereka pelindung dan penolong selain Allah."
  }, {
    "number": 18,
    "text": "قَدْ يَعْلَمُ ٱللَّهُ ٱلْمُعَوِّقِينَ مِنكُمْ وَٱلْقَآئِلِينَ لِإِخْوَٰنِهِمْ هَلُمَّ إِلَيْنَا وَلَا يَأْتُونَ ٱلْبَأْسَ إِلَّا قَلِيلًا",
    "translation_en": "Already Allah knows the hinderers among you and those [hypocrites] who say to their brothers, \"Come to us,\" and do not go to battle, except for a few,",
    "translation_id": "Sesungguhnya Allah mengetahui orang-orang yang menghalang-halangi di antara kamu dan orang-orang yang berkata kepada saudara-saudaranya: \"Marilah kepada kami\". Dan mereka tidak mendatangi peperangan melainkan sebentar."
  }, {
    "number": 19,
    "text": "أَشِحَّةً عَلَيْكُمْ فَإِذَا جَآءَ ٱلْخَوْفُ رَأَيْتَهُمْ يَنظُرُونَ إِلَيْكَ تَدُورُ أَعْيُنُهُمْ كَٱلَّذِى يُغْشَىٰ عَلَيْهِ مِنَ ٱلْمَوْتِ فَإِذَا ذَهَبَ ٱلْخَوْفُ سَلَقُوكُم بِأَلْسِنَةٍ حِدَادٍ أَشِحَّةً عَلَى ٱلْخَيْرِ أُو۟لَٰٓئِكَ لَمْ يُؤْمِنُوا۟ فَأَحْبَطَ ٱللَّهُ أَعْمَٰلَهُمْ وَكَانَ ذَٰلِكَ عَلَى ٱللَّهِ يَسِيرًا",
    "translation_en": "Indisposed toward you. And when fear comes, you see them looking at you, their eyes revolving like one being overcome by death. But when fear departs, they lash you with sharp tongues, indisposed toward [any] good. Those have not believed, so Allah has rendered their deeds worthless, and ever is that, for Allah, easy.",
    "translation_id": "Mereka bakhil terhadapmu, apabila datang ketakutan (bahaya), kamu lihat mereka itu memandang kepadamu dengan mata yang terbalik-balik seperti orang yang pingsan karena akan mati, dan apabila ketakutan telah hilang, mereka mencaci kamu dengan lidah yang tajam, sedang mereka bakhil untuk berbuat kebaikan. Mereka itu tidak beriman, maka Allah menghapuskan (pahala) amalnya. Dan yang demikian itu adalah mudah bagi Allah."
  }, {
    "number": 20,
    "text": "يَحْسَبُونَ ٱلْأَحْزَابَ لَمْ يَذْهَبُوا۟ وَإِن يَأْتِ ٱلْأَحْزَابُ يَوَدُّوا۟ لَوْ أَنَّهُم بَادُونَ فِى ٱلْأَعْرَابِ يَسْـَٔلُونَ عَنْ أَنۢبَآئِكُمْ وَلَوْ كَانُوا۟ فِيكُم مَّا قَٰتَلُوٓا۟ إِلَّا قَلِيلًا",
    "translation_en": "They think the companies have not [yet] withdrawn. And if the companies should come [again], they would wish they were in the desert among the bedouins, inquiring [from afar] about your news. And if they should be among you, they would not fight except for a little.",
    "translation_id": "Mereka mengira (bahwa) golongan-golongan yang bersekutu itu belum pergi; dan jika golongan-golongan yang bersekutu itu datang kembali, niscaya mereka ingin berada di dusun-dusun bersama-sama orang Arab Badwi, sambil menanya-nanyakan tentang berita-beritamu. Dan sekiranya mereka berada bersama kamu, mereka tidak akan berperang, melainkan sebentar saja."
  }, {
    "number": 21,
    "text": "لَّقَدْ كَانَ لَكُمْ فِى رَسُولِ ٱللَّهِ أُسْوَةٌ حَسَنَةٌ لِّمَن كَانَ يَرْجُوا۟ ٱللَّهَ وَٱلْيَوْمَ ٱلْءَاخِرَ وَذَكَرَ ٱللَّهَ كَثِيرًا",
    "translation_en": "There has certainly been for you in the Messenger of Allah an excellent pattern for anyone whose hope is in Allah and the Last Day and [who] remembers Allah often.",
    "translation_id": "Sesungguhnya telah ada pada (diri) Rasulullah itu suri teladan yang baik bagimu (yaitu) bagi orang yang mengharap (rahmat) Allah dan (kedatangan) hari kiamat dan dia banyak menyebut Allah."
  }, {
    "number": 22,
    "text": "وَلَمَّا رَءَا ٱلْمُؤْمِنُونَ ٱلْأَحْزَابَ قَالُوا۟ هَٰذَا مَا وَعَدَنَا ٱللَّهُ وَرَسُولُهُۥ وَصَدَقَ ٱللَّهُ وَرَسُولُهُۥ وَمَا زَادَهُمْ إِلَّآ إِيمَٰنًا وَتَسْلِيمًا",
    "translation_en": "And when the believers saw the companies, they said, \"This is what Allah and His Messenger had promised us, and Allah and His Messenger spoke the truth.\" And it increased them only in faith and acceptance.",
    "translation_id": "Dan tatkala orang-orang mukmin melihat golongan-golongan yang bersekutu itu, mereka berkata: \"Inilah yang dijanjikan Allah dan Rasul-Nya kepada kita\". Dan benarlah Allah dan Rasul-Nya. Dan yang demikian itu tidaklah menambah kepada mereka kecuali iman dan ketundukan."
  }, {
    "number": 23,
    "text": "مِّنَ ٱلْمُؤْمِنِينَ رِجَالٌ صَدَقُوا۟ مَا عَٰهَدُوا۟ ٱللَّهَ عَلَيْهِ فَمِنْهُم مَّن قَضَىٰ نَحْبَهُۥ وَمِنْهُم مَّن يَنتَظِرُ وَمَا بَدَّلُوا۟ تَبْدِيلًا",
    "translation_en": "Among the believers are men true to what they promised Allah. Among them is he who has fulfilled his vow [to the death], and among them is he who awaits [his chance]. And they did not alter [the terms of their commitment] by any alteration -",
    "translation_id": "Di antara orang-orang mukmin itu ada orang-orang yang menepati apa yang telah mereka janjikan kepada Allah; maka di antara mereka ada yang gugur. Dan di antara mereka ada (pula) yang menunggu-nunggu dan mereka tidak merubah (janjinya),"
  }, {
    "number": 24,
    "text": "لِّيَجْزِىَ ٱللَّهُ ٱلصَّٰدِقِينَ بِصِدْقِهِمْ وَيُعَذِّبَ ٱلْمُنَٰفِقِينَ إِن شَآءَ أَوْ يَتُوبَ عَلَيْهِمْ إِنَّ ٱللَّهَ كَانَ غَفُورًا رَّحِيمًا",
    "translation_en": "That Allah may reward the truthful for their truth and punish the hypocrites if He wills or accept their repentance. Indeed, Allah is ever Forgiving and Merciful.",
    "translation_id": "supaya Allah memberikan balasan kepada orang-orang yang benar itu karena kebenarannya, dan menyiksa orang munafik jika dikehendaki-Nya, atau menerima taubat mereka. Sesungguhnya Allah adalah Maha Pengampun lagi Maha Penyayang."
  }, {
    "number": 25,
    "text": "وَرَدَّ ٱللَّهُ ٱلَّذِينَ كَفَرُوا۟ بِغَيْظِهِمْ لَمْ يَنَالُوا۟ خَيْرًا وَكَفَى ٱللَّهُ ٱلْمُؤْمِنِينَ ٱلْقِتَالَ وَكَانَ ٱللَّهُ قَوِيًّا عَزِيزًا",
    "translation_en": "And Allah repelled those who disbelieved, in their rage, not having obtained any good. And sufficient was Allah for the believers in battle, and ever is Allah Powerful and Exalted in Might.",
    "translation_id": "Dan Allah menghalau orang-orang yang kafir itu yang keadaan mereka penuh kejengkelan, (lagi) mereka tidak memperoleh keuntungan apapun. Dan Allah menghindarkan orang-orang mukmin dari peperangan. Dan adalah Allah Maha Kuat lagi Maha Perkasa."
  }, {
    "number": 26,
    "text": "وَأَنزَلَ ٱلَّذِينَ ظَٰهَرُوهُم مِّنْ أَهْلِ ٱلْكِتَٰبِ مِن صَيَاصِيهِمْ وَقَذَفَ فِى قُلُوبِهِمُ ٱلرُّعْبَ فَرِيقًا تَقْتُلُونَ وَتَأْسِرُونَ فَرِيقًا",
    "translation_en": "And He brought down those who supported them among the People of the Scripture from their fortresses and cast terror into their hearts [so that] a party you killed, and you took captive a party.",
    "translation_id": "Dan Dia menurunkan orang-orang Ahli Kitab (Bani Quraizhah) yang membantu golongan-golongan yang bersekutu dari benteng-benteng mereka, dan Dia memesukkan rasa takut ke dalam hati mereka. Sebahagian mereka kamu bunuh dan sebahagian yang lain kamu tawan."
  }, {
    "number": 27,
    "text": "وَأَوْرَثَكُمْ أَرْضَهُمْ وَدِيَٰرَهُمْ وَأَمْوَٰلَهُمْ وَأَرْضًا لَّمْ تَطَـُٔوهَا وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَىْءٍ قَدِيرًا",
    "translation_en": "And He caused you to inherit their land and their homes and their properties and a land which you have not trodden. And ever is Allah, over all things, competent.",
    "translation_id": "Dan Dia mewariskan kepada kamu tanah-tanah, rumah-rumah dan harta benda mereka, dan (begitu pula) tanah yang belum kamu injak. Dan adalah Allah Maha Kuasa terhadap segala sesuatu."
  }, {
    "number": 28,
    "text": "يَٰٓأَيُّهَا ٱلنَّبِىُّ قُل لِّأَزْوَٰجِكَ إِن كُنتُنَّ تُرِدْنَ ٱلْحَيَوٰةَ ٱلدُّنْيَا وَزِينَتَهَا فَتَعَالَيْنَ أُمَتِّعْكُنَّ وَأُسَرِّحْكُنَّ سَرَاحًا جَمِيلًا",
    "translation_en": "O Prophet, say to your wives, \"If you should desire the worldly life and its adornment, then come, I will provide for you and give you a gracious release.",
    "translation_id": "Hai Nabi, katakanlah kepada isteri-isterimu: \"Jika kamu sekalian mengingini kehidupan dunia dan perhiasannya, maka marilah supaya kuberikan kepadamu mut'ah dan aku ceraikan kamu dengan cara yang baik."
  }, {
    "number": 29,
    "text": "وَإِن كُنتُنَّ تُرِدْنَ ٱللَّهَ وَرَسُولَهُۥ وَٱلدَّارَ ٱلْءَاخِرَةَ فَإِنَّ ٱللَّهَ أَعَدَّ لِلْمُحْسِنَٰتِ مِنكُنَّ أَجْرًا عَظِيمًا",
    "translation_en": "But if you should desire Allah and His Messenger and the home of the Hereafter - then indeed, Allah has prepared for the doers of good among you a great reward.\"",
    "translation_id": "Dan jika kamu sekalian menghendaki (keridhaan) Allah dan Rasulnya-Nya serta (kesenangan) di negeri akhirat, maka sesungguhnya Allah menyediakan bagi siapa yang berbuat baik diantaramu pahala yang besar."
  }, {
    "number": 30,
    "text": "يَٰنِسَآءَ ٱلنَّبِىِّ مَن يَأْتِ مِنكُنَّ بِفَٰحِشَةٍ مُّبَيِّنَةٍ يُضَٰعَفْ لَهَا ٱلْعَذَابُ ضِعْفَيْنِ وَكَانَ ذَٰلِكَ عَلَى ٱللَّهِ يَسِيرًا",
    "translation_en": "O wives of the Prophet, whoever of you should commit a clear immorality - for her the punishment would be doubled two fold, and ever is that, for Allah, easy.",
    "translation_id": "Hai isteri-isteri Nabi, siapa-siapa di antaramu yang mengerjakan perbuatan keji yang nyata, niscaya akan di lipat gandakan siksaan kepada mereka dua kali lipat. Dan adalah yang demikian itu mudah bagi Allah."
  }, {
    "number": 31,
    "text": "وَمَن يَقْنُتْ مِنكُنَّ لِلَّهِ وَرَسُولِهِۦ وَتَعْمَلْ صَٰلِحًا نُّؤْتِهَآ أَجْرَهَا مَرَّتَيْنِ وَأَعْتَدْنَا لَهَا رِزْقًا كَرِيمًا",
    "translation_en": "And whoever of you devoutly obeys Allah and His Messenger and does righteousness - We will give her her reward twice; and We have prepared for her a noble provision.",
    "translation_id": "Dan barang siapa diantara kamu sekalian (isteri-isteri nabi) tetap taat kepada Allah dan Rasul-Nya dan mengerjakan amal yang saleh, niscata Kami memberikan kepadanya pahala dua kali lipat dan Kami sediakan baginya rezeki yang mulia."
  }, {
    "number": 32,
    "text": "يَٰنِسَآءَ ٱلنَّبِىِّ لَسْتُنَّ كَأَحَدٍ مِّنَ ٱلنِّسَآءِ إِنِ ٱتَّقَيْتُنَّ فَلَا تَخْضَعْنَ بِٱلْقَوْلِ فَيَطْمَعَ ٱلَّذِى فِى قَلْبِهِۦ مَرَضٌ وَقُلْنَ قَوْلًا مَّعْرُوفًا",
    "translation_en": "O wives of the Prophet, you are not like anyone among women. If you fear Allah, then do not be soft in speech [to men], lest he in whose heart is disease should covet, but speak with appropriate speech.",
    "translation_id": "Hai isteri-isteri Nabi, kamu sekalian tidaklah seperti wanita yang lain, jika kamu bertakwa. Maka janganlah kamu tunduk dalam berbicara sehingga berkeinginanlah orang yang ada penyakit dalam hatinya dan ucapkanlah perkataan yang baik,"
  }, {
    "number": 33,
    "text": "وَقَرْنَ فِى بُيُوتِكُنَّ وَلَا تَبَرَّجْنَ تَبَرُّجَ ٱلْجَٰهِلِيَّةِ ٱلْأُولَىٰ وَأَقِمْنَ ٱلصَّلَوٰةَ وَءَاتِينَ ٱلزَّكَوٰةَ وَأَطِعْنَ ٱللَّهَ وَرَسُولَهُۥٓ إِنَّمَا يُرِيدُ ٱللَّهُ لِيُذْهِبَ عَنكُمُ ٱلرِّجْسَ أَهْلَ ٱلْبَيْتِ وَيُطَهِّرَكُمْ تَطْهِيرًا",
    "translation_en": "And abide in your houses and do not display yourselves as [was] the display of the former times of ignorance. And establish prayer and give zakah and obey Allah and His Messenger. Allah intends only to remove from you the impurity [of sin], O people of the [Prophet's] household, and to purify you with [extensive] purification.",
    "translation_id": "dan hendaklah kamu tetap di rumahmu dan janganlah kamu berhias dan bertingkah laku seperti orang-orang Jahiliyah yang dahulu dan dirikanlah shalat, tunaikanlah zakat dan taatilah Allah dan Rasul-Nya. Sesungguhnya Allah bermaksud hendak menghilangkan dosa dari kamu, hai ahlul bait dan membersihkan kamu sebersih-bersihnya."
  }, {
    "number": 34,
    "text": "وَٱذْكُرْنَ مَا يُتْلَىٰ فِى بُيُوتِكُنَّ مِنْ ءَايَٰتِ ٱللَّهِ وَٱلْحِكْمَةِ إِنَّ ٱللَّهَ كَانَ لَطِيفًا خَبِيرًا",
    "translation_en": "And remember what is recited in your houses of the verses of Allah and wisdom. Indeed, Allah is ever Subtle and Acquainted [with all things].",
    "translation_id": "Dan ingatlah apa yang dibacakan di rumahmu dari ayat-ayat Allah dan hikmah (sunnah nabimu). Sesungguhnya Allah adalah Maha Lembut lagi Maha Mengetahui."
  }, {
    "number": 35,
    "text": "إِنَّ ٱلْمُسْلِمِينَ وَٱلْمُسْلِمَٰتِ وَٱلْمُؤْمِنِينَ وَٱلْمُؤْمِنَٰتِ وَٱلْقَٰنِتِينَ وَٱلْقَٰنِتَٰتِ وَٱلصَّٰدِقِينَ وَٱلصَّٰدِقَٰتِ وَٱلصَّٰبِرِينَ وَٱلصَّٰبِرَٰتِ وَٱلْخَٰشِعِينَ وَٱلْخَٰشِعَٰتِ وَٱلْمُتَصَدِّقِينَ وَٱلْمُتَصَدِّقَٰتِ وَٱلصَّٰٓئِمِينَ وَٱلصَّٰٓئِمَٰتِ وَٱلْحَٰفِظِينَ فُرُوجَهُمْ وَٱلْحَٰفِظَٰتِ وَٱلذَّٰكِرِينَ ٱللَّهَ كَثِيرًا وَٱلذَّٰكِرَٰتِ أَعَدَّ ٱللَّهُ لَهُم مَّغْفِرَةً وَأَجْرًا عَظِيمًا",
    "translation_en": "Indeed, the Muslim men and Muslim women, the believing men and believing women, the obedient men and obedient women, the truthful men and truthful women, the patient men and patient women, the humble men and humble women, the charitable men and charitable women, the fasting men and fasting women, the men who guard their private parts and the women who do so, and the men who remember Allah often and the women who do so - for them Allah has prepared forgiveness and a great reward.",
    "translation_id": "Sesungguhnya laki-laki dan perempuan yang muslim, laki-laki dan perempuan yang mukmin, laki-laki dan perempuan yang tetap dalam ketaatannya, laki-laki dan perempuan yang benar, laki-laki dan perempuan yang sabar, laki-laki dan perempuan yang khusyu', laki-laki dan perempuan yang bersedekah, laki-laki dan perempuan yang berpuasa, laki-laki dan perempuan yang memelihara kehormatannya, laki-laki dan perempuan yang banyak menyebut (nama) Allah, Allah telah menyediakan untuk mereka ampunan dan pahala yang besar."
  }, {
    "number": 36,
    "text": "وَمَا كَانَ لِمُؤْمِنٍ وَلَا مُؤْمِنَةٍ إِذَا قَضَى ٱللَّهُ وَرَسُولُهُۥٓ أَمْرًا أَن يَكُونَ لَهُمُ ٱلْخِيَرَةُ مِنْ أَمْرِهِمْ وَمَن يَعْصِ ٱللَّهَ وَرَسُولَهُۥ فَقَدْ ضَلَّ ضَلَٰلًا مُّبِينًا",
    "translation_en": "It is not for a believing man or a believing woman, when Allah and His Messenger have decided a matter, that they should [thereafter] have any choice about their affair. And whoever disobeys Allah and His Messenger has certainly strayed into clear error.",
    "translation_id": "Dan tidaklah patut bagi laki-laki yang mukmin dan tidak (pula) bagi perempuan yang mukmin, apabila Allah dan Rasul-Nya telah menetapkan suatu ketetapan, akan ada bagi mereka pilihan (yang lain) tentang urusan mereka. Dan barangsiapa mendurhakai Allah dan Rasul-Nya maka sungguhlah dia telah sesat, sesat yang nyata."
  }, {
    "number": 37,
    "text": "وَإِذْ تَقُولُ لِلَّذِىٓ أَنْعَمَ ٱللَّهُ عَلَيْهِ وَأَنْعَمْتَ عَلَيْهِ أَمْسِكْ عَلَيْكَ زَوْجَكَ وَٱتَّقِ ٱللَّهَ وَتُخْفِى فِى نَفْسِكَ مَا ٱللَّهُ مُبْدِيهِ وَتَخْشَى ٱلنَّاسَ وَٱللَّهُ أَحَقُّ أَن تَخْشَىٰهُ فَلَمَّا قَضَىٰ زَيْدٌ مِّنْهَا وَطَرًا زَوَّجْنَٰكَهَا لِكَىْ لَا يَكُونَ عَلَى ٱلْمُؤْمِنِينَ حَرَجٌ فِىٓ أَزْوَٰجِ أَدْعِيَآئِهِمْ إِذَا قَضَوْا۟ مِنْهُنَّ وَطَرًا وَكَانَ أَمْرُ ٱللَّهِ مَفْعُولًا",
    "translation_en": "And [remember, O Muhammad], when you said to the one on whom Allah bestowed favor and you bestowed favor, \"Keep your wife and fear Allah,\" while you concealed within yourself that which Allah is to disclose. And you feared the people, while Allah has more right that you fear Him. So when Zayd had no longer any need for her, We married her to you in order that there not be upon the believers any discomfort concerning the wives of their adopted sons when they no longer have need of them. And ever is the command of Allah accomplished.",
    "translation_id": "Dan (ingatlah), ketika kamu berkata kepada orang yang Allah telah melimpahkan nikmat kepadanya dan kamu (juga) telah memberi nikmat kepadanya: \"Tahanlah terus isterimu dan bertakwalah kepada Allah\", sedang kamu menyembunyikan di dalam hatimu apa yang Allah akan menyatakannya, dan kamu takut kepada manusia, sedang Allah-lah yang lebih berhak untuk kamu takuti. Maka tatkala Zaid telah mengakhiri keperluan terhadap istrinya (menceraikannya), Kami kawinkan kamu dengan dia supaya tidak ada keberatan bagi orang mukmin untuk (mengawini) isteri-isteri anak-anak angkat mereka, apabila anak-anak angkat itu telah menyelesaikan keperluannya daripada isterinya. Dan adalah ketetapan Allah itu pasti terjadi."
  }, {
    "number": 38,
    "text": "مَّا كَانَ عَلَى ٱلنَّبِىِّ مِنْ حَرَجٍ فِيمَا فَرَضَ ٱللَّهُ لَهُۥ سُنَّةَ ٱللَّهِ فِى ٱلَّذِينَ خَلَوْا۟ مِن قَبْلُ وَكَانَ أَمْرُ ٱللَّهِ قَدَرًا مَّقْدُورًا",
    "translation_en": "There is not to be upon the Prophet any discomfort concerning that which Allah has imposed upon him. [This is] the established way of Allah with those [prophets] who have passed on before. And ever is the command of Allah a destiny decreed.",
    "translation_id": "Tidak ada suatu keberatanpun atas Nabi tentang apa yang telah ditetapkan Allah baginya. (Allah telah menetapkan yang demikian) sebagai sunnah-Nya pada nabi-nabi yang telah berlalu dahulu. Dan adalah ketetapan Allah itu suatu ketetapan yang pasti berlaku,"
  }, {
    "number": 39,
    "text": "ٱلَّذِينَ يُبَلِّغُونَ رِسَٰلَٰتِ ٱللَّهِ وَيَخْشَوْنَهُۥ وَلَا يَخْشَوْنَ أَحَدًا إِلَّا ٱللَّهَ وَكَفَىٰ بِٱللَّهِ حَسِيبًا",
    "translation_en": "[Allah praises] those who convey the messages of Allah and fear Him and do not fear anyone but Allah. And sufficient is Allah as Accountant.",
    "translation_id": "(yaitu) orang-orang yang menyapaikan risalah-risalah Allah, mereka takut kepada-Nya dan mereka tiada merasa takut kepada seorang(pun) selain kepada Allah. Dan cukuplah Allah sebagai Pembuat Perhitungan."
  }, {
    "number": 40,
    "text": "مَّا كَانَ مُحَمَّدٌ أَبَآ أَحَدٍ مِّن رِّجَالِكُمْ وَلَٰكِن رَّسُولَ ٱللَّهِ وَخَاتَمَ ٱلنَّبِيِّۦنَ وَكَانَ ٱللَّهُ بِكُلِّ شَىْءٍ عَلِيمًا",
    "translation_en": "Muhammad is not the father of [any] one of your men, but [he is] the Messenger of Allah and last of the prophets. And ever is Allah, of all things, Knowing.",
    "translation_id": "Muhammad itu sekali-kali bukanlah bapak dari seorang laki-laki di antara kamu, tetapi dia adalah Rasulullah dan penutup nabi-nabi. Dan adalah Allah Maha Mengetahui segala sesuatu."
  }, {
    "number": 41,
    "text": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ ٱذْكُرُوا۟ ٱللَّهَ ذِكْرًا كَثِيرًا",
    "translation_en": "O you who have believed, remember Allah with much remembrance",
    "translation_id": "Hai orang-orang yang beriman, berzdikirlah (dengan menyebut nama) Allah, zikir yang sebanyak-banyaknya."
  }, {
    "number": 42,
    "text": "وَسَبِّحُوهُ بُكْرَةً وَأَصِيلًا",
    "translation_en": "And exalt Him morning and afternoon.",
    "translation_id": "Dan bertasbihlah kepada-Nya diwaktu pagi dan petang."
  }, {
    "number": 43,
    "text": "هُوَ ٱلَّذِى يُصَلِّى عَلَيْكُمْ وَمَلَٰٓئِكَتُهُۥ لِيُخْرِجَكُم مِّنَ ٱلظُّلُمَٰتِ إِلَى ٱلنُّورِ وَكَانَ بِٱلْمُؤْمِنِينَ رَحِيمًا",
    "translation_en": "It is He who confers blessing upon you, and His angels [ask Him to do so] that He may bring you out from darknesses into the light. And ever is He, to the believers, Merciful.",
    "translation_id": "Dialah yang memberi rahmat kepadamu dan malaikat-Nya (memohonkan ampunan untukmu), supaya Dia mengeluarkan kamu dari kegelapan kepada cahaya (yang terang). Dan adalah Dia Maha Penyayang kepada orang-orang yang beriman."
  }, {
    "number": 44,
    "text": "تَحِيَّتُهُمْ يَوْمَ يَلْقَوْنَهُۥ سَلَٰمٌ وَأَعَدَّ لَهُمْ أَجْرًا كَرِيمًا",
    "translation_en": "Their greeting the Day they meet Him will be, \"Peace.\" And He has prepared for them a noble reward.",
    "translation_id": "Salam penghormatan kepada mereka (orang-orang mukmin itu) pada hari mereka menemui-Nya ialah: Salam; dan Dia menyediakan pahala yang mulia bagi mereka."
  }, {
    "number": 45,
    "text": "يَٰٓأَيُّهَا ٱلنَّبِىُّ إِنَّآ أَرْسَلْنَٰكَ شَٰهِدًا وَمُبَشِّرًا وَنَذِيرًا",
    "translation_en": "O Prophet, indeed We have sent you as a witness and a bringer of good tidings and a warner.",
    "translation_id": "Hai Nabi, sesungguhnya Kami mengutusmu untuk jadi saksi, dan pembawa kabar gemgira dan pemberi peringatan,"
  }, {
    "number": 46,
    "text": "وَدَاعِيًا إِلَى ٱللَّهِ بِإِذْنِهِۦ وَسِرَاجًا مُّنِيرًا",
    "translation_en": "And one who invites to Allah, by His permission, and an illuminating lamp.",
    "translation_id": "dan untuk jadi penyeru kepada Agama Allah dengan izin-Nya dan untuk jadi cahaya yang menerangi."
  }, {
    "number": 47,
    "text": "وَبَشِّرِ ٱلْمُؤْمِنِينَ بِأَنَّ لَهُم مِّنَ ٱللَّهِ فَضْلًا كَبِيرًا",
    "translation_en": "And give good tidings to the believers that they will have from Allah great bounty.",
    "translation_id": "Dan sampaikanlah berita gembira kepada orang-orang mukmin bahwa sesungguhnya bagi mereka karunia yang besar dari Allah."
  }, {
    "number": 48,
    "text": "وَلَا تُطِعِ ٱلْكَٰفِرِينَ وَٱلْمُنَٰفِقِينَ وَدَعْ أَذَىٰهُمْ وَتَوَكَّلْ عَلَى ٱللَّهِ وَكَفَىٰ بِٱللَّهِ وَكِيلًا",
    "translation_en": "And do not obey the disbelievers and the hypocrites but do not harm them, and rely upon Allah. And sufficient is Allah as Disposer of affairs.",
    "translation_id": "Dan janganlah kamu menuruti orang-orang yang kafir dan orang-orang munafik itu, janganlah kamu hiraukan gangguan mereka dan bertawakkallah kepada Allah. Dan cukuplah Allah sebagai Pelindung."
  }, {
    "number": 49,
    "text": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓا۟ إِذَا نَكَحْتُمُ ٱلْمُؤْمِنَٰتِ ثُمَّ طَلَّقْتُمُوهُنَّ مِن قَبْلِ أَن تَمَسُّوهُنَّ فَمَا لَكُمْ عَلَيْهِنَّ مِنْ عِدَّةٍ تَعْتَدُّونَهَا فَمَتِّعُوهُنَّ وَسَرِّحُوهُنَّ سَرَاحًا جَمِيلًا",
    "translation_en": "O You who have believed, when you marry believing women and then divorce them before you have touched them, then there is not for you any waiting period to count concerning them. So provide for them and give them a gracious release.",
    "translation_id": "Hai orang-orang yang beriman, apabila kamu menikahi perempuan-perempuan yang beriman, kemudian kamu ceraikan mereka sebelum kamu mencampurinya maka sekali-sekali tidak wajib atas mereka 'iddah bagimu yang kamu minta menyempurnakannya. Maka berilah mereka mut'ah dan lepaskanlah mereka itu dengan cara yang sebaik-baiknya."
  }, {
    "number": 50,
    "text": "يَٰٓأَيُّهَا ٱلنَّبِىُّ إِنَّآ أَحْلَلْنَا لَكَ أَزْوَٰجَكَ ٱلَّٰتِىٓ ءَاتَيْتَ أُجُورَهُنَّ وَمَا مَلَكَتْ يَمِينُكَ مِمَّآ أَفَآءَ ٱللَّهُ عَلَيْكَ وَبَنَاتِ عَمِّكَ وَبَنَاتِ عَمَّٰتِكَ وَبَنَاتِ خَالِكَ وَبَنَاتِ خَٰلَٰتِكَ ٱلَّٰتِى هَاجَرْنَ مَعَكَ وَٱمْرَأَةً مُّؤْمِنَةً إِن وَهَبَتْ نَفْسَهَا لِلنَّبِىِّ إِنْ أَرَادَ ٱلنَّبِىُّ أَن يَسْتَنكِحَهَا خَالِصَةً لَّكَ مِن دُونِ ٱلْمُؤْمِنِينَ قَدْ عَلِمْنَا مَا فَرَضْنَا عَلَيْهِمْ فِىٓ أَزْوَٰجِهِمْ وَمَا مَلَكَتْ أَيْمَٰنُهُمْ لِكَيْلَا يَكُونَ عَلَيْكَ حَرَجٌ وَكَانَ ٱللَّهُ غَفُورًا رَّحِيمًا",
    "translation_en": "O Prophet, indeed We have made lawful to you your wives to whom you have given their due compensation and those your right hand possesses from what Allah has returned to you [of captives] and the daughters of your paternal uncles and the daughters of your paternal aunts and the daughters of your maternal uncles and the daughters of your maternal aunts who emigrated with you and a believing woman if she gives herself to the Prophet [and] if the Prophet wishes to marry her, [this is] only for you, excluding the [other] believers. We certainly know what We have made obligatory upon them concerning their wives and those their right hands possess, [but this is for you] in order that there will be upon you no discomfort. And ever is Allah Forgiving and Merciful.",
    "translation_id": "Hai Nabi, sesungguhnya Kami telah menghalalkan bagimu isteri-isterimu yang telah kamu berikan mas kawinnya dan hamba sahaya yang kamu miliki yang termasuk apa yang kamu peroleh dalam peperangan yang dikaruniakan Allah untukmu, dan (demikian pula) anak-anak perempuan dari saudara laki-laki bapakmu, anak-anak perempuan dari saudara perempuan bapakmu, anak-anak perempuan dari saudara laki-laki ibumu dan anak-anak perempuan dari saudara perempuan ibumu yang turut hijrah bersama kamu dan perempuan mukmin yang menyerahkan dirinya kepada Nabi kalau Nabi mau mengawininya, sebagai pengkhususan bagimu, bukan untuk semua orang mukmin. Sesungguhnya Kami telah mengetahui apa yang Kami wajibkan kepada mereka tentang isteri-isteri mereka dan hamba sahaya yang mereka miliki supaya tidak menjadi kesempitan bagimu. Dan adalah Allah Maha Pengampun lagi Maha Penyayang."
  }, {
    "number": 51,
    "text": "تُرْجِى مَن تَشَآءُ مِنْهُنَّ وَتُـْٔوِىٓ إِلَيْكَ مَن تَشَآءُ وَمَنِ ٱبْتَغَيْتَ مِمَّنْ عَزَلْتَ فَلَا جُنَاحَ عَلَيْكَ ذَٰلِكَ أَدْنَىٰٓ أَن تَقَرَّ أَعْيُنُهُنَّ وَلَا يَحْزَنَّ وَيَرْضَيْنَ بِمَآ ءَاتَيْتَهُنَّ كُلُّهُنَّ وَٱللَّهُ يَعْلَمُ مَا فِى قُلُوبِكُمْ وَكَانَ ٱللَّهُ عَلِيمًا حَلِيمًا",
    "translation_en": "You, [O Muhammad], may put aside whom you will of them or take to yourself whom you will. And any that you desire of those [wives] from whom you had [temporarily] separated - there is no blame upon you [in returning her]. That is more suitable that they should be content and not grieve and that they should be satisfied with what you have given them - all of them. And Allah knows what is in your hearts. And ever is Allah Knowing and Forbearing.",
    "translation_id": "Kamu boleh menangguhkan menggauli siapa yang kamu kehendaki di antara mereka (isteri-isterimu) dan (boleh pula) menggauli siapa yang kamu kehendaki. Dan siapa-siapa yang kamu ingini untuk menggaulinya kembali dari perempuan yang telah kamu cerai, maka tidak ada dosa bagimu. Yang demikian itu adalah lebih dekat untuk ketenangan hati mereka, dan mereka tidak merasa sedih, dan semuanya rela dengan apa yang telah kamu berikan kepada mereka. Dan Allah mengetahui apa yang (tersimpan) dalam hatimu. Dan adalah Allah Maha Mengetahui lagi Maha Penyantun."
  }, {
    "number": 52,
    "text": "لَّا يَحِلُّ لَكَ ٱلنِّسَآءُ مِنۢ بَعْدُ وَلَآ أَن تَبَدَّلَ بِهِنَّ مِنْ أَزْوَٰجٍ وَلَوْ أَعْجَبَكَ حُسْنُهُنَّ إِلَّا مَا مَلَكَتْ يَمِينُكَ وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَىْءٍ رَّقِيبًا",
    "translation_en": "Not lawful to you, [O Muhammad], are [any additional] women after [this], nor [is it] for you to exchange them for [other] wives, even if their beauty were to please you, except what your right hand possesses. And ever is Allah, over all things, an Observer.",
    "translation_id": "Tidak halal bagimu mengawini perempuan-perempuan sesudah itu dan tidak boleh (pula) mengganti mereka dengan isteri-isteri (yang lain), meskipun kecantikannya menarik hatimu kecuali perempuan-perempuan (hamba sahaya) yang kamu miliki. Dan adalah Allah Maha Mengawasi segala sesuatu."
  }, {
    "number": 53,
    "text": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ لَا تَدْخُلُوا۟ بُيُوتَ ٱلنَّبِىِّ إِلَّآ أَن يُؤْذَنَ لَكُمْ إِلَىٰ طَعَامٍ غَيْرَ نَٰظِرِينَ إِنَىٰهُ وَلَٰكِنْ إِذَا دُعِيتُمْ فَٱدْخُلُوا۟ فَإِذَا طَعِمْتُمْ فَٱنتَشِرُوا۟ وَلَا مُسْتَـْٔنِسِينَ لِحَدِيثٍ إِنَّ ذَٰلِكُمْ كَانَ يُؤْذِى ٱلنَّبِىَّ فَيَسْتَحْىِۦ مِنكُمْ وَٱللَّهُ لَا يَسْتَحْىِۦ مِنَ ٱلْحَقِّ وَإِذَا سَأَلْتُمُوهُنَّ مَتَٰعًا فَسْـَٔلُوهُنَّ مِن وَرَآءِ حِجَابٍ ذَٰلِكُمْ أَطْهَرُ لِقُلُوبِكُمْ وَقُلُوبِهِنَّ وَمَا كَانَ لَكُمْ أَن تُؤْذُوا۟ رَسُولَ ٱللَّهِ وَلَآ أَن تَنكِحُوٓا۟ أَزْوَٰجَهُۥ مِنۢ بَعْدِهِۦٓ أَبَدًا إِنَّ ذَٰلِكُمْ كَانَ عِندَ ٱللَّهِ عَظِيمًا",
    "translation_en": "O you who have believed, do not enter the houses of the Prophet except when you are permitted for a meal, without awaiting its readiness. But when you are invited, then enter; and when you have eaten, disperse without seeking to remain for conversation. Indeed, that [behavior] was troubling the Prophet, and he is shy of [dismissing] you. But Allah is not shy of the truth. And when you ask [his wives] for something, ask them from behind a partition. That is purer for your hearts and their hearts. And it is not [conceivable or lawful] for you to harm the Messenger of Allah or to marry his wives after him, ever. Indeed, that would be in the sight of Allah an enormity.",
    "translation_id": "Hai orang-orang yang beriman, janganlah kamu memasuki rumah-rumah Nabi kecuali bila kamu diizinkan untuk makan dengan tidak menunggu-nunggu waktu masak (makanannya), tetapi jika kamu diundang maka masuklah dan bila kamu selesai makan, keluarlah kamu tanpa asyik memperpanjang percakapan. Sesungguhnya yang demikian itu akan mengganggu Nabi lalu Nabi malu kepadamu (untuk menyuruh kamu keluar), dan Allah tidak malu (menerangkan) yang benar. Apabila kamu meminta sesuatu (keperluan) kepada mereka (isteri-isteri Nabi), maka mintalah dari belakang tabir. Cara yang demikian itu lebih suci bagi hatimu dan hati mereka. Dan tidak boleh kamu menyakiti (hati) Rasulullah dan tidak (pula) mengawini isteri-isterinya selama-lamanya sesudah ia wafat. Sesungguhnya perbuatan itu adalah amat besar (dosanya) di sisi Allah."
  }, {
    "number": 54,
    "text": "إِن تُبْدُوا۟ شَيْـًٔا أَوْ تُخْفُوهُ فَإِنَّ ٱللَّهَ كَانَ بِكُلِّ شَىْءٍ عَلِيمًا",
    "translation_en": "Whether you reveal a thing or conceal it, indeed Allah is ever, of all things, Knowing.",
    "translation_id": "Jika kamu melahirkan sesuatu atau menyembunyikannya, maka sesungguhnya Allah adalah Maha Mengetahui segala sesuatu."
  }, {
    "number": 55,
    "text": "لَّا جُنَاحَ عَلَيْهِنَّ فِىٓ ءَابَآئِهِنَّ وَلَآ أَبْنَآئِهِنَّ وَلَآ إِخْوَٰنِهِنَّ وَلَآ أَبْنَآءِ إِخْوَٰنِهِنَّ وَلَآ أَبْنَآءِ أَخَوَٰتِهِنَّ وَلَا نِسَآئِهِنَّ وَلَا مَا مَلَكَتْ أَيْمَٰنُهُنَّ وَٱتَّقِينَ ٱللَّهَ إِنَّ ٱللَّهَ كَانَ عَلَىٰ كُلِّ شَىْءٍ شَهِيدًا",
    "translation_en": "There is no blame upon women concerning their fathers or their sons or their brothers or their brothers' sons or their sisters' sons or their women or those their right hands possess. And fear Allah. Indeed Allah is ever, over all things, Witness.",
    "translation_id": "Tidak ada dosa atas isteri-isteri Nabi (untuk berjumpa tanpa tabir) dengan bapak-bapak mereka, anak-anak laki-laki mereka, saudara laki-laki mereka, anak laki-laki dari saudara laki-laki mereka, anak laki-laki dari saudara mereka yang perempuan yang beriman dan hamba sahaya yang mereka miliki, dan bertakwalah kamu (hai isteri-isteri Nabi) kepada Allah. Sesungguhnya Allah Maha Menyaksikan segala sesuatu."
  }, {
    "number": 56,
    "text": "إِنَّ ٱللَّهَ وَمَلَٰٓئِكَتَهُۥ يُصَلُّونَ عَلَى ٱلنَّبِىِّ يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ صَلُّوا۟ عَلَيْهِ وَسَلِّمُوا۟ تَسْلِيمًا",
    "translation_en": "Indeed, Allah confers blessing upon the Prophet, and His angels [ask Him to do so]. O you who have believed, ask [Allah to confer] blessing upon him and ask [Allah to grant him] peace.",
    "translation_id": "Sesungguhnya Allah dan malaikat-malaikat-Nya bershalawat untuk Nabi. Hai orang-orang yang beriman, bershalawatlah kamu untuk Nabi dan ucapkanlah salam penghormatan kepadanya."
  }, {
    "number": 57,
    "text": "إِنَّ ٱلَّذِينَ يُؤْذُونَ ٱللَّهَ وَرَسُولَهُۥ لَعَنَهُمُ ٱللَّهُ فِى ٱلدُّنْيَا وَٱلْءَاخِرَةِ وَأَعَدَّ لَهُمْ عَذَابًا مُّهِينًا",
    "translation_en": "Indeed, those who abuse Allah and His Messenger - Allah has cursed them in this world and the Hereafter and prepared for them a humiliating punishment.",
    "translation_id": "Sesungguhnya orang-orang yang menyakiti Allah dan Rasul-Nya. Allah akan melaknatinya di dunia dan di akhirat, dan menyediakan baginya siksa yang menghinakan."
  }, {
    "number": 58,
    "text": "وَٱلَّذِينَ يُؤْذُونَ ٱلْمُؤْمِنِينَ وَٱلْمُؤْمِنَٰتِ بِغَيْرِ مَا ٱكْتَسَبُوا۟ فَقَدِ ٱحْتَمَلُوا۟ بُهْتَٰنًا وَإِثْمًا مُّبِينًا",
    "translation_en": "And those who harm believing men and believing women for [something] other than what they have earned have certainly born upon themselves a slander and manifest sin.",
    "translation_id": "Dan orang-orang yang menyakiti orang-orang yang mukmin dan mukminat tanpa kesalahan yang mereka perbuat, maka sesungguhnya mereka telah memikul kebohongan dan dosa yang nyata."
  }, {
    "number": 59,
    "text": "يَٰٓأَيُّهَا ٱلنَّبِىُّ قُل لِّأَزْوَٰجِكَ وَبَنَاتِكَ وَنِسَآءِ ٱلْمُؤْمِنِينَ يُدْنِينَ عَلَيْهِنَّ مِن جَلَٰبِيبِهِنَّ ذَٰلِكَ أَدْنَىٰٓ أَن يُعْرَفْنَ فَلَا يُؤْذَيْنَ وَكَانَ ٱللَّهُ غَفُورًا رَّحِيمًا",
    "translation_en": "O Prophet, tell your wives and your daughters and the women of the believers to bring down over themselves [part] of their outer garments. That is more suitable that they will be known and not be abused. And ever is Allah Forgiving and Merciful.",
    "translation_id": "Hai Nabi, katakanlah kepada isteri-isterimu, anak-anak perempuanmu dan isteri-isteri orang mukmin: \"Hendaklah mereka mengulurkan jilbabnya ke seluruh tubuh mereka\". Yang demikian itu supaya mereka lebih mudah untuk dikenal, karena itu mereka tidak di ganggu. Dan Allah adalah Maha Pengampun lagi Maha Penyayang."
  }, {
    "number": 60,
    "text": "لَّئِن لَّمْ يَنتَهِ ٱلْمُنَٰفِقُونَ وَٱلَّذِينَ فِى قُلُوبِهِم مَّرَضٌ وَٱلْمُرْجِفُونَ فِى ٱلْمَدِينَةِ لَنُغْرِيَنَّكَ بِهِمْ ثُمَّ لَا يُجَاوِرُونَكَ فِيهَآ إِلَّا قَلِيلًا",
    "translation_en": "If the hypocrites and those in whose hearts is disease and those who spread rumors in al-Madinah do not cease, We will surely incite you against them; then they will not remain your neighbors therein except for a little.",
    "translation_id": "Sesungguhnya jika tidak berhenti orang-orang munafik, orang-orang yang berpenyakit dalam hatinya dan orang-orang yang menyebarkan kabar bohong di Madinah (dari menyakitimu), niscaya Kami perintahkan kamu (untuk memerangi) mereka, kemudian mereka tidak menjadi tetanggamu (di Madinah) melainkan dalam waktu yang sebentar,"
  }, {
    "number": 61,
    "text": "مَّلْعُونِينَ أَيْنَمَا ثُقِفُوٓا۟ أُخِذُوا۟ وَقُتِّلُوا۟ تَقْتِيلًا",
    "translation_en": "Accursed wherever they are found, [being] seized and massacred completely.",
    "translation_id": "dalam keadaan terlaknat. Di mana saja mereka dijumpai, mereka ditangkap dan dibunuh dengan sehebat-hebatnya."
  }, {
    "number": 62,
    "text": "سُنَّةَ ٱللَّهِ فِى ٱلَّذِينَ خَلَوْا۟ مِن قَبْلُ وَلَن تَجِدَ لِسُنَّةِ ٱللَّهِ تَبْدِيلًا",
    "translation_en": "[This is] the established way of Allah with those who passed on before; and you will not find in the way of Allah any change.",
    "translation_id": "Sebagai sunnah Allah yang berlaku atas orang-orang yang telah terdahulu sebelum(mu), dan kamu sekali-kali tiada akan mendapati peubahan pada sunnah Allah."
  }, {
    "number": 63,
    "text": "يَسْـَٔلُكَ ٱلنَّاسُ عَنِ ٱلسَّاعَةِ قُلْ إِنَّمَا عِلْمُهَا عِندَ ٱللَّهِ وَمَا يُدْرِيكَ لَعَلَّ ٱلسَّاعَةَ تَكُونُ قَرِيبًا",
    "translation_en": "People ask you concerning the Hour. Say,\" Knowledge of it is only with Allah. And what may make you perceive? Perhaps the Hour is near.\"",
    "translation_id": "Manusia bertanya kepadamu tentang hari berbangkit. Katakanlah: \"Sesungguhnya pengetahuan tentang hari berbangkit itu hanya di sisi Allah\". Dan tahukah kamu (hai Muhammad), boleh jadi hari berbangkit itu sudah dekat waktunya."
  }, {
    "number": 64,
    "text": "إِنَّ ٱللَّهَ لَعَنَ ٱلْكَٰفِرِينَ وَأَعَدَّ لَهُمْ سَعِيرًا",
    "translation_en": "Indeed, Allah has cursed the disbelievers and prepared for them a Blaze.",
    "translation_id": "Sesungguhnya Allah melaknati orang-orang kafir dan menyediakan bagi mereka api yang menyala-nyala (neraka),"
  }, {
    "number": 65,
    "text": "خَٰلِدِينَ فِيهَآ أَبَدًا لَّا يَجِدُونَ وَلِيًّا وَلَا نَصِيرًا",
    "translation_en": "Abiding therein forever, they will not find a protector or a helper.",
    "translation_id": "mereka kekal di dalamnya selama-lamanya; mereka tidak memperoleh seorang pelindungpun dan tidak (pula) seorang penolong."
  }, {
    "number": 66,
    "text": "يَوْمَ تُقَلَّبُ وُجُوهُهُمْ فِى ٱلنَّارِ يَقُولُونَ يَٰلَيْتَنَآ أَطَعْنَا ٱللَّهَ وَأَطَعْنَا ٱلرَّسُولَا۠",
    "translation_en": "The Day their faces will be turned about in the Fire, they will say, \"How we wish we had obeyed Allah and obeyed the Messenger.\"",
    "translation_id": "Pada hari ketika muka mereka dibolak-balikan dalam neraka, mereka berkata: \"Alangkah baiknya, andaikata kami taat kepada Allah dan taat (pula) kepada Rasul\"."
  }, {
    "number": 67,
    "text": "وَقَالُوا۟ رَبَّنَآ إِنَّآ أَطَعْنَا سَادَتَنَا وَكُبَرَآءَنَا فَأَضَلُّونَا ٱلسَّبِيلَا۠",
    "translation_en": "And they will say, \"Our Lord, indeed we obeyed our masters and our dignitaries, and they led us astray from the [right] way.",
    "translation_id": "Dan mereka berkata: \"Ya Tuhan kami, sesungguhnya kami telah mentaati pemimpin-pemimpin dan pembesar-pembesar kami, lalu mereka menyesatkan kami dari jalan (yang benar)."
  }, {
    "number": 68,
    "text": "رَبَّنَآ ءَاتِهِمْ ضِعْفَيْنِ مِنَ ٱلْعَذَابِ وَٱلْعَنْهُمْ لَعْنًا كَبِيرًا",
    "translation_en": "Our Lord, give them double the punishment and curse them with a great curse.\"",
    "translation_id": "Ya Tuhan kami, timpakanlah kepada mereka azab dua kali lipat dan kutuklah mereka dengan kutukan yang besar\"."
  }, {
    "number": 69,
    "text": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ لَا تَكُونُوا۟ كَٱلَّذِينَ ءَاذَوْا۟ مُوسَىٰ فَبَرَّأَهُ ٱللَّهُ مِمَّا قَالُوا۟ وَكَانَ عِندَ ٱللَّهِ وَجِيهًا",
    "translation_en": "O you who have believed, be not like those who abused Moses; then Allah cleared him of what they said. And he, in the sight of Allah, was distinguished.",
    "translation_id": "Hai orang-orang yang beriman, janganlah kamu menjadi seperti orang-orang yang menyakiti Musa; maka Allah membersihkannya dari tuduhan-tuduhan yang mereka katakan. Dan adalah dia seorang yang mempunyai kedudukan terhormat di sisi Allah."
  }, {
    "number": 70,
    "text": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ ٱتَّقُوا۟ ٱللَّهَ وَقُولُوا۟ قَوْلًا سَدِيدًا",
    "translation_en": "O you who have believed, fear Allah and speak words of appropriate justice.",
    "translation_id": "Hai orang-orang yang beriman, bertakwalah kamu kepada Allah dan katakanlah perkataan yang benar,"
  }, {
    "number": 71,
    "text": "يُصْلِحْ لَكُمْ أَعْمَٰلَكُمْ وَيَغْفِرْ لَكُمْ ذُنُوبَكُمْ وَمَن يُطِعِ ٱللَّهَ وَرَسُولَهُۥ فَقَدْ فَازَ فَوْزًا عَظِيمًا",
    "translation_en": "He will [then] amend for you your deeds and forgive you your sins. And whoever obeys Allah and His Messenger has certainly attained a great attainment.",
    "translation_id": "niscaya Allah memperbaiki bagimu amalan-amalanmu dan mengampuni bagimu dosa-dosamu. Dan barangsiapa mentaati Allah dan Rasul-Nya, maka sesungguhnya ia telah mendapat kemenangan yang besar."
  }, {
    "number": 72,
    "text": "إِنَّا عَرَضْنَا ٱلْأَمَانَةَ عَلَى ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ وَٱلْجِبَالِ فَأَبَيْنَ أَن يَحْمِلْنَهَا وَأَشْفَقْنَ مِنْهَا وَحَمَلَهَا ٱلْإِنسَٰنُ إِنَّهُۥ كَانَ ظَلُومًا جَهُولًا",
    "translation_en": "Indeed, we offered the Trust to the heavens and the earth and the mountains, and they declined to bear it and feared it; but man [undertook to] bear it. Indeed, he was unjust and ignorant.",
    "translation_id": "Sesungguhnya Kami telah mengemukakan amanat kepada langit, bumi dan gunung-gunung, maka semuanya enggan untuk memikul amanat itu dan mereka khawatir akan mengkhianatinya, dan dipikullah amanat itu oleh manusia. Sesungguhnya manusia itu amat zalim dan amat bodoh,"
  }, {
    "number": 73,
    "text": "لِّيُعَذِّبَ ٱللَّهُ ٱلْمُنَٰفِقِينَ وَٱلْمُنَٰفِقَٰتِ وَٱلْمُشْرِكِينَ وَٱلْمُشْرِكَٰتِ وَيَتُوبَ ٱللَّهُ عَلَى ٱلْمُؤْمِنِينَ وَٱلْمُؤْمِنَٰتِ وَكَانَ ٱللَّهُ غَفُورًا رَّحِيمًۢا",
    "translation_en": "[It was] so that Allah may punish the hypocrite men and hypocrite women and the men and women who associate others with Him and that Allah may accept repentance from the believing men and believing women. And ever is Allah Forgiving and Merciful.",
    "translation_id": "sehingga Allah mengazab orang-orang munafik laki-laki dan perempuan dan orang-orang musyrikin laki-laki dan perempuan; dan sehingga Allah menerima taubat orang-orang mukmin laki-laki dan perempuan. Dan adalah Allah Maha Pengampun lagi Maha Penyayang."
  }],
  "tafsir": {
    "id": {
      "kemenag": {
        "name": "Kemenag",
        "source": "Aplikasi Quran Kementrian Agama Republik Indonesia",
        "text": {
          "1": "Ayat ini memerintahkan kepada Nabi Muhammad dan kaum Muslimin agar bertakwa kepada Allah dengan melaksanakan semua perintah-Nya dan menghentikan semua larangan-Nya. Allah juga melarang Nabi saw dan kaum Muslimin menuruti keinginan-keinginan orang-orang kafir yang pernah menganjurkan kepada beliau agar mengusir orang-orang mukmin yang lemah dan miskin dari majelisnya. Ayat ini juga melarang Nabi dan orang-orang mukmin mengikuti orang-orang munafik yang lahirnya mengaku sebagai seorang mukmin, tetapi hatinya tetap kafir, bahkan selalu berusaha dan bekerja sama dengan orang-orang kafir yang lain untuk menghancurkan Islam dan kaum Muslimin.\n\nBerdasarkan ayat ini dan sebab turunnya, yang dimaksud dengan \"menuruti keinginan orang-orang kafir dan munafik\" ialah \"menuruti keinginan mereka agar kaum Muslimin mengakui kepercayaan dan tuhan-tuhan mereka, mempercayai bahwa tuhan-tuhan mereka dapat memberi syafaat dan manfaat kepada orang-orang yang menyembahnya, dan mengakui syariat-syariat mereka sebagaimana mengakui syariat yang diturunkan Allah.\" Hendaklah kaum Muslimin waspada terhadap segala usaha orang-orang kafir dan munafik yang sengaja mengaburkan dan merusak agama dan kepercayaan mereka, sehingga pemahaman mereka terhadap agama itu menjadi menyimpang dari paham yang sebenarnya.\n\nAkhir ayat ini memperingatkan bahwa Allah Maha Mengetahui segala yang dikatakan, dianjurkan, disampaikan, dan disembunyi-kan dalam hati orang kafir itu, serta segala yang mereka maksudkan dan inginkan. Oleh karena itu, Dia akan menetapkan hukuman yang adil bagi mereka dan Dia Mahabijaksana dalam mengatur segala urusan Nabi dan para sahabat-sahabatnya.",
          "2": "Setelah Allah melarang kaum Muslimin memenuhi keinginan-keinginan orang-orang kafir itu, lalu Ia memerintahkan agar mereka mengamalkan dan melaksanakan semua yang telah diwahyukan-Nya, yaitu Al-Qur'an, dengan menjadikannya sebagai pedoman dalam berbuat, bertindak, dan menentukan sikap dalam menetapkan pilihan. Yang sesuai dengan petunjuk Al-Qur'an tetap dilaksanakan, sedang yang tidak sesuai segera dihentikan dan dijauhi. Dengan demikian, mereka akan hidup berbahagia, dan dakwah Islamiyah akan berhasil dengan gemilang. Mereka akan terhindar dari segala kemungkinan menurut keinginan orang-orang kafir dan kemungkinan salah dalam memahami agama.\n\nKemudian Allah memperingatkan bahwa Dia mengetahui segala yang diperbuat Nabi dan para sahabatnya. Tidak ada satu pun yang tersembunyi bagi-Nya. Oleh karena itu, Dia akan memberikan balasan sesuai dengan yang telah dijanjikan-Nya, dan akan mewahyukan kepada Muhammad saw segala yang diperlukannya, segala yang bermanfaat dalam menyampaikan risalah dan dalam membina masyarakat Islam.",
          "3": "Pada ayat ini, Allah memperingatkan bahwa apabila Muhammad telah mengikuti apa yang telah diwahyukan dan tidak mengikuti keinginan orang-orang kafir, hendaklah kaum Muslimin berserah diri kepada Allah, menyerahkan segala urusan kepada-Nya saja, dan berpegang dengan agama-Nya dengan sungguh-sungguh. Cukuplah Dia sebagai pemelihara hamba-hamba-Nya. Tidak seorang pun yang dapat menghalangi apabila Allah ber-kehendak memberikan manfaat dan syafaat kepada seseorang. Demikian pula, tidak seorang pun yang sanggup melindungi, apabila Allah berkehendak memberikan cobaan dan pengajaran yang berupa mudarat dan kesengsaraan kepada seseorang.",
          "4": "Pada ayat ini, Allah menerangkan bahwa Dia tidak menjadikan dua hati dalam satu tubuh sehingga tidak mungkin pada diri seseorang berkumpul iman dan kafir. Jika seseorang beriman kepada Allah dan Rasul-Nya, tentu di dalam hatinya tidak ada kekafiran dan kemunafikan, walaupun sedikit, dan ia tentu mengikuti Al-Qur'an dan sunah Rasulullah, menyeru manusia mengikuti jalan Allah, mengikuti hukum-hukum-Nya dan berserah diri hanya kepada Allah. Sebaliknya jika seseorang itu kafir atau munafik, tentu di dalam hatinya tidak ada iman kepada Allah dan Rasul-Nya dan dia tidak akan bertawakal kepada Allah. Dengan kata lain, mustahil berkumpul pada diri seseorang dua buah keyakinan yang berlawanan, sebagaimana tidak mungkin ada dua hati di dalam satu tubuh manusia.\n\nPada masa Jahiliah sering terjadi pada bangsa Arab, untuk maksud dan dengan ucapan tertentu, mereka menjadikan istrinya sebagai ibunya. Maka bila dia mengucapkan kepada istrinya ucapan tertentu itu, jadilah istrinya sebagai ibunya yakni tidak dapat dicampurinya.\n\nMenurut kebiasaan orang-orang Arab di masa Jahiliah, apabila seorang suami mengatakan kepada istrinya, \"Anti 'alayya kadhahri ummi\" (punggungmu haram atasku seperti haramnya punggung ibuku), maka sejak suami mengucapkan perkataan itu, istrinya haram dicampurinya, seperti dia haram mencampuri ibunya. Tindakan suami seperti itu di zaman Jahiliah disebut \"dhihar\". Dalam Islam hukum ini diganti dengan hukum yang diterangkan dalam surah al-Mujadalah/58 ayat 3.\n\nDan mereka yang menzihar istrinya, kemudian menarik kembali apa yang telah mereka ucapkan, maka (mereka diwajibkan) memerdekakan seorang budak sebelum kedua suami istri itu bercampur. Demikianlah yang diajarkan kepadamu, dan Allah Mahateliti terhadap apa yang kamu kerjakan. (al-Mujadilah/58: 3)\n\nKemudian dalam ayat ini, Allah mencela satu lagi kebiasaan orang-orang Arab di masa Jahiliah, karena hal itu termasuk mengada-adakan sesuatu yang tidak benar dan tidak mempunyai dasar yang kuat, yaitu mengangkat anak (adopsi). Apabila seseorang mengangkat anak orang lain menjadi anaknya pada masa Jahiliah, maka berlakulah bagi anak itu hukum-hukum yang berlaku atas anak kandungnya sendiri, seperti terjadinya hubungan waris-mewarisi, hubungan mahram, dan sebagainya. Kebiasaan bangsa Arab Jahiliah ini pernah dilakukan Nabi Muhammad sebelum turunnya ayat ini. Beliau pernah mengangkat Zaid bin harisah menjadi anak angkatnya.\n\nZaid ini adalah putra harisah bin Syarahil dan berasal dari Bani thayyi' di Syam. Ketika terjadi peperangan antara salah satu kabilah Arab dengan Bani thayyi', Zaid kecil tertawan dan dijadikan budak. Kemudian Khalil dari suku Tihamah membeli Zaid dan lalu menjualnya kepada hakim bin ham bin Khuwailid. hakim memberikan Zaid sebagai hadiah kepada Khadijah, saudara perempuan ayahnya. Setelah Nabi Muhammad menikah dengan Khadijah, beliau tertarik kepada Zaid, maka Khadijah menghadiahkan Zaid kepada suaminya itu. \n\nMendengar kabar bahwa Zaid berada pada Muhammad, harisah, ayah Zaid, pergi dengan saudaranya ke Mekah dengan maksud menebus anaknya yang tercinta itu. Ia pun meminta kepada Muhammad agar menyerahkan Zaid. Nabi Muhammad lalu memberi keleluasaan kepada Zaid untuk memutuskan sendiri, bahkan beliau tidak mau menerima tebusan. Setelah ditanyakan kepadanya, maka Zaid memilih untuk tetap bersama Nabi Muhammad, tidak mau ikut dengan bapaknya ke negeri Syam. harisah dan saudaranya lalu berkata kepada Zaid, \"Celakalah engkau Zaid, engkau lebih memilih perbudakan dari kemerdekaan.\" Zaid menjawab, \"Sesungguhnya aku melihat kebaikan pada laki-laki ini (Muhammad), yang menjadikanku tidak sanggup berpisah dengannya, dan aku tidak sanggup memilih orang lain selain dia untuk selama-lamanya.\"\n\nNabi saw kemudian keluar menemui orang banyak dan berkata, \"Saksikanlah oleh kamu sekalian bahwa Zaid adalah anakku, aku akan mewarisinya, dan ia akan mewarisiku...\" Mendengar hal yang demikian, hati harisah dan saudaranya menjadi senang, maka dipanggillah Zaid dengan \"Zaid bin Muhammad\" sampai turun ayat ini.\n\nMenurut Qurthubi, seluruh ahli tafsir sependapat bahwa ayat ini diturunkan berhubungan dengan Zaid bin harisah itu.\n\nDiriwayatkan oleh al-Bukhari, Muslim, at-Tirmidzi, an-Nasa'i, dan imam-imam hadis yang lain dari Ibnu 'Umar bahwa ia berkata, \"Kami tidak pernah memanggil \"Zaid bin harisah\", tetapi kami memanggilnya \"Zaid bin Muhammad\" hingga turunnya ayat ini (al-Ahzab ayat 5).\" Dengan turunnya ayat ini, Nabi saw berkata, \"Engkau Zaid bin harisah.\"\n\nPada akhir ayat ini, Allah menegaskan lagi bahwa perkataan suami bahwa istrinya haram dicampurinya sebagaimana ia haram mencampuri ibunya, dan perbuatan mengangkat anak dan menjadikan kedudukannya sama dengan anak sendiri (kandung) adalah ucapan lidah saja, tidak mempunyai dasar agama atau pikiran yang benar. Oleh karena itu, ucapan tersebut tidak akan menimbulkan akibat hukum sedikit pun. Allah mengatakan yang benar, sehingga mustahil istri dapat disamakan dengan ibu, sebagaimana mustahil pula orang lain dihukum sama dengan anaknya sendiri. Semua anak itu menasabkan (membawa nama ayah sesudah nama sendiri) dirinya kepada ayah dan ibunya. Tidak mungkin seseorang mengatakan orang lain ayah dari seorang anak jika bukan keturunannya, sebagaimana tidak mungkin pula seseorang ibu mengatakan ia adalah ibu dari seorang anak, padahal ia tidak pernah melahirkannya. Oleh karena itu, Allah mengatakan perkataan yang benar dan lurus, maka ikutilah perkataan itu dan turutilah jalan lurus yang telah dibentangkan-Nya.\n\nDengan turunnya ayat ini, maka hilanglah akibat-akibat buruk yang dialami oleh istri-istri karena zihar suaminya dan haramlah hukumnya mengangkat anak dan menjadikannya mempunyai hukum yang sama dengan anak kandung. Adapun memelihara anak orang lain sebagai amal sosial untuk diasuh dan dididik dengan izin orang tuanya sendiri, tanpa waris-mewarisi, tidak menjadikannya sebagai mahram sebagaimana status anak kandung, dan masih dinasabkan kepada orang tuanya, maka hal itu tidak diharamkan, bahkan mendapat pahala.",
          "5": "Ayat ini menerangkan bahwa Allah memerintahkan agar kaum Muslimin menasabkan seorang anak hanya kepada bapak dan ibunya, karena anak itu berasal dari tulang sulbi bapaknya, kemudian dikandung dan dilahirkan oleh ibunya. Menasabkan anak kepada orang tuanya adalah hukum Allah yang wajib ditaati oleh seluruh kaum Muslimin. Sebaliknya menasabkan anak kepada orang lain yang bukan orang tuanya bukanlah hukum Allah, tetapi adalah hukum yang dibuat-buat oleh manusia sendiri, sehingga hukumnya haram.\n\nPendapat ini disepakati oleh kebanyakan ulama yang mengatakan, \"Mengangkat anak sehingga kedudukan anak angkat itu sama hukumnya dengan kedudukan anak kandung, seperti berhak mewarisi, menjadikan hubungan mahram, dan sebagainya termasuk dosa besar berdasarkan hadis:\n\nDiriwayatkan dari Sa'ad bin Abi Waqqash r.a. bahwa Rasulullah saw bersabda, \"Barang siapa yang menasabkan dirinya kepada selain bapaknya atau menasabkan budak kepada selain tuannya, maka ia berhak mendapatkan laknat Allah, para malaikat, dan manusia seluruhnya, Allah Ta'ala tidak menerima pemalingan dosa tebusan padanya. (Riwayat al-Bukhari dan Muslim)\n\nHadis Nabi saw, beliau bersabda:\n\nTidak ada seorang pun yang menasabkan kepada selain bapaknya, sedang ia mengetahui, melainkan dia telah kafir. (Riwayat al-Bukhari dan Muslim dari Abu dzarr) \n\nPada lafal yang lain, juga diriwayatkan al-Bukhari dan Muslim, Rasulullah saw bersabda:\n\nBarang siapa yang menasabkan dirinya kepada selain bapaknya, sedang ia mengetahui bahwa laki-laki itu bukan bapaknya, maka haram atasnya surga. (Riwayat al-Bukhari dan Muslim dari Sa'ad bin Abu Waqqash dan Abu Bakrah)\n\nAl-Alusi dalam Tafsir Ruh al-Ma'ani membedakan antara pengakuan dan pengasuhan anak. Pengangkatan anak yang dilakukan oleh seseorang terhadap seorang anak dan menasabkan anak itu kepadanya sehingga sama hukumnya dengan anak sendiri (kandung), mempunyai hak waris, menjadi mahram dan kerabat, hukumnya adalah haram. Adapun jika seseorang mengambil anak dan memperlakukannya seperti anak sendiri, tetapi tidak menasabkan anak itu kepadanya dan tidak menyatakan sama kedudukannya dalam hukum dengan anak sendiri, maka Allah tidak mengharamkannya.\n\nAyat ini menerangkan bahwa jika seorang anak tidak diketahui ayahnya, dan ia dipelihara oleh seorang muslim yang lain, maka hubungan pemeliharaan dengan anak itu adalah hubungan saudara seagama atau hubungan tuan dengan maulanya (hamba yang telah dimerdekakan). Oleh karena itu, dia harus memanggil anak itu dengan sebutan \"saudara\" atau \"maula\". Orang lain pun diharapkan untuk menyebutnya demikian, umpamanya \"Salim maula Huzaifah\", karena Salim ini sebelum datangnya agama Islam adalah budak Huzaifah yang tidak dikenal bapaknya.\n\nAllah lalu menutup ayat ini dengan menyatakan bahwa semua perbuatan dosa seperti menasabkan seorang anak kepada yang bukan ayahnya yang dilakukan sebelum ayat ini turun, asalkan dihentikan setelah turunnya, akan diampuni Allah. Allah Maha Pengampun lagi Maha Penyayang kepada hamba-hamba-Nya.",
          "6": "Ayat ini menerangkan kedudukan Nabi Muhammad di antara umatnya. Diterangkan bahwa sekalipun orang-orang yang beriman itu mengutamakan diri mereka, tetapi Nabi Muhammad lebih banyak memperhatikan, mementingkan, dan mengutamakan mereka. Nabi selalu menolong dan membantu mereka, dan selalu berkeinginan agar mereka menempuh jalan yang lurus yang dapat menyampaikan mereka kepada kebahagiaan yang abadi. Oleh karena itu, sebenarnya Nabi lebih berhak atas diri mereka sendiri. Cinta Nabi kepada kaum Muslimin melebihi cinta beliau terhadap makhluk Allah manapun. Dengan demikian, hendaklah kaum Muslimin mengikuti segala perintahnya. \n\nNabi adalah pemimpin kaum Muslimin dalam kehidupan duniawi dan penuntun mereka ke jalan Allah. Apabila beliau mengajak kaum Muslimin berperang di jalan Allah, hendaklah mereka segera mengikutinya, tidak perlu menunggu izin dari ibu bapak. Mereka juga hendaknya selalu bersedia menjadi tebusan, perisai, dan pemelihara Nabi.\n\nPada hadis yang lain diterangkan tentang kepemimpinan Nabi terhadap kaum Muslimin:\n\nSesungguhnya Rasulullah saw bersabda, \"Tidak seorangpun dari orang-orang yang beriman, kecuali akulah yang paling dekat kepadanya di dunia dan di akhirat. Bacalah firman Allah, jika kamu sekalian menghendaki, \"Nabi itu lebih utama bagi orang-orang mukmin dibandingkan diri mereka sendiri.\" Maka barang siapa di antara orang-orang yang beriman (mati) dan meninggalkan harta, maka harta itu hendaknya diwarisi 'ashabah (ahli waris)nya. Dan barang siapa yang meninggalkan hutang atau keluarga, maka hendaklah datang kepadaku, maka akulah orang yang akan mengurus keadaannya.\" (Riwayat al-Bukhari dari Abu Hurairah) \n\nBerdasarkan ayat dan hadis di atas, para ulama sependapat bahwa setelah Rasulullah meninggal dunia, maka imamlah yang menggantikan kedudukan beliau. Oleh karena itu, imam wajib membayar hutang orang-orang fakir yang meninggal dunia, sebagaimana Rasulullah telah melakukannya. Imam membayar hutang itu dengan mengambil dananya dari Baitul Mal atau Kas Negara.\n\nKarena Rasulullah adalah bapak dari kaum Muslimin, maka istri-istri beliau pun adalah ibu-ibu mereka. Maksudnya ialah menempati kedudukan ibu, dalam kewajiban memuliakan dan menghormatinya, dan haram menikahinya. Adapun dalam hal yang lain, seperti hubungan waris-mewarisi, hukum melihat auratnya atau berkhalwat dengannya, sama hukumnya dengan perempuan lain yang tidak memiliki hubungan mahram.\n\nPrinsip ini tidaklah bertentangan dengan firman Allah:\n\nMuhammad itu bukanlah bapak dari seseorang di antara kamu, tetapi dia adalah utusan Allah dan penutup para nabi. (al-Ahzab/33: 40)\n\nKarena yang dimaksud ialah bahwa Nabi Muhammad itu adalah bapak dari seluruh orang-orang yang beriman, bukan bapak angkat dari seseorang.\n\nKemudian ayat ini menerangkan bahwa hubungan kerabat lebih berhak untuk menjadi sebab mendapatkan warisan daripada hubungan persaudaraan, keagamaan, atau karena berhijrah. Sebagaimana diketahui bahwa kaum Muslimin pada permulaan Islam di Medinah saling mewarisi dengan jalan persaudaraan yang dijalin oleh Nabi, bukan dengan dasar hubungan kerabat. Oleh karena itu, seorang dari Muhajirin memperoleh warisan dari seorang Anshar, sekalipun mereka tidak ada hubungan kerabat. Mereka itu waris-mewarisi semata-mata karena hubungan persaudaraan yang telah dijalin oleh Nabi. \n\nHubungan semacam itu dilakukan Nabi karena orang-orang Muhajirin yang baru pindah dari Mekah ke Medinah dalam keadaan miskin, karena mereka tidak sempat membawa harta benda mereka dari Mekah. Sedangkan orang-orang Anshar, sebagai penduduk asli Medinah, tentu sewajarnya menjadi penolong kaum Muhajirin yang miskin ini. Waktu itu tugas utama kaum Muslimin ialah memperkuat persatuan antara kaum Muhajirin dengan kaum Anshar untuk menghadapi musuh yang selalu mencari kesempatan untuk menghancurkan mereka. Memperkuat hubungan antara Muhajirin dan Anshar adalah salah satu jalan untuk memperkuat persatuan itu. Maka Nabi saw memperkuat hubungan itu dengan mempersaudarakan kaum Muhajirin dengan kaum Anshar. Persaudaraan itu dijadikannya sama dengan persaudaraan yang berdasar atas pertalian kerabat, sehingga antara Muhajirin dan Anshar dapat waris-mewarisi. Oleh karena itu, Nabi mempersaudarakan Abu Bakar ash-siddiq, seorang Muhajirin, dengan Kharijah bin Zaid, seorang Anshar. Demikian pula Zubair dipersaudarakan dengan Ka'ab bin Malik dan Umar bin Khaththab dengan 'Utbah bin Malik al-Anshari, Abu 'Ubaidah dengan Sa'ad bin Mu'az, dan lain-lain.\n\nDiriwayatkan oleh Hisyam bin 'Urwah dari bapaknya, dari Zubair bahwa ia berkata, \"Sesungguhnya kami seluruh orang Quraisy yang datang ke Medinah tanpa harta, dan mendapati golongan Anshar sebagai teman yang paling baik, maka kami mengadakan ikatan persaudaraan dengan mereka, dan saling berhak waris mewarisi. Maka Rasulullah saw mempersaudarakan Abu Bakar dengan Kharijah bin Zaid, aku dengan Ka'ab bin Malik.\"\n\nSetelah kaum Muslimin menjadi kuat dan orang Muhajirin serta orang-orang Anshar mempunyai kehidupan yang baik, maka turunlah ayat yang menghapus hukum persaudaraan seagama dan hijrah sebagai dasar waris-mewarisi. Allah menetapkan hubungan kerabat sebagai dasar hukum warisan, sedangkan hubungan antara kaum Muslimin dikembalikan kepada kedudukan semula, yaitu hubungan seagama, sekeyakinan, tolong menolong yang tidak membawa kepada waris-mewarisi, sebagaimana diterangkan dalam firman-Nya:\n\nSesungguhnya orang-orang mukmin itu bersaudara. (al-hujurat/49: 10)\n\nHadis Nabi saw:\n\nTidak beriman salah seorang kamu hingga ia menginginkan pada saudaranya apa yang diinginkannya pada dirinya sendiri. (Riwayat al-Bukhari, Muslim, Ahmad, dan an-Nasa'i dari Anas) \n\nSelanjutnya Allah menerangkan bahwa tidaklah berdosa seorang mukmin berbuat suatu kebaikan kepada orang mukmin yang lain, yang telah terjalin antara mereka hubungan kasih sayang, hubungan seagama dan sebagainya. Kebaikan itu ialah berupa wasiat untuk mereka, karena tidak lagi berhak waris-mewarisi dengan turunnya ayat ini. Kadar wasiat ini telah ditetapkan oleh hadis, yaitu tidak lebih dari sepertiga dari seluruh harta peninggalan.\n\nMenetapkan \"ulu al-arham\" (kerabat) sebagai dasar hukum waris-mewarisi adalah keputusan Allah yang ditetapkan di dalam Al-Qur'an. Oleh karena itu, hukum tersebut tidak boleh ditukar atau diganti oleh siapa pun.",
          "7": "Ayat ini menerangkan bahwa Allah mengingatkan kepada Nabi Muhammad bahwa Dia telah menerima janji dari Nuh, Ibrahim, Musa, dan Isa bahwa mereka benar-benar akan menyampaikan agama Allah kepada manusia. Mereka juga akan saling membenarkan dalam menyampaikan risalah itu, yaitu dengan cara mengakui para nabi yang terdahulu dari mereka sebagai nabi-nabi Allah.\n\nAyat ini senada dengan firman Allah:\n\nDan (ingatlah), ketika Allah mengambil perjanjian dari para nabi, \"Manakala Aku memberikan kitab dan hikmah kepadamu lalu datang kepada kamu seorang rasul yang membenarkan apa yang ada pada kamu, niscaya kamu akan sungguh-sungguh beriman kepadanya dan menolongnya.\" Allah berfirman, \"Apakah kamu setuju dan menerima perjanjian dengan-Ku atas yang demikian itu?\" Mereka menjawab, \"Kami setuju.\" Allah berfirman, \"Kalau begitu bersaksilah kamu (para nabi) dan Aku menjadi saksi bersama kamu.\" (ali 'Imran/3: 81) \n\nDalam ayat ini hanya disebutkan para nabi yang termasuk ulul azmi, yaitu Nuh, Ibrahim, Musa, Isa, dan Muhammad, karena merekalah yang mempunyai syariat dan kitab suci.\n\nJanji yang diberikan oleh para nabi itu adalah janji yang kuat dan berat yang harus ditepati. Di akhirat nanti, Allah akan menanyakan kepada para nabi itu dan umatnya masing-masing tentang pelaksanaan tugas yang telah mereka janjikan.\n\nDalam ayat yang lain, Allah berfirman:\n\nMaka pasti akan Kami tanyakan kepada umat yang telah mendapat seruan (dari rasul-rasul) dan Kami akan tanyai (pula) para rasul. (al-A'raf/7: 6)",
          "8": "Pada ayat ini diterangkan penyebab Allah mengambil janji yang kuat dari para nabi untuk menyampaikan agama Allah kepada manusia, dan untuk saling menolong di antara mereka dengan saling mengatakan kepada umatnya bahwa mereka semua adalah rasul Allah. Sebabnya ialah agar Allah dapat menanyakan kepada para nabi itu di akhirat nanti tugas yang diberikan kepada mereka, apakah mereka telah menjalankan dengan baik, atau belum, dan bagaimana sambutan umat-umat mereka terhadap seruan itu. Demikian pula agar Allah dapat menanyakan kepada umat-umat itu sendiri di akhirat nanti tentang sikap mereka terhadap seruan para rasul. Dengan demikian, Allah menyediakan azab yang pedih bagi orang-orang yang mengingkari seruan para rasul, sebagaimana Dia menyediakan pahala yang besar bagi orang-orang yang memperkenankan seruan para rasul itu.",
          "9": "Pada ayat ini, Allah mengingatkan kepada kaum Muslimin akan nikmat besar yang telah dilimpahkan-Nya kepada mereka pada Perang Ahzab ketika mereka dikepung rapat oleh tentara yang bersekutu yang terdiri dari tentara kaum Quraisy, Bani Gathafan, Bani an-Nadhir yang telah dibuang Rasulullah ke Khaibar dan tentara-tentara yang lain yang datang menyerang mereka ke Medinah. Setelah sebulan terkepung, maka Allah menghalau musuh-musuh mereka itu dengan tentara malaikat dan topan yang amat dingin dan kencang di malam yang sangat dingin pula, sehingga menerbangkan kemah-kemah tentara itu. Pada waktu itu, timbullah kegentaran dan ketakutan dalam hati musuh-musuh itu, sehingga salah seorang pemimpin mereka yang bernama thulaihah bin Khawailid al-Asadi berkata, \"Muhammad telah menyihir kamu, maka selamatkan dirimu, selamatkan dirimu!\" Dengan demikian, Perang Ahzab ini dimenangkan oleh kaum Muslimin tanpa terjadi pertempuran, karena musuh telah dihalau oleh tentara malaikat dan topan angin dingin yang amat kencang itu.\n\nPada akhir ayat ini, Allah menerangkan bahwa Dia melihat dan mengetahui segala yang dikerjakan kaum Muslimin dalam Perang Ahzab itu, seperti menggali parit, menyusun taktik, dan strategi peperangan untuk menegakkan agama-Nya. Allah juga mengetahui segala penderitaan yang mereka alami selama dikepung musuh, tetapi semua penderitaan itu mereka hadapi dengan tabah dan sabar. Semua yang dialami kaum Muslimin itu akan mendapat balasan yang berlipat ganda dari Allah.",
          "10": "Ayat ini menerangkan bahwa Allah mengetahui ketika tentara yang bersekutu datang dari bawah lembah, yaitu dari sebelah timur yang terdiri dari golongan Gathafan, penduduk Nejed, dan ikut pula beserta mereka Bani Quraidhah dan Bani an-Nadhir. Allah mengetahui pula kedatangan golongan yang bersekutu lain yang datang dari atas lembah dari sebelah barat yang terdiri dari orang-orang Quraisy dan pengikut-pengikutnya dari bermacam-macam suku dengan Bani Kinanah dan penduduk Tihamah. Dalam keadaan musuh mulai mengepung itu, timbullah rasa takut dan gentar terutama dalam hati orang-orang munafik yang ikut bersama-sama kaum Muslimin. Mata mereka terbelalak dan kerongkongan mereka terasa tersumbat akibat ketakutan, dan timbul dalam hati mereka was-was, ragu-ragu, dan berbagai prasangka. Bahkan di antara mereka ada yang telah menduga bahwa kaum Muslimin akan dikalahkan oleh tentara sekutu, mengingat jumlah mereka yang jauh lebih banyak jika dibandingkan dengan jumlah kaum Muslimin.\n\nAdapun orang-orang yang beriman percaya benar akan janji Allah, bahwa Rasulullah saw dan kaum Muslimin akan memenangkan peperangan itu, dan pertolongan Allah pasti datang, serta mereka percaya benar akan kekuasaan dan kebesaran-Nya. Sedang orang-orang munafik berprasangka bahwa kaum Muslimin dan agama Islam akan hancur dan binasa. Kaum musyrik Mekah akan menaklukkan kota Medinah dan mengembalikannya kepada keadaan masa Jahiliah.",
          "11": "Dalam keadaan yang demikian mencekam, Allah menguji kekuatan iman orang-orang yang beriman, sehingga nyata mana yang benar-benar beriman, yang memurnikan ketaatan hanya kepada Allah saja, percaya bahwa Muhammad saw adalah rasul Allah, dan percaya pula akan kemenangan Islam dan kaum Muslimin, serta mana yang goyah dan rapuh imannya, yang mengikuti Rasulullah hanya semata-mata hendak mencari keuntungan diri mereka saja. Seakan-akan Perang Ahzab ini merupakan suatu seleksi bagi kaum Muslimin, tentang siapa yang benar-benar kawan dan siapa yang sungguh-sungguh lawan.\n\n(12) Menurut riwayat, thu'mah bin Ubairiq dan tujuh puluh orang yang lain mengatakan, \"Bagaimana pula yang dijanjikan kepada kita penaklukan kerajaan Persia dan Romawi, padahal pada saat ini untuk buang air besar saja tidak seorang pun di antara kita yang sanggup.\" Ucapan ini sengaja mereka lontarkan tatkala mereka mendengar berita tentang peristiwa yang terjadi di waktu Rasulullah menggali parit dan mencangkuli batu yang memancarkan cahaya sebagaimana yang telah diterangkan. Maka Allah menurunkan ayat ini.\n\nDalam ayat ini diterangkan hasil ujian Allah kepada kaum Muslimin, yaitu dengan tercetusnya perkataan orang-orang munafik seperti Mu'attib bin Qusyair dan orang-orang yang lain yang masih lemah imannya, \"Semua yang dijanjikan Allah dan Rasul-Nya kepada kita, seperti akan mendapat kemenangan, memperoleh kebahagiaan hidup, dan sebagainya, tidak lain hanyalah tipu daya dan janji-janji kosong saja, bahkan janji itu menimbulkan kesengsaraan dan malapetaka bagi kita semuanya. Muhammad mengatakan bahwa kerajaan Persia dan Romawi akan takluk ke bawah kekuasaan kaum Muslimin, tetapi kenyataannya sekarang, kaum Muslimin yang akan menaklukkan itu sedang dikepung rapat oleh tentara yang bersekutu dan akan mengalami kehancuran dan kemusnahan.\"",
          "12": "Dalam keadaan yang demikian mencekam, Allah menguji kekuatan iman orang-orang yang beriman, sehingga nyata mana yang benar-benar beriman, yang memurnikan ketaatan hanya kepada Allah saja, percaya bahwa Muhammad saw adalah rasul Allah, dan percaya pula akan kemenangan Islam dan kaum Muslimin, serta mana yang goyah dan rapuh imannya, yang mengikuti Rasulullah hanya semata-mata hendak mencari keuntungan diri mereka saja. Seakan-akan Perang Ahzab ini merupakan suatu seleksi bagi kaum Muslimin, tentang siapa yang benar-benar kawan dan siapa yang sungguh-sungguh lawan.",
          "13": "Di antara mereka, seperti 'Abdullah bin Ubay dan kawan-kawannya, ada pula yang mengatakan, \"Hai penduduk kota Medinah, tempat ini bukanlah tempat yang harus kita tempati, maka kembalilah ke rumahmu masing-masing, agar kamu tidak ditimpa malapetaka dan kesengsaraan serta tidak mati terbunuh oleh musuh-musuh yang sedang mengepung kita.\"\n\nSebagian ahli tafsir ada yang menafsirkan, \"Hai penduduk Medinah, tidak ada tempat bagi kamu sekalian untuk tetap menganut agama Muhammad. Kembalilah kamu kepada agamamu dahulu, dan serahkanlah Muhammad dan pengikut-pengikutnya kepada musuh-musuhnya yang sedang mengepung itu, sehingga keselamatan kamu semua terjamin.\"\n\nKarena perkataan dan ajakan pemimpin-pemimpin munafik dan Yahudi itu, maka sebagian dari mereka ada yang terpengaruh dan meminta kepada Nabi saw agar dapat meninggalkan medan perang dan kembali ke rumah mereka. Di antara yang meminta itu ialah Bani harisah. Alasan yang mereka kemukakan ialah rumah-rumah mereka berada di tempat yang berdekatan dengan pangkalan-pangkalan pasukan musuh sedang dindingnya tidak kuat, mereka khawatir musuh akan mengambil harta benda mereka.\n\nPada akhir ayat ini, Allah menerangkan bahwa semua alasan yang dikemukakan oleh orang-orang munafik dan Yahudi adalah alasan-alasan yang dibuat-buat saja. Alasan-alasan itu mereka kemukakan semata-mata untuk menghindarkan diri dari ikut berperang beserta Nabi dan kaum Muslimin, karena mereka tidak melihat suatu keuntungan yang akan mereka peroleh.",
          "14": "Ayat ini menerangkan kelemahan hati dan keyakinan orang-orang munafik dan Yahudi yang sedang menerima cobaan Allah itu. Mereka tidak sanggup mengatasi kesukaran-kesukaran yang sedang mereka hadapi, dan tidak sanggup menghadapi bahaya dan ancaman yang datang kepada mereka, sehingga mereka meminta kepada Rasulullah saw agar diizinkan meninggalkan medan pertempuran.\n\nKeadaan hati dan keyakinan mereka itu dilukiskan Allah sebagai berikut, \"Seandainya tentara sekutu itu memasuki rumah-rumah orang munafik dan Yahudi dari segenap penjuru, merusak dan merampas apa yang ada di dalamnya, menganiaya dan membunuh anak-anak dan keluarga mereka, meminta mereka agar kembali memeluk agama syirik, mengadakan keonaran dan menghantam kaum Muslimin dari belakang, tentulah mereka membiarkan tindakan musuh itu dan mengikuti segala yang mereka kehendaki. Hal itu diakibatkan karena ketakutan dan tidak adanya cita-cita dalam hati mereka, kecuali mencari kesenangan duniawi dan keuntungan pribadi belaka.\"\n\nDari ayat ini dipahami bahwa ketakutanlah yang merupakan sebab, sehingga orang-orang munafik dan Yahudi tidak mempunyai pendirian. Ketakutan itu timbul di dalam hati mereka karena tidak ada keimanan sedikit pun. Padahal jika mereka berpikir dengan benar dan menimbang untung ruginya, mereka lebih selamat jika ikut andil dalam peperangan.",
          "15": "Ayat ini menerangkan bahwa orang-orang yang minta izin meninggalkan medan pertempuran itu pernah berjanji dengan Rasulullah saw bahwa mereka tidak akan mengkhianatinya dan akan ikut berperang bersama-sama kaum Muslimin menghadapi kaum musyrik. Akan tetapi, akhirnya mereka mengingkari janjinya.\n\nMenurut riwayat, Bani harisah pernah lari dari medan Perang Uhud, kemudian mereka minta agar Nabi memaafkan kesalahan mereka. Mereka berjanji tidak akan lari lagi dari medan pertempuran dan akan berjuang dengan Nabi dan kaum Muslimin.\n\nPada akhir ayat ini, Allah menegaskan bahwa mereka yang telah berjanji itu akan diminta pertanggungjawaban tentang apa yang telah diucapkannya. Di hari Kiamat, mereka akan diberi pembalasan yang setimpal dengan tindakan mereka itu.",
          "16": "Pada ayat ini, Allah memerintahkan kepada Rasulullah saw agar menyampaikan kepada orang-orang yang menghindarkan diri dan lari dari medan pertempuran itu, bahwa tindakan mereka tidak akan ada manfaatnya sedikit pun. Mereka tidak akan dapat menghindarkan ajal yang telah ditetapkan Allah, tidak dapat mengelakkan pembunuhan yang ditetapkan Allah terhadap seseorang, yang akan dilakukan oleh musuh-musuhnya. Segala sesuatu itu telah ditetapkan Allah, tidak seorang pun yang dapat mengubahnya.\n\nSeandainya seseorang dapat lari dari pertempuran dan hal itu memberi manfaat kepadanya, serta dapat menghindarkan kematian dirinya, maka yang demikian itu hanyalah bersifat sementara. Hidup di dunia ini adalah hidup yang fana, walaupun dirasakan lama, pada hakikatnya adalah singkat sekali jika dibandingkan dengan kehidupan akhirat yang abadi.",
          "17": "Menurut riwayat lain bahwa yang mengajak itu adalah orang-orang Yahudi. Mereka mengajak orang-orang munafik menghindarkan diri dari Nabi dan orang-orang Muslimin dengan mengatakan, \"Apabila Abu Sufyan menang, tentulah Muhammad dan pengikut-pengikutnya akan dibinasakan semuanya.\" Karena itu turunlah ayat ini.\n\nPada ayat ini, Allah memerintahkan kepada Nabi Muhammad untuk menjawab perkataan orang-orang yang mengatakan bahwa mereka akan selamat bila mereka meninggalkan medan pertempuran. Allah berfirman, \"Tidak seorang pun di antara kamu yang sanggup menghindarkan diri dari pembunuhan atau kesengsaraan jika Allah telah menetapkannya. Demikian pula, tidak seorang pun yang dapat mendatangkan sesuatu kebaikan kepada seseorang jika Allah tidak menghendakinya. Manfaat dan kemelaratan itu hanya Allah yang menetapkannya, tidak seorang pun yang sanggup mengganti atau mengubahnya. Oleh karena itu, orang-orang munafik dan Yahudi yang mengkhianati Nabi tidak akan mendapatkan orang yang dapat menolong dan mengelakkan bencana yang akan menimpa mereka.\n\nMenurut suatu riwayat, 'Abdullah bin Ubay dan kawan-kawannya, orang-orang munafik dan Yahudi berkata kepada kaum Muslimin, \"Muhammad dan pengikut-pengikutnya sangat sedikit jika dibandingkan dengan jumlah kaum Quraisy dan sekutu-sekutunya. Oleh karena itu, mereka pasti binasa, dan marilah kita menjauhkan diri dari padanya.\"",
          "18": "Ayat ini menerangkan bahwa Allah mengetahui dengan sesungguhnya orang yang menghambat manusia mengikuti Rasulullah saw berperang di jalan-Nya. Dia mengetahui pula orang-orang yang enggan dan minta izin kepada Rasulullah saw untuk tidak ikut berperang, serta orang-orang yang mengajak penduduk Medinah agar tidak ikut berperang bersamanya.\n\nSementara itu, ada pula orang-orang yang ikut berperang sebentar saja sekedar untuk memperlihatkan kepada kaum Muslimin bahwa sebenarnya mereka itu termasuk orang yang ikut berperang. Akan tetapi, di saat kaum Muslimin lengah, mereka menghilang dengan diam-diam dan kembali ke rumahnya masing-masing.",
          "19": "Pada ayat ini, Allah menyebutkan sifat-sifat orang-orang yang selalu menghindarkan diri dari ikut berperang bersama Nabi saw:\n\n1. Mereka tidak menolong Muhammad dan kaum Muslimin dalam menghadapi musuh, baik pertolongan berupa harta benda maupun jiwa raga.\n\n2. Apabila musuh-musuh telah menyerang dan orang-orang yang beriman telah bertempur dengan gagah berani menolak serangan musuh, mereka menoleh ke kiri dan ke kanan karena ketakutan dan mencari jalan dan kesempatan untuk lari dari medan pertempuran menghindari kematian.\n\n3. Apabila pertempuran telah usai dan mereka merasa telah aman, mereka bersikap sombong dan membangga-banggakan jasa dan keberanian dalam medan pertempuran padahal semua itu adalah omong kosong belaka yang menyakitkan hati. Seakan-akan merekalah orang-orang yang berperang mati-matian sampai kemenangan tercapai, padahal semua yang mereka katakan itu adalah dusta belaka.\n\n4. Mereka sangat rakus kepada harta rampasan yang telah diperoleh kaum Muslimin, dan tidak mau melepaskan sesuatu yang telah mereka dapat. Padahal sebelumnya mereka tidak mau mengeluarkan harta untuk menolong Nabi saw.\n\nOrang-orang yang bersifat seperti yang disebutkan di atas itu pada hakikatnya adalah orang-orang yang tidak beriman kepada Allah dan Rasul-Nya, tidak beramal dengan tulus ikhlas dan tidak mau berkorban sedikit pun, karena mereka adalah orang-orang munafik. Karena sifat dan sikap mereka yang demikian itu, maka Allah menghapus segala pahala amal perbuatan mereka dan menjadikannya seolah-olah debu yang beterbangan yang tidak ada artinya sama sekali. Menghapuskan pahala amal perbuatan orang-orang munafik itu bukanlah suatu yang sukar bagi Allah, tetapi amat mudah bagi-Nya, karena Dia Mahakuasa lagi Maha Mengetahui segala sesuatu.",
          "20": "Karena sangat ketakutan, orang-orang munafik mengira bahwa tentara sekutu masih berada di medan pertempuran, padahal tentara-tentara itu telah lari berserakan, kembali ke negeri masing-masing. Hal ini menunjukkan bahwa orang-orang munafik adalah orang-orang pengecut dan tidak beriman sehingga tidak ikut berperang, seakan-akan mereka tidak hadir di sana. Oleh karena itu, mereka tidak mengetahui gerak gerik musuh. Dalam pada itu, jika tentara sekutu itu kembali lagi menyerang, mereka menginginkan agar mereka berada di Badiyah (padang pasir) yang jauh dari kota bersama-sama Arab Badui dan penduduk padang pasir, agar mereka tidak terkena bahaya peperangan. Bagi mereka cukuplah kiranya bila dapat bertanya kepada orang-orang yang datang ke tempat mereka tentang keadaan Nabi dan kaum Muslimin.\n\nSelanjutnya Allah menerangkan bahwa pada peperangan yang telah lewat itu, andaikata orang-orang munafik tidak meninggalkan medan peperangan dan tetap bersama kaum Muslimin di garis depan, kemudian terjadi pertempuran yang dahsyat, maka mereka juga tidak akan ikut berperang. Kalaupun ikut berperang, mereka berperang dengan tidak sepenuh hati dan keimanan. Mereka akan melawan musuh sekedar memenuhi permintaan Nabi saja.",
          "21": "Pada ayat ini, Allah memperingatkan orang-orang munafik bahwa sebenarnya mereka dapat memperoleh teladan yang baik dari Nabi saw. Rasulullah saw adalah seorang yang kuat imannya, berani, sabar, dan tabah menghadapi segala macam cobaan, percaya sepenuhnya kepada segala ketentuan Allah, dan mempunyai akhlak yang mulia. Jika mereka bercita-cita ingin menjadi manusia yang baik, berbahagia hidup di dunia dan di akhirat, tentulah mereka akan mencontoh dan mengikutinya. Akan tetapi, perbuatan dan tingkah laku mereka menunjukkan bahwa mereka tidak mengharapkan keridaan Allah dan segala macam bentuk kebahagiaan hakiki itu.",
          "22": "Pada ayat ini, Allah menerangkan sikap dan tindakan kaum Muslimin dalam menghadapi Perang Ahzab. Mereka bekerja dan berjuang semata-mata karena Allah dan mengikuti perintah Nabi, bukan karena kepentingan diri sendiri. Seluruh harta bahkan jiwa raga mereka serahkan kepada Nabi untuk kepen-tingan perjuangan. Mereka berjuang dengan tabah dan sabar. Semakin besar bahaya mengancam, semakin kuat iman dan ketabahan mereka. Ketika mereka melihat keadaan tentara sekutu yang jumlahnya sangat besar dan akan menyerbu mereka, sedang jumlah mereka hanya sedikit, mereka berkata, \"Inilah yang telah dijanjikan Allah dan Rasul Nya kepada kita, berupa ujian dan cobaan, sebagai pendahuluan dari kemenangan yang akan datang. Oleh karena itu, kita harus tabah dan sabar dalam menghadapinya.\"\n\nPada ayat yang lain diterangkan syarat-syarat kebahagiaan dan kemenangan yang akan diperoleh orang-orang yang beriman. Allah berfirman:\n\nAtaukah kamu mengira bahwa kamu akan masuk surga, padahal belum datang kepadamu (cobaan) seperti (yang dialami) orang-orang terdahulu sebelum kamu. Mereka ditimpa kemelaratan, penderitaan dan diguncang (dengan berbagai cobaan), sehingga Rasul dan orang-orang yang beriman bersamanya berkata, \"Kapankah datang pertolongan Allah?\" Ingatlah, sesungguhnya pertolongan Allah itu dekat. (al-Baqarah/2: 214)\n\nDan firman-Nya lagi:\n\nApakah manusia mengira bahwa mereka akan dibiarkan hanya dengan mengatakan, \"Kami telah beriman,\" dan mereka tidak diuji? (al- 'Ankabut/29: 2)\n\nDiriwayatkan oleh Ibnu Kasir bahwa pada waktu menggali parit sebelum tentara sekutu datang, Rasulullah saw pernah menyampaikan bahwa Jibril mengatakan kepadanya bahwa kerajaan Persia dan Romawi akan takluk di bawah kekuasaan kaum Muslimin. Mendengar kabar berita itu, kaum Muslimin sangat senang karena mereka percaya bahwa itu adalah janji Allah. \n\nTatkala datang tentara sekutu mengepung, mereka menganggap bahwa kedatangan tentara sekutu itu adalah ujian dan cobaan bagi mereka sebelum memperoleh kemenangan dan sebelum mereka menaklukkan Persia dan Romawi, sehingga mereka mengucapkan, \"Benar apa yang dijanjikan Allah itu dengan meluaskan agama Islam ke seluruh penjuru dunia di kemudian hari, dan benar pula apa yang diisyaratkan Allah untuk mencapai kemenangan dan kebahagiaan itu, yaitu bertawakal dan sabar dalam menerima cobaan dan halangan.\"",
          "23": "Dalam suatu hadis yang diriwayatkan oleh Ahmad, Muslim, at- Tirmidzi, an-Nasa'i, dan imam-imam hadis yang lain dari sahabat Anas, ia berkata, \"Pamanku Anas bin an-Nadhar, tidak ikut Perang Badar, maka ia merasa sedih dan kecewa. Ia berkata, 'Aku tidak hadir pada peperangan yang pertama kali diikuti Rasulullah saw. Sesungguhnya jika Allah memberikan kesempatan kepadaku mengikuti peperangan bersama Rasulullah sesudah ini, tentulah Allah Taala akan melihat apa yang akan aku lakukan. Maka pamanku dapat ikut serta dalam Perang Uhud. Dalam perjalanan menuju Uhud, pamanku bertemu dengan Sa'ad bin Mu'adh, dan Sa'ad bertanya kepadanya, 'Hai Abu 'Amr, hendak ke manakah engkau? Pamanku menjawab, 'Mencari bau surga yang akan aku peroleh di Perang Uhud nanti. Maka pamanku terus ke Uhud dan gugur sebagai syuhada di sana. Pada tubuhnya terdapat kira-kira 80 bekas pukulan, tusukan tombak, dan lubang anak panah.\" Maka turunlah ayat ini.\n\nAllah menerangkan bahwa di antara kaum Muslimin yang benar-benar beriman kepada Allah dan Rasul-Nya, ada orang-orang yang menepati janjinya. Mereka telah berjuang dengan seluruh jiwa dan hartanya, di antara mereka ada yang mati syahid di Perang Badar, Perang Uhud, Perang Khandaq, dan peperangan-peperangan lainnya, sedang sebagian yang lain ada yang menunggu-nunggu dipanjangkan umurnya, menunggu ketetapan Allah Yang Maha Esa. Orang-orang yang masih hidup ini, sekali-kali tidak akan berubah janjinya kepada Allah, akan tetap ditepatinya janjinya selama hayat dikandung badan.\n\nDalam Tafsir al-Kasysyaf dijelaskan bahwa beberapa orang sahabat ada yang bernazar: jika mereka ikut perang bersama Rasulullah, mereka tidak akan mundur dan tetap bertahan sampai gugur sebagai syuhada. Di antara sahabat yang berjanji itu ialah Usman bin Affan, thalhah bin 'Ubaidillah, Sa'id bin Zaid, hamzah, Mush'ab bin 'Umair, dan sahabat-sahabat yang lain.",
          "24": "Pada ayat ini, Allah menerangkan bahwa sebab adanya ujian dan cobaan bagi orang-orang yang beriman ialah untuk membedakan yang jelek dengan yang baik, yang benar-benar beriman dengan yang kafir. Ujian ini juga bertujuan untuk menyatakan dan menampakkan apa yang berada dalam hati mereka yang sebenarnya. Dalam hal ini, Allah berfirman:\n\nDan sungguh, Kami benar-benar akan menguji kamu sehingga Kami mengetahui orang-orang yang benar-benar berjihad dan bersabar di antara kamu; dan akan Kami uji perihal kamu. (Muhammad/47: 31)\n\nDan firman Allah:\n\nAllah tidak akan membiarkan orang-orang yang beriman sebagaimana dalam keadaan kamu sekarang ini, sehingga Dia membedakan yang buruk dari yang baik. (ali 'Imran/3: 179)\n\nKemudian setelah jelas keadaan mereka, maka Allah memberi pahala kepada orang-orang yang benar-benar menepati janjinya, dan mengazab orang-orang munafik yang tidak menepati janjinya. Sekalipun demikian pintu tobat masih terbuka bagi orang-orang munafik itu, yaitu jika mereka beriman, menepati janjinya dan mengerjakan amal saleh. Allah akan mengampuni dosa-dosa yang telah diperbuatnya dahulu.\n\nPada akhir ayat ini, Allah menegaskan kepada hamba-hamba-Nya bahwa Dia Maha Pengampun lagi Maha Penyayang, menghapus segala dosa orang-orang yang benar-benar bertobat, seakan-akan dosa itu tidak pernah diperbuatnya. Dari ayat ini dipahami bahwa pintu tobat itu selalu terbuka, bagi setiap hamba yang melakukannya. Oleh karena itu, hendaklah kaum Muslimin selalu melakukannya.",
          "25": "Pada ayat ini, kembali Allah menerangkan tentang nikmat besar yang telah dilimpahkan-Nya kepada kaum Muslimin di Perang Ahzab, sehingga mereka lepas dari bahaya kehancuran. Nikmat itu ialah Allah telah mengirimkan kepada mereka bala bantuan berupa angin kencang yang sangat dingin dan bala tentara malaikat yang tidak kelihatan. Akibatnya orang-orang yang ingkar kepada Allah dan Rasul-Nya, yaitu kaum Quraisy beserta pengikut-pengikutnya, Gathafan dan pengikut-pengikutnya, golongan Yahudi, dan kaum munafik, tidak memperoleh apa yang mereka inginkan, bahkan mereka lari tunggang-langgang mencari keselamatan dirinya, kembali ke kampung halamannya masing-masing.\n\nDiriwayatkan oleh al-Bukhari dan Muslim dari Abu Hurairah bahwa Rasulullah saw bersabda:\n\nTidak ada Tuhan selain Allah sendiri. Dia menepati janji-Nya, menolong hamba-Nya, memenangkan tentara-Nya, menghancurkan tentara yang bersekutu sendirian, maka tidak ada lagi sesuatu pun sesudahnya.\n\nPada hadis yang lain al-Bukhari dan Muslim dari 'Abdullah bin Abu Aufa, ia berkata, \"Rasulullah saw berdoa kepada Allah:\n\n\"Wahai Tuhan yang telah menurunkan Al-Qur'an, amat cepat hisabnya, hancurkanlah tentara yang bersekutu itu, wahai Tuhan, hancurkanlah mereka dan goncangkanlah mereka.\"\n\nMenurut riwayat Muhammad bin Ishaq, tatkala tentara yang bersekutu telah lari dan meninggalkan parit itu, Rasulullah saw bersabda:\n\nOrang-orang Quraisy sekali-kali tidak akan memerangi kamu sesudah tahun ini, tetapi kamulah yang akan memerangi mereka.\n\nPerkataan Rasulullah ini terbukti di kemudian hari. Setelah Perang Ahzab, orang-orang musyrik tidak pernah lagi memerangi kaum Muslimin, tetapi Nabi dan kaum Musliminlah yang memerangi mereka, sampai Mekah dapat ditaklukkan. Oleh karena itu, dapat dikatakan bahwa peperangan Ahzab merupakan titik puncak kesulitan yang dihadapi Nabi dan kaum Muslimin dalam menghadapi orang-orang musyrik dalam menyebarkan agama Islam. Sekalipun kesulitan-kesulitan masih ada, tetapi tidak berarti bila dibanding dengan kesulitan-kesulitan sebelumnya.\n\nPada akhir ayat ini ditegaskan bahwa Allah Mahakuat lagi Maha Perkasa, tidak dapat ditandingi oleh sesuatu pun. Oleh Karena itu, dengan mudah Dia menghalau tentara yang bersekutu yang berjumlah banyak itu.",
          "26": "Ayat ini menerangkan perang menghadapi Bani Quraidhah, salah satu dari suku-suku Yahudi Medinah yang telah membuat perjanjian damai dengan Nabi. Sebagaimana telah diterangkan terdahulu bahwa ketika kaum Muslimin dalam keadaan kritis menghadapi tentara yang bersekutu di Perang Ahzab, orang-orang Yahudi Bani Quraidhah yang menjadi warga kota Medinah mengkhianati kaum Muslimin dari dalam. Pemimpin mereka, Ka'ab bin Asad, dihasut oleh pemimpin Bani an-Nadhir, huyai bin Akhthab, agar membatalkan perjanjian damai yang telah mereka buat dengan Nabi, serta menggabungkan diri dengan tentara sekutu yang mengepung kota Medinah. Ajakan itu mula-mula ditolak oleh Ka'ab bin Asad, tetapi akhirnya ia menerima. Maka mereka mengkhianati Nabi dan bergabung dengan kelompok Ahzab.\n\nBerita pengkhianatan Bani Quraidhah itu menggemparkan kaum Muslimin, karena terjadi dalam kota Medinah. Oleh karena itu, Rasulullah saw segera mengutus dua orang sahabatnya, yaitu Sa'ad bin Mu'adz, kepala suku Aus, dan Sa'ad bin Ubadah, kepala suku Khazraj, kepada Bani Quraidhah untuk menasihati mereka agar jangan meneruskan pengkhianatan itu. Setibanya kedua utusan itu di tempat Bani Quraidhah, keduanya segera menyampaikan pesan-pesan Nabi saw. Akan tetapi, permintaan Nabi itu mereka tolak dengan sikap yang kasar serta penuh keangkuhan dan kesombongan, dan mereka tetap melanjutkan pengkhianatan tersebut.\n\nSetelah Allah menghalau pasukan sekutu, maka Dia mewahyukan kepada Nabi Muhammad, agar kaum Muslimin segera menumpas Bani Quraidhah yang telah berkhianat. Oleh karena itu, Nabi dan kaum Muslimin segera membuat perhitungan dengan para pengkhianat itu. Nabi dan kaum Muslimin segera mendatangi kampung mereka untuk mengepungnya. Setelah mendengar kedatangan Nabi dan Kaum Muslimin, mereka segera memasuki benteng-benteng untuk mempertahankan diri. Tentara kaum Muslimin waktu itu dipimpin oleh Ali bin Abi thalib. Setelah dua puluh lima hari lamanya mereka dikepung dalam benteng-benteng itu dengan penuh ketakutan, maka mereka mau menyerah kepada Nabi dengan syarat bahwa yang akan menjadi hakim atas perbuatan mereka ialah Sa'ad bin Mu'adz, kepala suku Aus. Penyerahan dan syarat itu diterima Nabi, maka mereka turun dari benteng-benteng itu dan menyerah kepadanya. Setelah mempertimbangkan dengan matang, maka Sa'ad menjatuhkan hukuman mati, laki-laki mereka dibunuh, sedang perempuan-perempuan dan anak-anak ditawan.\n\nHukuman yang demikian itu adalah wajar bagi pengkhianat-pengkhianat negara yang sedang dalam keadaan berperang, lebih-lebih pengkhianatan itu dilakukan ketika musuh sedang melancarkan serangan. Masyarakat Islam di Medinah waktu itu ialah masyarakat yang baru tumbuh, masyarakat yang baru mulai melaksanakan hukum-hukum berdasarkan ketetapan Islam yang berbeda dengan hukum-hukum yang lama. Oleh karena itu, wajar kiranya hukuman yang telah diberikan kepada Bani Quraidhah yang berkhianat di masa perang, sehingga yang berlaku adalah hukum perang. Dengan hukuman itu, maka kota Medinah tetap kuat dan Nabi tetap berwibawa dan penduduk Medinah yang lain mengetahui dan menyadari bahwa setiap pengkhianatan akan dikenakan hukuman yang setimpal.",
          "27": "Ayat ini menerangkan bahwa harta benda Bani Quraidhah yang dijatuhi hukuman mati itu telah diberikan Allah kepada kaum Muslimin, termasuk segala kebun, rumah, dan binatang ternak yang mereka miliki. Bahkan dalam ayat ini, Allah menjanjikan kepada kaum Muslimin bahwa Dia akan mewariskan tanah-tanah yang lain, yang waktu itu belum dimasuki oleh tentara Islam, tetapi pasti akan mereka masuki dan mereka taklukkan.\n\nPada akhir ayat ini, Allah menerangkan bahwa Dia berkuasa memberikan semuanya kepada kaum Muslimin untuk menolong mereka dalam melaksanakan agama-Nya dan untuk memperluas Islam itu sendiri. Hal itu adalah ketentuan yang pasti terlaksana.",
          "28": "Allah memerintahkan Rasulullah saw agar menyampaikan kepada istri-istrinya supaya mereka memilih apa yang mereka kehendaki dari dua hal. Pilihan pertama ialah jika mereka menginginkan kehidupan dunia dengan segala kenikmatannya, maka Nabi tidak mempunyai yang demikian itu, dan beliau tidak mempunyai sesuatu pun yang akan diberikan untuk memenuhi keinginan itu. Oleh karena itu, Nabi akan mentalak mereka dan beliau memberi mut'ah, sebagaimana yang telah disyariatkan agama. Beliau juga akan menceraikan mereka secara baik-baik pula.\n\nMenurut ketentuan Allah, seorang suami yang menceraikan istrinya memberi mut'ah berupa pakaian, uang, atau perhiasan secara sukarela kepada istri yang diceraikannya, sesuai dengan kemampuannya, orang kaya sesuai dengan kekayaannya dan orang miskin sesuai dengan kemiskinannya. Firman Allah:\n\nDan hendaklah kamu beri mereka mut'ah, bagi yang mampu menurut kemampuannya dan bagi yang tidak mampu menurut kesanggupannya, yaitu pemberian dengan cara yang patut, yang merupakan kewajiban bagi orang-orang yang berbuat kebaikan. (al-Baqarah/2: 236)\n\nAllah juga menetapkan bahwa jika seorang suami mentalak istrinya, maka hendaklah ia melepaskan mereka secara baik-baik dan mentalaknya pada waktu suci sebelum dicampuri, agar mereka dapat melaksanakan idah dalam masa yang pendek. Allah berfirman:\n\nWahai Nabi! Apabila kamu menceraikan istri-istrimu maka hendaklah kamu ceraikan mereka pada waktu mereka dapat (menghadapi) idahnya (yang wajar), dan hitunglah waktu idah itu, serta bertakwalah kepada Allah Tuhanmu. (ath-thalaq/65:1)\n\nPada waktu ayat ini turun, Rasulullah mempunyai istri 9 orang, yaitu 'Aisyah binti Abu Bakar, Hafshah binti 'Umar, Ummu Salamah, Ummu habibah Ramlah binti Sufyan, Saudah binti Zam'ah, Zainab binti Jahsy, Maimunah binti Hars, safiyyah binti Huyai bin Akhthab, dan Juwairiyah binti al-haris. Dari istri beliau yang sembilan itu, lima orang berasal dari suku Quraisy dan empat orang bukan dari suku Quraisy.\n\nFirman Allah: \n\nJika dia (Nabi) menceraikan kamu, boleh jadi Tuhan akan memberi ganti kepadanya dengan istri-istri yang lebih baik dari kamu, perempuan-perempuan yang patuh, yang beriman, yang taat, yang bertobat, yang beribadah, yang berpuasa, yang janda dan yang perawan. (at-Tahrim/66: 5)",
          "29": "Pilihan kedua yang disampaikan Rasulullah ialah jika para istrinya memilih keridaan Allah dan Rasul-Nya dan pahala hari akhirat, maka taatlah kepada Allah dan Rasul-Nya. Allah telah menyediakan pahala yang besar bagi para istrinya yang baik dalam perkataan, perbuatan, dan tingkah laku. Mereka ditempatkan di dalam surga yang penuh kenikmatan.",
          "30": "Pada ayat ini, Allah memperingatkan istri-istri Nabi agar selalu menjaga diri karena mereka adalah ibu dari seluruh kaum Muslimin dan menjadi contoh teladan bagi mereka. Perintah Allah itu ialah, \"Barang siapa di antara istri Nabi yang mengerjakan perbuatan keji, perbuatan yang terlarang, dan sebagainya, maka mereka akan memperoleh azab dua kali lipat dari azab yang diterima orang biasa.\"\n\nPemberian azab dua kali lipat kepada istri-istri Nabi ini ialah karena mereka termasuk orang-orang yang telah mengetahui dengan sebenarnya perintah-perintah dan larangan-larangan Allah. Di samping itu, mereka juga adalah penjaga rumah tangga Rasulullah dari segala perbuatan yang jahat yang mungkin terjadi di dalamnya.\n\nSebagian ulama menetapkan hukum berdasarkan ayat ini bahwa untuk tindakan kejahatan yang sama jenisnya, maka hukuman yang akan diterima oleh orang-orang yang tahu itu lebih berat dari hukuman yang akan diterima oleh orang yang tidak tahu. Orang yang tahu telah mengetahui akibat dari suatu perbuatan. Jika ia melakukan perbuatan itu, berarti ia melakukan dengan penuh kesadaran, sedang yang tidak tahu, ia mengerjakan tindakan kejahatan itu tanpa kesadaran dalam arti yang sebenarnya. Oleh karena itu, orang-orang tahu itu wajib memperoleh hukuman dua kali lipat dari hukuman yang diperoleh orang yang tidak tahu.\n\nDiriwayatkan bahwa seorang laki-laki berkata kepada Zainal 'abidin r.a., \"Sesungguhnya kamu adalah keluarga Nabi yang telah memperoleh ampunan.\" Maka Zainal 'abidin marah kepada orang itu dan berkata, \"Apa yang telah ditetapkan Allah terhadap istri-istri Nabi lebih pantas untuk ditetapkan bagi kami dari apa yang kamu katakan itu. Kami berpendapat bahwa balasan kebajikan kami dilipatgandakan sebagaimana balasan kesalahan kami dilipatgandakan pula.\" Kemudian beliau membaca ayat ini.",
          "31": "Pada ayat ini, Allah menerangkan bahwa siapa pun di antara istri-istri Nabi. saw yang tetap taat kepada Allah dan rasul-Nya, serta mengerjakan amal yang saleh, pasti diberi-Nya pahala dua kali lipat sebagai penghargaan bagi mereka. Penghargaan itu karena kedudukan mereka selaku \"Ummahatul Mu'minin\", yaitu ibu kehormatan segenap kaum mukminin, dan mereka berada di rumah Nabi saw, tempat turun wahyu Allah, cahaya hikmat dan petunjuk ke jalan yang lurus. Selain pahala yang berlipat ganda, Allah akan memberikan pula rezeki yang mulia di dunia dan di akhirat. Di dunia karena mereka menjadi pusat perhatian seluruh perempuan mukminat yang memandang mereka dengan penuh penghormatan dan kewibawaan dan di akhirat karena mereka adalah istri-istri Nabi. saw yang akan ditempatkan oleh Allah pada derajat yang tinggi dalam surga Jannatun Na'im.",
          "32": "Pada ayat ini, Allah memperingatkan kepada istri-istri Nabi. saw bahwa mereka dengan julukan \"Ummahatul Mu'minin\" sama sekali tidak dapat dipersamakan dengan perempuan mukminat yang mana pun dalam segi keutamaan dan penghormatan, jika mereka betul-betul bertakwa. Tidak ada seorang perempuan pun yang dapat menyerupai kedudukan apalagi melebihi keutamaan mereka karena suami mereka adalah \"Sayyidul Anbiya' wal Mursalin\". Oleh karena itu, jika mengadakan pembicaraan dengan orang lain, maka mereka dilarang merendahkan suara yang dapat menimbulkan perasaan kurang baik terhadap kesucian dan kehormatan mereka, terutama jika yang dihadapi itu orang-orang fasik atau munafik yang itikad baiknya diragukan. Istri-istri Nabi. saw itu, setelah beliau wafat tidak boleh dinikahi oleh siapa pun, sesuai dengan firman Allah:\n\nDan tidak boleh kamu menyakiti (hati) Rasulullah dan tidak boleh (pula) menikahi istri-istrinya selama-lamanya setelah (Nabi wafat). Sungguh, yang demikian itu sangat besar (dosanya) di sisi Allah. (al-Ahzab/33: 53)",
          "33": "Pada ayat ini, Allah memerintahkan supaya para istri Nabi. tetap tinggal di rumah mereka masing-masing dan tidak keluar kecuali bila ada keperluan. Perintah ini berlaku bagi istri-istri Nabi. saw. Mereka dilarang memamerkan perhiasannya, dan bertingkah laku seperti orang-orang Jahiliah masa dahulu sebelum zaman Nabi Muhammad. \n\nSetelah mereka dilarang mengerjakan keburukan, mereka diperintahkan mengerjakan kebajikan, seperti mendirikan salat lima waktu sesuai syarat dan rukun-rukunnya dan menunaikan zakat harta bendanya. Telah menjadi kebiasaan, jika disebut salat maka selalu dikaitkan dengan zakat, sebab keduanya menghasilkan kebersihan diri dan harta. Hikmah dari keduanya supaya tetap taat kepada Allah dan Rasul-Nya karena hal itu adalah pelaksanaan dari isi dua kalimat syahadat yang menjadi jalan kebahagiaan di dunia dan akhirat. \n\nAllah mengeluarkan perintah itu disertai sebutan \"ahlul bait\", yaitu semua keluarga rumah tangga Rasulullah, dengan maksud untuk menghilangkan dosa-dosa dari mereka. Allah juga bermaksud membersihkan mereka dari kekotoran kefasikan dan kemunafikan yang biasa menempel pada orang yang berdosa. Dengan demikian, Allah akan membersihkan mereka sebersih-bersihnya. \n\nAnas bin Malik dalam rangka menerangkan siapa yang dimaksud dengan ahlul bait dalam ayat ini meriwayatkan:\n\nSesungguhnya Rasulullah selalu mendatangi rumah putrinya Fatimah, selama enam bulan pada setiap salat Subuh. Beliau berseru, \"Salat, hai Ahlul Bait, sesungguhnya Allah hendak menghilangkan dosa dari kamu, dan membersihkan kamu sebersih-bersihnya.\" (Riwayat at-Tirmidzi dan Abu Dawud ath-thayalisi dari Anas bin Malik)",
          "34": "Pada ayat ini, Allah menerangkan sebab-sebab mereka mendapat karunia yang besar itu. Di antaranya ialah karena rumah kediaman istri-istri Nabi. itu adalah tempat-tempat turun wahyu. Allah memerintahkan kepada istri-istri Nabi. saw supaya mengajarkan apa yang dibacakan di rumah mereka itu dari ayat-ayat Allah dan sunah Nabi kepada orang lain. Sunah Nabi itu bisa berupa apa yang mereka saksikan tentang kehidupan Nabi dalam lingkungan rumah tangga dan berhubungan dengan syariat Islam.",
          "35": "Pada ayat ini Allah menjelaskan sifat-sifat hamba-Nya yang akan diampuni segala dosa dan kesalahannya serta dimasukkan ke dalam surga. Sifat-sifat mereka ada sepuluh macam:\n\n1.Taat dan tunduk kepada hukum Islam, baik ucapan maupun perbuatan.\n\n2.Membenarkan dan memercayai ajaran Allah dan rasul-Nya.\n\n3.Selalu melaksanakan perintah-perintah agama dengan penuh kekhusyukan dan ketenangan.\n\n4.Selalu benar dalam ucapan dan perbuatan, sebagai tanda keimanan yang sempurna. Dalam sebuah hadis yang sahih disebutkan bahwa Rasulullah saw bersabda, \"Peganglah kebenaran, bahwa kebenaran itu membawa pada kebajikan, dan kebajikan akan membawa masuk surga, dan jauhilah dusta, sebab dusta itu membawa pada kedurhakaan dan kedurhakaan itu membawa ke neraka.\"\n\n5.Sabar menghadapi kesulitan dan penderitaan dalam melaksanakan perintah Allah serta menahan syahwat dan hawa nafsu.\n\n6.Khusyuk dan tawaduk kepada Allah, baik jasmani maupun rohani, dalam melaksanakan semua tugas dan kewajiban dan keikhlasan semata-mata untuk mencari keridaan Allah.\n\n7.Bersedekah dengan harta dan memberi bantuan kepada mereka yang serba kekurangan dan tidak mempunyai penghasilan.\n\n8.Berpuasa yang dapat membantu menundukkan syahwat dan hawa nafsu, sebagaimana tercantum di dalam sabda Rasulullah saw \"Wahai sekalian pemuda, siapa di antara kamu yang mampu untuk kawin silakan kawin, karena perkawinan itu lebih dapat menahan pandangan mata dan lebih memelihara kemaluan, dan barang siapa yang belum mampu, supaya berpuasa, karena berpuasa itu dapat membendung syahwatnya.\" (Riwayat al-Bukhari dan Muslim dari Ibnu Mas'ud)\n\n9.Menjaga kemaluan dan kehormatan dari segala perbuatan yang haram dan keji, sesuai dengan firman Allah:\n\nDan orang yang memelihara kemaluannya, kecuali terhadap istri-istri mereka atau hamba sahaya yang mereka miliki; maka sesungguhnya mereka tidak tercela. Tetapi barang siapa mencari di balik itu (zina, dan sebagainya), maka mereka itulah orang-orang yang melampaui batas. (al-Mu'minun/23: 5-7)\n\n10.Selalu ingat kepada Allah dengan lidah dan hati, sesuai dengan hadis yang diriwayatkan dari Mujahid yang menyatakan bahwa seseorang itu belum disebut banyak mengingat Allah kecuali bila sudah dapat mengingat-Nya sambil berdiri, duduk, dan berbaring. Abu Sa'id al-Khudri telah meriwayatkan sebuah hadis bahwa Rasulullah bersabda: \n\n\"Apabila seorang suami membangunkan seorang istrinya di malam hari lalu mereka salat Tahajud dua rakaat , maka mereka berdua pada malam tersebut termasuk orang-orang yang banyak mengingat Allah.\" (Riwayat Abu Dawud, an-Nasa'i, dan Ibnu Majah)\n\nDalam hadis yang lain dari Sahal bin Mu'az al-Juhani dari ayahnya diriwayatkan bahwa seorang laki-laki bertanya kepada Rasulullah saw: \n\n\"Pejuang-pejuang manakah yang paling besar pahalanya wahai Rasulullah?\" Nabi saw menjawab, \"Yang paling banyak ingatnya kepada Allah. Lalu ia bertanya lagi,\" Cara orang yang berpuasa manakah yang paling besar pahalanya?\" Nabi saw menjawab, \"Yang paling banyak ingat kepada Allah.\" Kemudian dia menyebutkan pula orang yang salat, berzakat, naik haji dan bersedekah, dan pada kesemuanya itu Nabi saw mengatakan, \"Mereka yang paling banyak ingatnya kepada Allah.\" Abu Bakar lalu berkata kepada Umar, \"Orang yang banyak ingatnya kepada Allah telah membawa semua kebajikan.\" Dan Nabi saw menambahkan, \"Memang demikianlah.\" (Riwayat Ahmad)",
          "36": "Pada ayat ini, Allah menjelaskan bahwa tidak patut bagi orang-orang yang beriman baik laki-laki maupun perempuan, apabila Allah dan rasul-Nya telah menetapkan ketentuan, mereka memilih ketentuan lain yang bertentangan dengan ketetapan keduanya. Menentukan pilihan sendiri yang tidak sesuai dengan ketentuan dari Allah dan rasul-Nya berarti mendurhakai perintah keduanya, dan tersesat dari jalan yang benar. Hal seperti itu diancam pula oleh Allah dengan firman-Nya:\n\nMaka hendaklah orang-orang yang menyalahi perintah Rasul-Nya takut akan mendapat cobaan atau ditimpa azab yang pedih. (an-Nur/24: 63)",
          "37": "Selanjutnya dalam ayat ini, Allah memperingatkan Nabi-Nya bahwa apa-apa yang terjadi antara Zaid bin haritsah dengan Zainab binti Jahsy itu adalah untuk menguatkan keimanan beliau dengan menegaskan kebenaran dan menghilangkan keragu-raguan dari hati orang-orang yang lemah imannya. Allah menyuruh Rasul-Nya supaya memperhatikan ucapannya ketika beliau berkata kepada Zaid bin haritsah, \"Tahanlah terus istrimu dan bertakwalah kepada Allah, dan janganlah berpisah dengannya disebabkan kesombongan atau keangkuhannya karena keturunan, sebab perceraian itu akan mengakibatkan noda yang sulit untuk dihapus.\" \n\nNabi sendiri telah mengetahui bahwa Zaid pada akhirnya pasti akan bercerai dengan Zainab. Beliau merasa berat jika hal tersebut menjadi kenyataan, sebab akan menimbulkan berbagai macam tanggapan di kalangan masyarakat. Nabi menyembunyikan di dalam hatinya apa yang Allah nyatakan, karena Nabi sendiri menyadari bahwa beliau sendiri harus dijadikan teladan oleh seluruh umatnya untuk melaksanakan perintah Allah walaupun dengan mengorbankan perasaan. Menurut naluri, manusia biasanya takut kepada sesama manusia, padahal Allah yang lebih berhak untuk ditakuti. Beliau membayangkan bahwa apabila beliau menikah dengan Zainab, bekas istri anak angkatnya, hal itu pasti akan menjadi buah bibir di kalangan bangsa Arab, karena sejak zaman Jahiliah mereka memandang bahwa anak angkat itu sama dengan anak kandung, sehingga mereka melarang menikahi bekas istri anak angkat.",
          "38": "Pada ayat ini, Allah menguatkan hukum yang telah ditetapkan sebelumnya yaitu bahwa tidak ada suatu keberatan apa pun atas Nabi saw apa yang telah menjadi ketetapan Allah baginya untuk mengawini perempuan bekas istri anak angkatnya setelah dijatuhi talak oleh suaminya dan habis masa idahnya. Orang-orang Yahudi sering mencela Nabi Muhammad saw karena mempunyai istri yang banyak, padahal mereka mengetahui bahwa nabi-nabi sebelumnya ada yang lebih banyak istrinya seperti Nabi Daud dan Nabi Sulaiman. \n\nNabi Muhammad diperintahkan Allah supaya tidak menghiraukan pembicaraan khalayak ramai sehubungan dengan pernikahan beliau dengan Zainab. Ketika Zaid telah menceraikan istrinya, Allah menikahkan Nabi saw dengan Zainab agar tidak ada keberatan bagi orang mukmin untuk menikahi bekas istri anak angkat apabila telah diceraikan. Ketetapan Allah tentang pernikahan Zainab dengan Nabi adalah suatu ketetapan yang sudah pasti. \n\nDiriwayatkan oleh al-Bukhari dan at-Tirmidzi bahwa Zainab sering membangga-banggakan dirinya di hadapan istri-istri Nabi. lainnya dengan ucapan, \"Kamu dinikahkan oleh keluargamu sendiri, tetapi saya dinikahkan oleh Allah. Diriwayatkan oleh Ibnu Jarir ath-thabari dari Sya'bi bahwa Zainab pernah berkata kepada Nabi, \"Saya mempunyai kelebihan dengan tiga perkara yang tidak dimiliki oleh istri-istrimu yang lain, yaitu: kakekku dan kakekmu adalah sama yaitu Abdul Muththalib; Allah menikahkan engkau denganku dengan perintah wahyu dari langit; dan yang ditugaskan menyampaikannya adalah Malaikat Jibril.\"",
          "39": "Pada ayat ini, Allah menerangkan bahwa rasul-rasul yang mendahului Nabi Muhammad itu telah melaksanakan sunatullah. Mereka adalah orang-orang yang penuh dengan ketakwaan dan keikhlasan dalam beribadah. Mereka juga orang-orang yang menyampaikan syariat-syariat Allah, sangat takut kepada-Nya dan tidak merasa takut kepada selain-Nya. Nabi Muhammad pun diperintahkan untuk menjadikannya teladan dalam melaksanakan sunatullah, dan cukuplah Allah sebagai pembuat perhitungan.",
          "40": "Tatkala Rasulullah menikahi Zainab, banyak orang munafik yang mencela pernikahan itu karena dipandang sebagai menikahi bekas istri anak sendiri. Maka Allah menurunkan ayat ini yang menyatakan bahwa Nabi Muhammad saw tidak usah khawatir tentang cemoohan orang-orang yang mengatakan bahwa beliau menikahi bekas istri anaknya, karena Zaid itu bukan anak kandung beliau, tetapi hanya anak angkat. Muhammad saw sekali-kali bukan bapak dari seorang laki-laki di antara umatnya, tetapi ia adalah utusan Allah dan nabi-Nya yang terakhir. Tidak ada nabi lagi setelah beliau. \n\nNabi Muhammad saw itu adalah bapak dari kaum Muslimin dalam segi kehormatan dan kasih sayang sebagaimana setiap rasul pun adalah bapak dari seluruh umatnya. Muhammad itu bukan bapak dari seorang laki-laki dari umatnya dengan pengertian \"bapak\" dalam segi keturunan yang menyebabkan haramnya mushaharah (perbesanan), tetapi beliau adalah bapak dari segenap kaum mukminin dalam segi agama. Beliau mempunyai rasa kasih sayang kepada seluruh umatnya untuk memperoleh kebahagiaan hidup di dunia dan akhirat, seperti kasih sayang seorang ayah terhadap anak-anaknya. \n\nAnak laki-laki Nabi saw dari Khadijah ada tiga orang, yaitu Qasim, thayyib, dan thahir, semuanya meninggal dunia sebelum balig. Dari Mariyah al-Qibthiyah, Nabi memperoleh seorang anak laki-laki bernama Ibrahim yang juga meninggal ketika masih kecil. Di samping tiga anak laki-laki, Nabi saw juga mempunyai empat anak perempuan dari Khadijah, yaitu Zainab., Ruqayyah, Ummu Kaltsum, dan Fathimah. Tiga yang pertama meninggal sebelum Nabi wafat. \n\nAllah Maha Mengetahui segala sesuatu tentang siapa yang diangkat sebagai nabi-nabi yang terdahulu dan siapa yang diangkat sebagai nabi penutup. Berikut hadis-hadis yang menerangkan tentang kedudukan Nabi Muhammad sebagai nabi penutup atau terakhir, di antaranya:\n\nDari Jabir bin Muth'im bahwa ia berkata, \"Aku mendengar Rasulullah bersabda, 'Aku punya beberapa nama: aku Muhammad, aku Ahmad, aku al-Mahi yang mana Allah menghapus kekufuran denganku dan aku al-hasyir di mana manusia dikumpulkan di bawah kakiku dan aku juga al-'aqib yang mana tidak ada lagi nabi sesudahku.\" (Riwayat al-Bukhari dan Muslim)\n\nDari Jabir bin 'Abdullah bahwa ia berkata, \"Rasulullah bersabda, 'Posisiku di antara para nabi adalah seperti seorang laki-laki yang membangun rumah, dia menyempurnakan dan menghiasinya kecuali satu tempat batu (bata yang belum dipasang). Orang yang memasuki rumah itu dan melihatnya berkata, 'Alangkah bagusnya rumah ini, kecuali satu tempat batu (bata yang belum dipasang), maka akulah batu (bata yang belum dipasang) itu, di mana aku menjadi penutup kenabian.\" (Riwayat Muslim)\n\nDari Abu Hurairah bahwa ia berkata, \"Rasulullah bersabda, 'Aku dilebihkan dari para nabi dengan enam hal: 1) Aku diberi kalimat yang singkat tapi padat (luas maknanya). 2) Aku ditolong dengan (diberi rasa) ketakutan (bagi musuh). 3) Dihalalkan bagiku rampasan perang. 4) Allah menjadikan bagiku bumi itu suci (untuk tayamum) dan menjadi masjid. 5) Aku diutus kepada seluruh makhluk, dan 6) Aku dijadikan sebagai penutup para nabi.\" (Riwayat Muslim dan at-Tirmidzi) \n\nDari Anas bin Malik bahwa ia berkata, \"Rasulullah bersabda, 'Kerasulan dan kenabian telah terputus, tidak ada lagi rasul dan nabi sesudahku.\" (Riwayat Ahmad)",
          "41": "Pada ayat ini, Allah menganjurkan kepada semua orang beriman yang membenarkan Allah dan rasul-Nya supaya banyak zikir mengingat Allah dengan menyebut nama-Nya sebanyak-banyaknya dengan hati dan lidah pada setiap keadaan dan setiap waktu. Sebab, Allah-lah yang melimpahkan segala nikmat kepada mereka yang tidak terhingga banyaknya. Mereka diperintahkan bertasbih kepada-Nya dengan pengertian membersihkan dan menyucikan Allah dari segala sesuatu yang tidak pantas bagi-Nya.\n\nBerzikir dan bertasbih ini dilakukan di pagi hari ketika baru bangun dari tidur, sebab ketika itu seakan-akan seseorang hidup kembali setelah mati, untuk menghadapi hidup yang baru. Diperintahkan juga bertasbih pada sore hari karena pada saat itu seseorang telah selesai mengerjakan bermacam-macam pekerjaan sepanjang hari. Zikir pada waktu itu merupakan tanda bersyukur kepada Allah atas limpahan taufik dan hidayah-Nya sehingga dapat melaksanakan pekerjaannya dengan baik, dan dapat memperoleh rezeki untuk keperluan hidupnya dan nafkah bagi keluarganya. \n\nDengan banyak zikir, ia dapat menghambakan diri kepada Allah dan untuk menghadapi alam akhirat. Di samping itu, ia dapat pula meneliti perbuatan yang sudah dilaksanakan sehingga dapat mengusahakan perbaikan-perbaikan yang diperlukan bagi hari-hari yang akan datang.",
          "42": "Pada ayat ini, Allah menganjurkan kepada semua orang beriman yang membenarkan Allah dan rasul-Nya supaya banyak zikir mengingat Allah dengan menyebut nama-Nya sebanyak-banyaknya dengan hati dan lidah pada setiap keadaan dan setiap waktu. Sebab, Allah-lah yang melimpahkan segala nikmat kepada mereka yang tidak terhingga banyaknya. Mereka diperintahkan bertasbih kepada-Nya dengan pengertian membersihkan dan menyucikan Allah dari segala sesuatu yang tidak pantas bagi-Nya.\n\nBerzikir dan bertasbih ini dilakukan di pagi hari ketika baru bangun dari tidur, sebab ketika itu seakan-akan seseorang hidup kembali setelah mati, untuk menghadapi hidup yang baru. Diperintahkan juga bertasbih pada sore hari karena pada saat itu seseorang telah selesai mengerjakan bermacam-macam pekerjaan sepanjang hari. Zikir pada waktu itu merupakan tanda bersyukur kepada Allah atas limpahan taufik dan hidayah-Nya sehingga dapat melaksanakan pekerjaannya dengan baik, dan dapat memperoleh rezeki untuk keperluan hidupnya dan nafkah bagi keluarganya. \n\nDengan banyak zikir, ia dapat menghambakan diri kepada Allah dan untuk menghadapi alam akhirat. Di samping itu, ia dapat pula meneliti perbuatan yang sudah dilaksanakan sehingga dapat mengusahakan perbaikan-perbaikan yang diperlukan bagi hari-hari yang akan datang.",
          "43": "Allah menjelaskan bahwa Dialah yang memberikan rahmat kepada orang-orang yang beriman dan menguji mereka di hadapan malaikat yang berada di langit. Para malaikat pun memohonkan ampun untuk mereka supaya Allah mengeluarkan mereka dengan taufik, hidayah, dan rahmat-Nya dari kegelapan kekafiran kepada cahaya keimanan. Dia Maha Penyayang kepada seluruh kaum Muslimin di dunia dan akhirat. Di dunia, Allah memberi petunjuk kepada mereka pada jalan yang benar, dan di akhirat, Ia memberi keselamatan bagi mereka dari kegoncangan dan malapetaka yang hebat.",
          "44": "Apabila orang-orang mukmin masuk halaman surga, para malaikat memberi penghormatan kepada mereka dengan ucapan \"salam\" seperti dalam firman Allah:\n\nSedang para malaikat masuk ke tempat-tempat mereka dari semua pintu; (sambil mengucapkan), \"Selamat sejahtera atasmu karena kesabaranmu.\" Maka alangkah nikmatnya tempat kesudahan itu. (ar-Ra'd/13: 23-24)\n\nAllah menyediakan pahala bagi mereka di akhirat yang datangnya tanpa diminta terlebih dahulu. Mereka merasakan nikmat dari kelezatan makanan, minuman, pakaian, dan tempat-tempat kediaman di dalam surga yang luas sekali. Kenikmatan surga itu belum pernah dilihat oleh mata, didengar oleh telinga, ataupun terlintas dalam hati.",
          "45": "Pada ayat ini, Allah menjelaskan kepada Nabi Muhammad bahwa ia diutus untuk menjadi saksi terhadap orang-orang (umat) yang pernah mendapat risalahnya. Allah mengutusnya sebagai pembawa kabar gembira bagi orang-orang yang membenarkan risalahnya dan mengamalkan petunjuk-petunjuk yang dibawanya bahwa mereka akan dimasukkan ke dalam surga. Ia juga sebagai pemberi peringatan kepada mereka yang mengingkari risalahnya, bahwa mereka akan diazab dengan siksa api neraka. \n\nSehubungan dengan fungsi Nabi sebagai saksi (syahid), dalam ayat lain Allah berfirman:\n\nDan bagaimanakah (keadaan orang kafir nanti), jika Kami mendatangkan seorang saksi (Rasul) dari setiap umat dan Kami mendatangkan engkau (Muhammad) sebagai saksi atas mereka. (an-Nisa'/4: 41)",
          "46": "Nabi juga berperan sebagai juru dakwah agama Allah untuk seluruh umat manusia agar mereka mengakui keesaan dan segala sifat-sifat kesempurnaan-Nya. Juga bertujuan agar manusia beribadah kepada Allah dengan tulus ikhlas; memberi penerangan laksana sebuah lampu yang terang benderang yang dapat mengeluarkan mereka dari kegelapan kekafiran kepada cahaya keimanan, dan menyinari jalan yang akan ditempuh oleh orang-orang yang beriman agar mereka berbahagia di dunia dan akhirat. Semua tugas Nabi saw itu dilaksanakannya dengan dan perintah izin Allah.",
          "47": "Ibnu Jarir ath-thabari dan 'Ikrimah telah meriwayatkan sebuah hadis dari al-hasan yang menerangkan bahwa ketika turun ayat al-Fath/48: 2:\n\nAgar Allah memberikan ampunan kepadamu (Muhammad) atas dosamu yang lalu dan yang akan datang. (al-Fath/48: 2)\n\nPara sahabat bertanya, \"Ya Rasulullah! Kami telah mengetahui apa yang diperbuat Allah untukmu, maka apakah yang akan diperbuat Allah untuk kami?\" Maka turunlah ayat ini (al-Ahzab/33: 47)\n\nPada ayat ini, Allah memerintahkan Nabi Muhammad supaya menyampaikan berita gembira kepada orang-orang mukmin bahwa sesungguhnya Allah telah menyediakan bagi mereka karunia yang amat besar yang melebihi karunia yang diberikan kepada umat-umat lainnya, karena mereka diberi kemampuan untuk memperbaiki akhlak masyarakat dari berbagai kezaliman kepada keadilan dan kemaslahatan. Mereka juga dapat mengubah wajah umat-umat yang dihadapinya dari sikap membangkang kepada sikap yang tunduk dan patuh demi perbaikan nasibnya di dunia dan di akhirat kelak.",
          "48": "Pada ayat ini, Allah menjelaskan tentang apa yang dapat menimbulkan kemudaratan. Allah melarang orang yang beriman untuk menuruti orang kafir dan orang-orang munafik. Mereka juga diperintahkan untuk tidak menghiraukan gangguan orang kafir terhadap berlangsungnya dakwah kepada jalan Allah, dan menghadapi mereka dengan penuh kesabaran dan tawakal. Allah-lah yang harus dipandang sebagai pelindung di dalam melaksana-kan tugas dakwah guna semaraknya syiar Islam.",
          "49": "Pada ayat ini, Allah menjelaskan bahwa jika terjadi perceraian antara seorang mukmin dan istrinya yang belum pernah dicampuri, maka perempuan yang telah diceraikan itu tidak mempunyai masa idah dan perempuan itu langsung bisa nikah lagi dengan lelaki yang lain. Bekas suami yang menceraikan itu hendaklah memberi mut'ah, yaitu suatu pemberian untuk menghibur dan menyenangkan hati istri yang diceraikan. Besar dan kecilnya mut'ah itu tergantung kepada kesanggupan suami sesuai dengan firman Allah:\n\nTidak ada dosa bagimu, jika kamu menceraikan istri-istri kamu yang belum kamu sentuh (campuri) atau belum kamu tentukan maharnya. Dan hendaklah kamu beri mereka mut'ah, bagi yang mampu menurut kemampuannya dan bagi yang tidak mampu menurut kesanggupannya, yaitu pemberian dengan cara yang patut, yang merupakan kewajiban bagi orang-orang yang berbuat kebaikan. (al-Baqarah/2: 236)\n\nPatut diperhatikan bahwa jika perempuan itu harus meninggalkan rumah maka cara mengeluarkannya hendaklah dengan sopan-santun sehingga tidak menyebabkan sakit hatinya. Kepadanya harus diberikan bekal yang wajar, sehingga pemberian itu benar-benar merupakan hiburan yang meringankan penderitaan hatinya akibat perceraian yang dialaminya. Diriwayatkan dari Sahal bin Sa'ad dan Abu Usaid:\n\nNabi saw telah mengawini Umaimah binti Syarahil. Ketika Umaimah masuk ke dalam rumah (Nabi), Nabi mengulurkan tangan kepadanya, namun dia seakan-akan tidak menyukai (cara penyambutan Nabi tersebut). Maka Nabi menyuruh Abu Usaid agar memberikan dua potong baju yang baik yang terkenal pada waktu itu (sebagai hadiah perceraian). (Riwayat al-Bukhari)",
          "50": "Pada ayat ini, Allah secara jelas telah menghalalkan bagi Nabi Muhammad mencampuri perempuan-perempuan yang dinikahi dan diberikan kepada mereka maskawin. Juga dihalalkan baginya hamba sahaya (jariyah) yang diperoleh dalam peperangan, seperti shafiyah binti Huyai bin Akhtab yang diperoleh pada waktu Perang Khaibar. Oleh Nabi saw, shafiyah dimerdekakan, dan kemerdekaan itu dijadikan maskawin. Begitu juga dengan Juwairiyah binti al-harits. dari Bani Mushthaliq. yang dimerdekakan dan dinikahi Nabi saw. Adapun hamba sahaya (jariyah) yang dihadiahkan kepada Nabi adalah Raihanah binti Syam'un dan Mariyah al-Qibthiyah yang melahirkan putra Nabi yang bernama Ibrahim. \n\nAllah juga menghalalkan kepada Nabi untuk menikahi anak-anak perempuan dari saudara laki-laki bapaknya dan anak-anak perempuan dari saudara perempuan bapaknya, anak-anak perempuan dari saudara laki-laki ibunya, anak-anak perempuan dari saudara perempuan ibunya yang turut hijrah bersama Rasulullah dan perempuan mukmin yang menyerahkan dirinya kepada Nabi saw kalau Nabi mau menikahinya.\n\nKelonggaran-kelonggaran ini hanya khusus bagi Nabi, dan tidak untuk semua mukmin, dengan pengertian bahwa jika ada seorang perempuan menyerahkan dirinya untuk dinikahi oleh seorang muslim, walaupun dengan sukarela, tetap wajib dibayar maskawinnya. Berlainan halnya jika perempuan itu menyerahkan dirinya untuk dinikahi oleh Nabi saw, maka ia boleh dinikahi tanpa maskawin. \n\nMaskawin itu jika tidak disebutkan bentuk (nilainya) ketika melangsungkan akad nikah, maka bentuknya itu dapat ditetapkan dengan mahar. mitsl, yaitu mahar yang nilainya sama dengan nilai mahar yang biasa diberikan keluarganya. Ketetapan untuk membayar mahar mitsl itu setelah terjadi percampuran di antara keduanya atau setelah suaminya meninggal dunia tetapi belum sempat bercampur. Jika terjadi perceraian antara suami-istri sebelum bercampur, maka yang wajib dibayar adalah separuh dari maskawinnya, yang telah ditentukan dan dapat dibebaskan dari membayar maskawin itu bila istrinya merelakannya. \n\nAllah mengetahui apa yang telah diwajibkan kepada kaum mukminin terhadap istrinya dan terhadap hamba sahaya yang mereka miliki seperti syarat-syarat akad nikah dan lainnya, dan tidak boleh menikahi seorang perempuan dengan cara hibah atau tanpa saksi-saksi. Mengenai hamba sahaya yang dibeli atau yang bukan dibeli haruslah hamba sahaya yang halal dicampuri oleh pemiliknya, seperti hamba sahaya ahli kitab, bukan hamba sahaya yang musyrik atau beragama Majusi. Allah adalah Maha Pengampun lagi Maha Penyayang terhadap hamba-Nya yang beriman, jika mereka bertobat dari dosa-dosa yang mereka perbuat sebelum mereka mendapat petunjuk.",
          "51": "Pada ayat ini, Allah memberi kebebasan kepada Nabi Muhammad untuk menangguhkan siapa di antara istri-istrinya yang beliau kehendaki dan boleh pula menggauli siapa di antara mereka yang beliau kehendaki. Beliau juga diberi kebebasan untuk mengawini kembali istri-istrinya yang telah dicerai mengingat kemaslahatan bagi dirinya dan masyarakat. \n\nDiriwayatkan oleh Ibnu Jarir ath-thabari dari Abu Razin bahwa ketika diturunkan ayat yang menyuruh istri-istri Nabi. saw untuk memilih antara tetap menjadi istri Nabi. dengan keadaan sederhana tanpa kemewahan atau berpisah dari Nabi saw karena mengejar kesenangan hidup yang lebih sesuai dengan keinginan hawa nafsunya, maka timbullah rasa kekhawatiran pada istri-istri Nabi. saw itu. Mereka secara serentak menyatakan kerelaannya untuk tetap hidup bersama Nabi saw dalam keadaan bagaimanapun juga karena mereka lebih mengutamakan segi kehidupan agama daripada kesenangan duniawi. \n\nLalu Nabi menangguhkan menggauli beberapa istrinya atas permintaan mereka, seperti Ummu habibah, Maimunah, Saudah, shafiyah, dan Juwairiyah. Terhadap kelima istrinya ini, Nabi saw tidak mengatur giliran bermalam secara teratur. Adapun terhadap istri-istrinya yang empat orang lagi yaitu 'aisyah, Hafshah, Zainab dan Ummu Salamah beliau mengatur giliran untuk bermalam, serta mempersamakan pembagian pakaian dan makanan. \n\nKebebasan Nabi untuk mengatur giliran, makanan, pakaian, dan lain-lain sesuai dengan sifat adil Nabi dalam melaksanakan petunjuk Allah, sehingga tidak menimbulkan rasa cemburu dalam hati para istrinya. Mereka menerima dengan rela perlakuan Nabi.\n\nDiriwayatkan dari 'Abdullah bin Yazid bahwa 'aisyah pernah berkata, \"Adalah kebiasaan Nabi saw untuk membagi-bagi giliran di antara istri-istrinya dengan adil, kemudian Nabi saw berdoa, \"Ya Allah, inilah pembagianku tentang apa yang aku kuasai (yaitu soal pembagian benda materi), maka janganlah Engkau mencercaku tentang apa-apa yang Engkau kuasai dan tidak aku kuasai (soal cinta).\" (Riwayat Ahmad)\n\nHadis ini mengandung suatu anjuran supaya tetap memelihara kemurnian hati dan ancaman bagi mereka yang tidak berserah diri kepada ketentuan Allah dan Rasul-Nya. Allah Maha Mengetahui tentang segala rahasia yang tersimpan di dalam hati, lagi Maha Penyantun, selalu memberi kesempatan untuk bertobat bagi mereka yang telah menyadari akan kesesatannya dan ingin kembali ke jalan yang lurus.",
          "52": "Allah tidak membolehkan Nabi saw untuk menikahi perempuan-perempuan lain setelah ayat ini turun. Allah juga melarang untuk mengganti mereka dengan istri-istri yang lain, meskipun kecantikannya menarik perhatian Nabi saw, kecuali perempuan-perempuan hamba sahaya yang diperoleh dari peperangan atau yang dihadiahkan kepada beliau.\n\nAbu Dawud dan al-Baihaqi meriwayatkan dari Anas bin Malik bahwa dia berkata, \"Setelah Allah menyuruh memilih kepada istri-istri Nabi., lalu mereka memilih supaya tetap berada di bawah naungan rumah tangga Nabi, maka Allah Taala pun membatasi Nabi untuk menambah istri-istrinya yang sembilan orang itu dengan tidak nikah lagi.\" Dan Allah adalah Maha Mengawasi segala sesuatu.\n\nAllah mengizinkan Nabi Muhammad beristri lebih dari empat mengandung hikmah yang sangat tinggi karena pernikahan itu ditentukan oleh Allah Yang Maha Mengetahui dan Mahabijaksana. Di antara hikmah itu ialah:\n\n1.Menyampaikan hukum khusus kaum wanita yang tidak diketahui kecuali oleh suami istri. Jika istri banyak, maka banyak pula hukum tentang perempuan yang dapat diperoleh. Diterima atau tidaknya riwayat yang berasal dari mereka sangat terpengaruh oleh banyaknya riwayat.\n\n2.Kebutuhan terhadap pendukung yang kuat bagi dakwah pada permulaan Islam. Hubungan besan dan perkawinan secara tradisi pasti saling mendukung dan menolong.\n\n3.Setiap orang Islam pasti ingin menjalin hubungan keluarga dengan Nabi saw, agar bebas masuk ke rumah Nabi saw. Bahkan, setiap muslim ingin dapat melayani Nabi.\n\n4.Nabi saw membalas jasa orang yang membelanya dalam perjuangan Islam. Balasan yang sangat berharga adalah besanan dan menikahi keluarganya, seperti perkawinan Nabi dengan 'aisyah binti Abu Bakar dan Hafshah binti 'Umar.\n\n5.Menghapus tradisi jahiliah dengan hukum yang lebih bermanfaat, seperti pernikahannya dengan Zainab. Sebetulnya Nabi tidak menginginkannya karena takut pada celaan orang, namun hal ini berguna untuk mempertahankan nasab dan kerabat.\n\n6.Nabi mampu berbuat adil dan memberikan bimbingan kepada keluarganya, yang tidak dimiliki oleh orang lain.",
          "53": "Pada ayat ini, Allah mengajarkan sopan santun atau etika terhadap rumah tangga Nabi saw. Allah melarang orang-orang yang beriman untuk memasuki rumah-rumah Nabi saw kecuali dengan izin beliau, untuk makan di rumahnya tanpa menunggu waktu masak makanannya. Pada masa Rasulullah pernah terjadi ada orang-orang yang menunggu waktu makannya. Lalu turun ayat ini yang melarang perbuatan tersebut. Bilamana Rasulullah mengundang beberapa orang sahabat ke rumahnya untuk menghadiri walimah, maka mereka dilarang memasuki rumah Nabi saw, kecuali bila mereka sudah mengetahui bahwa makanannya sudah siap dihidangkan.\n\nBila hidangan belum siap dan mereka masih sibuk menyiapkan hidangan, maka masuknya tamu itu akan mengganggu ketenangan keluarga Nabi saw. Hal ini juga mengganggu istri Nabi. saw yang sedang bekerja karena akan terlihat sebagian anggota tubuhnya yang tidak boleh dilihat oleh para tamu. Mereka dipersilakan masuk jika telah diundang. Apabila telah selesai makan, supaya segera keluar tanpa memperpanjang percakapan, karena hal itu benar-benar mengganggu Nabi saw, dan beliau sendiri merasa malu untuk menyuruh tamunya keluar. Akan tetapi, Allah tidak segan untuk menerangkan yang benar. \n\nAllah mengajarkan kesopanan di dalam rumah tangga supaya diperhatikan oleh seluruh tamu-tamu yang berkunjung ke rumah orang. Bilamana ada kepentingan untuk meminta atau meminjam suatu barang ke rumah istri-istri Nabi. saw, maka hendaklah permintaan itu dilakukan dari belakang tabir dan tidak berhadapan secara langsung. Hal yang demikian itu lebih menyucikan hati kedua belah pihak dan tidak pula menyakiti hati Rasulullah. Termasuk perbuatan yang menyakiti hati Rasulullah ialah menikahi istri-istrinya setelah beliau meninggal dunia. Larangan untuk menikahi bekas istri-istri Nabi. saw adalah larangan yang berlaku untuk selamanya karena perbuatan itu amat besar dosanya di sisi Allah. \n\nNabi itu lebih utama bagi orang-orang mukmin dibandingkan diri mereka sendiri dan istri-istrinya adalah ibu-ibu mereka. (al-Ahzab/33: 6).\n\nImam al-Bukhari meriwayatkan dari Anas bahwa Umar bin Khaththab. pernah berkata, \"Ada tiga pendapatku yang sesuai dengan wahyu yang diturunkan oleh Allah. Pertama, Aku berkata kepada Rasulullah, 'Wahai Rasulullah, alangkah baiknya bila engkau menjadikan maqam Ibrahim tempat salat, lalu Allah menurunkan ayat:\n\nDan jadikanlah maqam Ibrahim itu tempat salat. (al-Baqarah/2: 125)\n\nKedua, saya berkata, 'Wahai Rasulullah, sesungguhnya istri-istrimu sering didatangi tamu orang baik dan orang jahat, seandainya engkau membuat tabir untuk mereka tentu lebih baik, maka Allah menurunkan ayat hijab ini. Ketiga, saya pernah berkata kepada istri-istri Nabi. ketika mereka berselisih karena rasa cemburu terhadap Nabi, maka turunlah ayat ini:\n\nJika dia (Nabi) menceraikan kamu, boleh jadi Tuhan akan memberi ganti kepadanya dengan istri-istri yang lebih baik dari kamu. (at-Tahrim/66: 5)",
          "54": "Sebab turunnya ayat ini, sebagaimana diriwayatkan oleh Juwaibir dari Ibnu 'Abbas, bahwa ada seorang yang telah datang kepada sebagian istri-istri Nabi. saw yang menjadi anak pamannya, lalu bercakap-cakap dengan istri Nabi. secara langsung. Nabi saw menegur hal itu dengan sabdanya, \"Janganlah engkau berbuat seperti ini pada kesempatan yang lain.\" Orang itu menjawab, \"Wahai Rasulullah, ini adalah anak paman saya, dan saya tidak pernah mengatakan sesuatu yang mungkar, dan perempuan itu tidak boleh pula berkata yang tidak baik kepadaku.\" Nabi bersabda, \"Kami telah mengetahui yang demikian itu. Tidak ada yang lebih cemburu daripada Allah, dan tidak ada seorang pun yang lebih cemburu daripada aku.\" Lalu laki-laki itu pergi sambil berkata, \"Siapa yang dapat mencegahku untuk bercakap-cakap dengan anak pamanku; aku pasti akan menikahinya setelah Muhammad wafat.\" Maka turunlah ayat hijab ini, dan laki-laki itu merasa menyesal atas ucapan yang telah dikeluarkannya. Untuk menutupi kesalahan dan menebus dosanya, ia mengeluarkan kifarat dengan memerdekakan seorang hamba sahaya, memberi bekal untuk jihad dengan sepuluh ekor unta, dan naik haji dengan berjalan kaki.",
          "55": "Tidak ada dosa atas istri-istri Nabi. untuk berjumpa tanpa memakai tabir dengan bapak-bapak mereka, baik bapak kandung maupun bapak sesusuan, anak-anak mereka, baik yang seketurunan maupun yang sesusuan, saudara-saudara mereka, atau anak saudara-saudaranya, baik laki-laki maupun perempuan, perempuan-perempuan muslimat yang dekat maupun yang jauh, atau hamba sahaya yang mereka miliki, baik laki-laki maupun perempuan. Adanya hijab di antara mereka itu akan menimbulkan banyak kesulitan karena mereka selalu berkhidmat dalam urusan rumah tangga. Tetapi, yang perlu diingat adalah agar selalu bertakwa kepada Allah untuk mengikuti perintah-Nya dan menjauhi larangan-Nya, karena Allah selalu menyaksikan segala sesuatu yang mereka perbuat.\n\nOrang-orang yang disebutkan dalam ayat ini, yaitu ayah para istri Nabi., anak-anak mereka, saudara-saudara mereka, keponakan atau anak saudara mereka, baik saudara laki-laki maupun saudara perempuan, atau perempuan-perempuan lain dan juga budak mereka adalah mahram yaitu orang-orang yang tidak boleh menikahi mereka.\n\nAdapun orang-orang selain tersebut di atas yaitu yang bukan mahram tidak boleh menemui istri-istri Nabi. tanpa hijab. Hal ini untuk menjaga kehormatan istri-istri Nabi. yang merupakan ummahatul mu'minin.",
          "56": "Sesungguhnya Allah memberi rahmat kepada Nabi Muhammad, dan para malaikat memohonkan ampunan untuknya. Oleh karena itu, Allah menganjurkan kepada seluruh umat Islam supaya bersalawat pula untuk Nabi saw dan mengucapkan salam dengan penuh penghormatan kepadanya. \n\nDiriwayatkan dari Abu Sa'id al-Khudri bahwa ia bertanya, \"Wahai Rasulullah, adapun pemberian salam kepadamu kami telah mengetahuinya, bagaimana kami harus membaca salawat?\" Nabi menjawab, ucapkanlah: Allahumma shalli 'ala Muhammad wa 'ala ali Muhammad kama shallaita 'ala Ibrahim wa 'ala ali Ibrahim innaka hamid majid. Allahumma barik 'ala Muhammad wa 'ala ali Muhammad kama barakta 'ala Ibrahim wa 'ala ali Ibrahim innaka hamid majid. (Riwayat al-Bukhari, Ahmad, an-Nasa'i, Ibnu Majah, dan lainnya)\n\nDiriwayatkan juga oleh 'Abdullah bin Abu thalhah dari ayahnya:\n\nBahwa Rasulullah datang pada suatu hari dan terlihat tanda-tanda kegembiraan di wajahnya. Lalu kami bertanya, \"Kami telah melihat tanda-tanda kegembiraan di wajahmu.\" Nabi menjawab, \"Memang, Jibril telah datang kepadaku dan berkata, 'Wahai Muhammad sesungguhnya Tuhanmu telah menyampaikan salam kepadamu dan berfirman, 'Tidakkah kamu merasa puas bahwa tidak ada seorang pun dari umatmu yang membaca salawat untukmu melainkan Aku membalasnya dengan sepuluh kali lipat. Dan tidak seorang pun yang menyampaikan salam kepadamu dari umatmu melainkan Aku membalas dengan salam sepuluh kali lipat.\"",
          "57": "Pada ayat ini dijelaskan bahwa Allah mengutuk orang-orang yang menyakiti-Nya dengan melakukan perbuatan yang tidak diridai-Nya, seperti mengingkari perintah-Nya, yaitu ucapan orang-orang Nasrani bahwa Isa adalah putra Allah, atau seperti kaum musyrikin yang mengatakan bahwa malaikat adalah putri-putri Allah, atau menyekutukan-Nya. Allah juga mengutuk orang-orang yang menyakiti Rasul-Nya, seperti menuduh beliau seorang penyair, tukang sihir, atau seorang gila dan sebagainya. \n\nKutukan Allah itu meliputi kutukan di dunia dan akhirat. Di dunia mereka dijauhkan dari rahmat Allah dan karunia-Nya, sehingga mereka bergelimang dalam kesesatan dan kemaksiatan. Di akhirat mereka dijerumuskan ke dalam api neraka yang merupakan seburuk-buruknya tempat kembali, dan Allah menyediakan bagi mereka azab yang sangat pedih dan menghinakan.",
          "58": "Orang yang menyakiti para mukmin, baik laki-laki maupun perempuan, tanpa kesalahan yang mereka perbuat, dan hanya berdasarkan kepada fitnah dan tuduhan yang dibuat-buat, maka sungguh mereka itu telah melakukan dosa yang nyata. Menurut Ibnu 'Abbas, ayat ini diturunkan sehubungan dengan tuduhan 'Abdullah bin Ubay terhadap 'aisyah yang dikatakannya telah berbuat mesum dalam perjalanan pulang beserta Nabi Muhammad setelah memerangi Bani Mushthaliq, yang terkenal dengan hadits al-ifk. \n\nDalam hadis Nabi saw dijelaskan:\n\nAbu Hurairah meriwayatkan bahwa Rasulullah pernah ditanya tentang apa artinya bergunjing. Beliau menjawab, \"Engkau menyebut-nyebut saudaramu dengan sesuatu yang dibencinya.\" Nabi ditanya lagi, \"Bagaimana jika yang disebut itu memang benar atau suatu kenyataan?\" Nabi menjawab, \"Bila yang diucapkan itu benar, engkau telah mengumpat kepadanya, dan bila itu tidak benar maka engkau telah membuat kedustaan terhadapnya.\" (Riwayat Abu Dawud)",
          "59": "Allah memerintahkan kepada seluruh kaum muslimat terutama istri-istri Nabi. sendiri dan putri-putrinya agar mengulurkan jilbab ke seluruh tubuh mereka. Hal itu bertujuan agar mereka mudah dikenali dengan pakaiannya karena berbeda dengan jariyah (budak perempuan), sehingga mereka tidak diganggu oleh orang yang menyalahgunakan kesempatan. Seorang perempuan yang berpakaian sopan akan lebih mudah terhindar dari gangguan orang jahil. Sedangkan perempuan yang membuka auratnya di muka umum mudah dituduh atau dinilai sebagai perempuan yang kurang baik kepribadiannya. Bagi orang yang pada masa lalunya kurang hati-hati menutupi aurat, lalu mengadakan perbaikan, maka Allah Maha Pengampun lagi Maha Pengasih. Karena perbuatan yang menyakiti itu seringkali dilakukan oleh orang-orang munafik, maka pada ayat berikut ini Allah mengancam mereka dengan ancaman yang keras sekali.",
          "60": "Jika orang-orang munafik dan orang-orang berpenyakit di hatinya, dan orang-orang yang menyebar berita bohong di Medinah itu tidak berhenti mendustakan Allah, menyakiti Rasul-Nya, dan kaum mukminin, niscaya Allah memerintahkan Nabi-Nya untuk memerangi mereka sehingga tidak akan dapat lagi untuk hidup lebih lama di Medinah bertetangga dengan Nabi saw. Mereka yang diancam akan diperangi dan dimusnahkan oleh Nabi itu adalah tiga golongan manusia:\n\n1.Orang-orang munafik yang selalu menentang Allah secara tersembunyi.\n\n2.Orang-orang berpenyakit di dalam hatinya, seperti dengki dan dendam yang selalu menyakiti orang mukmin seperti mengganggu para perempuan.\n\n3.Orang-orang yang menyiarkan kabar bohong di Medinah sehingga menyakiti Nabi saw, dengan ucapan mereka bahwa Nabi Muhammad saw akan dikalahkan dan diusir dari Medinah dan sebagainya.",
          "61": "Ketiga golongan itu dilaknat di mana saja mereka berada, karena sikapnya yang selalu bermusuhan dan merugikan agama dan negara, mereka selalu dikejar-kejar untuk ditangkap dan dibunuh. Nasib orang yang seperti itu telah pula dialami oleh orang-orang sebelumnya karena begitulah sunah Allah.",
          "62": "Dengan demikian, sunah Allah yang telah berlaku atas orang-orang yang terdahulu sebelum diutusnya Nabi Muhammad saw akan berlaku pula bagi generasi yang datang kemudian. Hal itu tidak mungkin berubah dan pasti berlaku.",
          "63": "Banyak manusia bertanya kepada Nabi Muhammad tentang kapan datangnya hari Kiamat. Orang-orang musyrik menanyakan tentang kiamat tersebut secara mengejek dan mencemooh, serta menantang supaya hari Kiamat segera didatangkan. Orang-orang munafik menanyakan tentang hari Kiamat karena terdorong oleh anggapan bahwa Nabi saw akan menjawab seperti yang mereka perkirakan. Adapun orang-orang Yahudi bertanya dengan maksud menguji kebenaran Nabi saw, apakah jawabannya akan sama atau tidak dengan yang tercantum dalam kitab Taurat, bahwa soal hari Kiamat itu sesungguhnya berada di tangan Allah.",
          "64": "Kemudian Allah menerangkan bahwa yang mengetahui kapan terjadinya hari Kiamat hanya Allah. Mungkin saja waktu datangnya hari Kiamat sudah dekat, karena setiap yang akan datang memang selalu mendekat dan mungkin dekat. Pepatah Arab mengatakan: \n\n\"Setiap yang akan datang adalah dekat.\"\n\nKemudian Allah akan melaknat dan menjauhkan orang-orang kafir dari kebaikan dan rahmat-Nya. Allah juga menyediakan bagi mereka neraka Sa'ir.",
          "65": "Mereka kekal di dalam neraka selama-lamanya, dan tidak menemukan seorang pun yang dapat melindungi mereka dari azab Allah. Mereka juga tidak mendapatkan seorang penolong yang dapat menyelamatkan dari siksaan-Nya.",
          "66": "Mereka tidak memperoleh pelindung dan penolong seorang pun ketika mereka dibolak-balikkan di dalam neraka. Dengan penuh penyesalan mereka berkata, \"Alangkah bahagianya seandainya kami dahulu di dunia taat kepada Allah dan taat pula kepada Muhammad utusan-Nya.\"",
          "67": "Mereka berkata dengan penuh perasaan mendongkol karena tertipu oleh para pemimpin dan pembesar mereka di dunia, \"Ya Tuhan kami, sesungguhnya kami di dunia telah mengikuti pemimpin dan pembesar kami, lalu mereka menyesatkan kami dari jalan yang benar.\"",
          "68": "Mereka dengan perasaan dendam terhadap orang-orang yang telah menyesatkan itu berkata, \"Ya Tuhan kami, berikanlah kepada mereka azab dua kali lipat, pertama karena mereka telah tersesat, dan keduanya telah pula menyesatkan orang lain, dan kutuklah mereka dengan kutukan yang sangat besar.\" Keluhan mereka itu diperkuat dengan ayat lain seperti pada firman Allah:\n\nDan (ingatlah) pada hari (ketika) orang-orang zalim menggigit dua jarinya, (menyesali perbuatannya) seraya berkata, \"Wahai! Sekiranya (dulu) aku mengambil jalan bersama Rasul. Wahai, celaka aku! Sekiranya (dulu) aku tidak menjadikan si fulan itu teman akrab(ku), sungguh, dia telah menyesatkan aku dari peringatan (Al-Qur'an) ketika (Al-Qur'an) itu telah datang kepadaku. Dan setan memang pengkhianat manusia.\" (al-Furqan/25: 27-29)",
          "69": "Allah melarang kaum mukminin agar tidak berlaku seperti segolongan Bani Israil yang menyakiti Nabi Musa. Allah membersihkan beliau dari tuduhan-tuduhan yang mereka lontarkan kepadanya. Beliau adalah seorang yang mempunyai kedudukan yang sangat terhormat di sisi Allah. Di dalam ayat ini tidak disebutkan bagaimana caranya mereka menyakiti Nabi Musa itu. \n\nDalam suatu riwayat tentang meninggalnya Harun, seperti diriwayatkan Ibnu Jarir ath-thabari dari Ibnu 'Abbas dari 'Ali bin Abi Talib bahwa beliau berkata, \"Ketika Nabi Musa dan Harun naik ke gunung, Nabi Harun kemudian wafat. Orang-orang Bani Israil lalu marah kepada Nabi Musa, 'Kamu telah membunuh Harun, padahal beliau orang yang lebih kami sukai daripada engkau.\"\n\nDalam sebuah hadis, Rasulullah bersabda:\n\nDiriwayatkan dari Ibnu Mas'ud bahwa Rasulullah saw pada suatu hari membagi-bagikan harta ganimah kepada sahabatnya, lalu ada seorang laki-laki dari kaum Anshar berkata bahwa pembagian itu tidak dimaksud untuk memperoleh keridaan Allah. Mendengar ucapan itu, Nabi saw tersinggung sampai merah wajahnya seraya berkata, \"Semoga Allah merahmati Musa yang pernah disakiti orang lebih dari ini, tetapi beliau tetap berlaku sabar.\" (Riwayat al-Bukhari dan Muslim)",
          "70": "Pada ayat ini, Allah memerintahkan kepada orang-orang beriman supaya tetap bertakwa kepada-Nya. Allah juga memerintahkan orang-orang beriman untuk selalu berkata yang benar, selaras antara yang diniatkan dan yang diucapkan, karena seluruh kata yang diucapkan dicatat oleh malaikat Raqib dan 'Atid, dan harus dipertanggungjawabkan di hadapan Allah. Firman Allah:",
          "71": "Bila mereka tetap memelihara keimanan dan ketakwaan dan selalu mengatakan kebenaran, pasti Allah akan memperbaiki perbuatan dan mengampuni dosa-dosa mereka. Siapa yang menginginkan kebahagiaan di dunia dan akhirat, maka jalan yang harus ditempuh hanyalah satu, yaitu menaati Allah dan Rasul-Nya. Dengan demikian, mereka akan mendapatkan kebahagiaan yang besar di dunia dan akhirat.",
          "72": "Sesungguhnya Allah telah menawarkan tugas-tugas keagamaan kepada langit, bumi, dan gunung-gunung. Karena ketiganya tidak mempunyai persiapan untuk menerima amanat yang berat itu, maka semuanya enggan untuk memikul amanat yang ditawarkan Allah itu. \n\nKemudian amanat untuk melaksanakan tugas-tugas keagamaan itu ditawarkan kepada manusia dan mereka menerimanya dengan konsekuensi barang siapa yang melaksanakan itu akan diberi pahala dan dimasukkan ke dalam surga. Sebaliknya, barang siapa yang mengkhianatinya akan disiksa dan dimasukkan ke dalam api neraka. Walaupun bentuk badannya lebih kecil dibandingkan dengan ketiga makhluk yang lain (langit, bumi, dan gunung-gunung), manusia berani menerima amanat tersebut karena manusia mempunyai potensi. Tetapi, karena pada diri manusia terdapat ambisi dan syahwat yang sering mengelabui mata dan menutup pandangan hatinya, Allah menyifatinya dengan amat zalim dan bodoh karena kurang memikirkan akibat-akibat dari penerimaan amanat itu.",
          "73": "Allah lalu menerangkan bahwa akibat dari penerimaan amanat ini ialah Dia mengazab orang-orang munafik dan orang-orang musyrik, baik laki-laki maupun perempuan, bila mereka mengabaikan pelaksanaan amanat yang telah dipikulnya. Allah akan menerima tobat orang-orang mukmin laki-laki dan perempuan yang taat melaksanakan amanat itu. Sesungguhnya Allah Maha Pengampun lagi Maha Penyayang."
        }
      }
    }
  }
}