{
  "name": "Fatir",
  "name_translations": {
    "ar": "فاطر",
    "en": "The Originator",
    "id": "Maha Pencipta"
  },
  "number_of_ayah": 45,
  "number_of_surah": 35,
  "place": "Mecca",
  "recitations": [{
    "name": "Mishari Rashid al-`Afasy",
    "audio_url": "https://download.quranicaudio.com/quran/mishaari_raashid_al_3afaasee/035.mp3"
  }, {
    "name": "Abdur-Rahman as-Sudais",
    "audio_url": "https://download.quranicaudio.com/quran/abdurrahmaan_as-sudays/035.mp3"
  }, {
    "name": "Saad al-Ghamdi",
    "audio_url": "https://download.quranicaudio.com/quran/sa3d_al-ghaamidi/complete/035.mp3"
  }],
  "type": "Makkiyah",
  "verses": [{
    "number": 1,
    "text": "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ ٱلْحَمْدُ لِلَّهِ فَاطِرِ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ جَاعِلِ ٱلْمَلَٰٓئِكَةِ رُسُلًا أُو۟لِىٓ أَجْنِحَةٍ مَّثْنَىٰ وَثُلَٰثَ وَرُبَٰعَ يَزِيدُ فِى ٱلْخَلْقِ مَا يَشَآءُ إِنَّ ٱللَّهَ عَلَىٰ كُلِّ شَىْءٍ قَدِيرٌ",
    "translation_en": "[All] praise is [due] to Allah, Creator of the heavens and the earth, [who] made the angels messengers having wings, two or three or four. He increases in creation what He wills. Indeed, Allah is over all things competent.",
    "translation_id": "Segala puji bagi Allah Pencipta langit dan bumi, Yang menjadikan malaikat sebagai utusan-utusan (untuk mengurus berbagai macam urusan) yang mempunyai sayap, masing-masing (ada yang) dua, tiga dan empat. Allah menambahkan pada ciptaan-Nya apa yang dikehendaki-Nya. Sesungguhnya Allah Maha Kuasa atas segala sesuatu."
  }, {
    "number": 2,
    "text": "مَّا يَفْتَحِ ٱللَّهُ لِلنَّاسِ مِن رَّحْمَةٍ فَلَا مُمْسِكَ لَهَا وَمَا يُمْسِكْ فَلَا مُرْسِلَ لَهُۥ مِنۢ بَعْدِهِۦ وَهُوَ ٱلْعَزِيزُ ٱلْحَكِيمُ",
    "translation_en": "Whatever Allah grants to people of mercy - none can withhold it; and whatever He withholds - none can release it thereafter. And He is the Exalted in Might, the Wise.",
    "translation_id": "Apa saja yang Allah anugerahkan kepada manusia berupa rahmat, maka tidak ada seorangpun yang dapat menahannya; dan apa saja yang ditahan oleh Allah maka tidak seorangpun yang sanggup melepaskannya sesudah itu. Dan Dialah Yang Maha Perkasa lagi Maha Bijaksana."
  }, {
    "number": 3,
    "text": "يَٰٓأَيُّهَا ٱلنَّاسُ ٱذْكُرُوا۟ نِعْمَتَ ٱللَّهِ عَلَيْكُمْ هَلْ مِنْ خَٰلِقٍ غَيْرُ ٱللَّهِ يَرْزُقُكُم مِّنَ ٱلسَّمَآءِ وَٱلْأَرْضِ لَآ إِلَٰهَ إِلَّا هُوَ فَأَنَّىٰ تُؤْفَكُونَ",
    "translation_en": "O mankind, remember the favor of Allah upon you. Is there any creator other than Allah who provides for you from the heaven and earth? There is no deity except Him, so how are you deluded?",
    "translation_id": "Hai manusia, ingatlah akan nikmat Allah kepadamu. Adakah pencipta selain Allah yang dapat memberikan rezeki kepada kamu dari langit dan bumi? Tidak ada Tuhan selain Dia; maka mengapakah kamu berpaling (dari ketauhidan)?"
  }, {
    "number": 4,
    "text": "وَإِن يُكَذِّبُوكَ فَقَدْ كُذِّبَتْ رُسُلٌ مِّن قَبْلِكَ وَإِلَى ٱللَّهِ تُرْجَعُ ٱلْأُمُورُ",
    "translation_en": "And if they deny you, [O Muhammad] - already were messengers denied before you. And to Allah are returned [all] matters.",
    "translation_id": "Dan jika mereka mendustakan kamu (sesudah kamu beri peringatan) maka sungguh telah didustakan pula rasul-rasul sebelum kamu. Dan hanya kepada Allahlah dikembalikan segala urusan."
  }, {
    "number": 5,
    "text": "يَٰٓأَيُّهَا ٱلنَّاسُ إِنَّ وَعْدَ ٱللَّهِ حَقٌّ فَلَا تَغُرَّنَّكُمُ ٱلْحَيَوٰةُ ٱلدُّنْيَا وَلَا يَغُرَّنَّكُم بِٱللَّهِ ٱلْغَرُورُ",
    "translation_en": "O mankind, indeed the promise of Allah is truth, so let not the worldly life delude you and be not deceived about Allah by the Deceiver.",
    "translation_id": "Hai manusia, sesungguhnya janji Allah adalah benar, maka sekali-kali janganlah kehidupan dunia memperdayakan kamu dan sekali-kali janganlah syaitan yang pandai menipu, memperdayakan kamu tentang Allah."
  }, {
    "number": 6,
    "text": "إِنَّ ٱلشَّيْطَٰنَ لَكُمْ عَدُوٌّ فَٱتَّخِذُوهُ عَدُوًّا إِنَّمَا يَدْعُوا۟ حِزْبَهُۥ لِيَكُونُوا۟ مِنْ أَصْحَٰبِ ٱلسَّعِيرِ",
    "translation_en": "Indeed, Satan is an enemy to you; so take him as an enemy. He only invites his party to be among the companions of the Blaze.",
    "translation_id": "Sesungguhnya syaitan itu adalah musuh bagimu, maka anggaplah ia musuh(mu), karena sesungguhnya syaitan-syaitan itu hanya mengajak golongannya supaya mereka menjadi penghuni neraka yang menyala-nyala"
  }, {
    "number": 7,
    "text": "ٱلَّذِينَ كَفَرُوا۟ لَهُمْ عَذَابٌ شَدِيدٌ وَٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّٰلِحَٰتِ لَهُم مَّغْفِرَةٌ وَأَجْرٌ كَبِيرٌ",
    "translation_en": "Those who disbelieve will have a severe punishment, and those who believe and do righteous deeds will have forgiveness and great reward.",
    "translation_id": "Orang-orang yang kafir bagi mereka azab yang keras. Dan orang-orang yang beriman dan mengerjakan amal saleh bagi mereka ampunan dan pahala yang besar."
  }, {
    "number": 8,
    "text": "أَفَمَن زُيِّنَ لَهُۥ سُوٓءُ عَمَلِهِۦ فَرَءَاهُ حَسَنًا فَإِنَّ ٱللَّهَ يُضِلُّ مَن يَشَآءُ وَيَهْدِى مَن يَشَآءُ فَلَا تَذْهَبْ نَفْسُكَ عَلَيْهِمْ حَسَرَٰتٍ إِنَّ ٱللَّهَ عَلِيمٌۢ بِمَا يَصْنَعُونَ",
    "translation_en": "Then is one to whom the evil of his deed has been made attractive so he considers it good [like one rightly guided]? For indeed, Allah sends astray whom He wills and guides whom He wills. So do not let yourself perish over them in regret. Indeed, Allah is Knowing of what they do.",
    "translation_id": "Maka apakah orang yang dijadikan (syaitan) menganggap baik pekerjaannya yang buruk lalu dia meyakini pekerjaan itu baik, (sama dengan orang yang tidak ditipu oleh syaitan)? Maka sesungguhnya Allah menyesatkan siapa yang dikehendaki-Nya dan menunjuki siapa yang dikehendaki-Nya; maka janganlah dirimu binasa karena kesedihan terhadap mereka. Sesungguhnya Allah Maha Mengetahui apa yang mereka perbuat."
  }, {
    "number": 9,
    "text": "وَٱللَّهُ ٱلَّذِىٓ أَرْسَلَ ٱلرِّيَٰحَ فَتُثِيرُ سَحَابًا فَسُقْنَٰهُ إِلَىٰ بَلَدٍ مَّيِّتٍ فَأَحْيَيْنَا بِهِ ٱلْأَرْضَ بَعْدَ مَوْتِهَا كَذَٰلِكَ ٱلنُّشُورُ",
    "translation_en": "And it is Allah who sends the winds, and they stir the clouds, and We drive them to a dead land and give life thereby to the earth after its lifelessness. Thus is the resurrection.",
    "translation_id": "Dan Allah, Dialah Yang mengirimkan angin; lalu angin itu menggerakkan awan, maka Kami halau awan itu kesuatu negeri yang mati lalu Kami hidupkan bumi setelah matinya dengan hujan itu. Demikianlah kebangkitan itu."
  }, {
    "number": 10,
    "text": "مَن كَانَ يُرِيدُ ٱلْعِزَّةَ فَلِلَّهِ ٱلْعِزَّةُ جَمِيعًا إِلَيْهِ يَصْعَدُ ٱلْكَلِمُ ٱلطَّيِّبُ وَٱلْعَمَلُ ٱلصَّٰلِحُ يَرْفَعُهُۥ وَٱلَّذِينَ يَمْكُرُونَ ٱلسَّيِّـَٔاتِ لَهُمْ عَذَابٌ شَدِيدٌ وَمَكْرُ أُو۟لَٰٓئِكَ هُوَ يَبُورُ",
    "translation_en": "Whoever desires honor [through power] - then to Allah belongs all honor. To Him ascends good speech, and righteous work raises it. But they who plot evil deeds will have a severe punishment, and the plotting of those - it will perish.",
    "translation_id": "Barangsiapa yang menghendaki kemuliaan, maka bagi Allah-lah kemuliaan itu semuanya. Kepada-Nya-lah naik perkataan-perkataan yang baik dan amal yang saleh dinaikkan-Nya. Dan orang-orang yang merencanakan kejahatan bagi mereka azab yang keras. Dan rencana jahat mereka akan hancur."
  }, {
    "number": 11,
    "text": "وَٱللَّهُ خَلَقَكُم مِّن تُرَابٍ ثُمَّ مِن نُّطْفَةٍ ثُمَّ جَعَلَكُمْ أَزْوَٰجًا وَمَا تَحْمِلُ مِنْ أُنثَىٰ وَلَا تَضَعُ إِلَّا بِعِلْمِهِۦ وَمَا يُعَمَّرُ مِن مُّعَمَّرٍ وَلَا يُنقَصُ مِنْ عُمُرِهِۦٓ إِلَّا فِى كِتَٰبٍ إِنَّ ذَٰلِكَ عَلَى ٱللَّهِ يَسِيرٌ",
    "translation_en": "And Allah created you from dust, then from a sperm-drop; then He made you mates. And no female conceives nor does she give birth except with His knowledge. And no aged person is granted [additional] life nor is his lifespan lessened but that it is in a register. Indeed, that for Allah is easy.",
    "translation_id": "Dan Allah menciptakan kamu dari tanah kemudian dari air mani, kemudian Dia menjadikan kamu berpasangan (laki-laki dan perempuan). Dan tidak ada seorang perempuanpun mengandung dan tidak (pula) melahirkan melainkan dengan sepengetahuan-Nya. Dan sekali-kali tidak dipanjangkan umur seorang yang berumur panjang dan tidak pula dikurangi umurnya, melainkan (sudah ditetapkan) dalam Kitab (Lauh Mahfuzh). Sesungguhnya yang demikian itu bagi Allah adalah mudah."
  }, {
    "number": 12,
    "text": "وَمَا يَسْتَوِى ٱلْبَحْرَانِ هَٰذَا عَذْبٌ فُرَاتٌ سَآئِغٌ شَرَابُهُۥ وَهَٰذَا مِلْحٌ أُجَاجٌ وَمِن كُلٍّ تَأْكُلُونَ لَحْمًا طَرِيًّا وَتَسْتَخْرِجُونَ حِلْيَةً تَلْبَسُونَهَا وَتَرَى ٱلْفُلْكَ فِيهِ مَوَاخِرَ لِتَبْتَغُوا۟ مِن فَضْلِهِۦ وَلَعَلَّكُمْ تَشْكُرُونَ",
    "translation_en": "And not alike are the two bodies of water. One is fresh and sweet, palatable for drinking, and one is salty and bitter. And from each you eat tender meat and extract ornaments which you wear, and you see the ships plowing through [them] that you might seek of His bounty; and perhaps you will be grateful.",
    "translation_id": "Dan tiada sama (antara) dua laut; yang ini tawar, segar, sedap diminum dan yang lain asin lagi pahit. Dan dari masing-masing laut itu kamu dapat memakan daging yang segar dan kamu dapat mengeluarkan perhiasan yang dapat kamu memakainya, dan pada masing-masingnya kamu lihat kapal-kapal berlayar membelah laut supaya kamu dapat mencari karunia-Nya dan supaya kamu bersyukur."
  }, {
    "number": 13,
    "text": "يُولِجُ ٱلَّيْلَ فِى ٱلنَّهَارِ وَيُولِجُ ٱلنَّهَارَ فِى ٱلَّيْلِ وَسَخَّرَ ٱلشَّمْسَ وَٱلْقَمَرَ كُلٌّ يَجْرِى لِأَجَلٍ مُّسَمًّى ذَٰلِكُمُ ٱللَّهُ رَبُّكُمْ لَهُ ٱلْمُلْكُ وَٱلَّذِينَ تَدْعُونَ مِن دُونِهِۦ مَا يَمْلِكُونَ مِن قِطْمِيرٍ",
    "translation_en": "He causes the night to enter the day, and He causes the day to enter the night and has subjected the sun and the moon - each running [its course] for a specified term. That is Allah, your Lord; to Him belongs sovereignty. And those whom you invoke other than Him do not possess [as much as] the membrane of a date seed.",
    "translation_id": "Dia memasukkan malam ke dalam siang dan memasukkan siang ke dalam malam dan menundukkan matahari dan bulan, masing-masing berjalan menurut waktu yang ditentukan. Yang (berbuat) demikian itulah Allah Tuhanmu, kepunyaan-Nya-lah kerajaan. Dan orang-orang yang kamu seru (sembah) selain Allah tiada mempunyai apa-apa walaupun setipis kulit ari."
  }, {
    "number": 14,
    "text": "إِن تَدْعُوهُمْ لَا يَسْمَعُوا۟ دُعَآءَكُمْ وَلَوْ سَمِعُوا۟ مَا ٱسْتَجَابُوا۟ لَكُمْ وَيَوْمَ ٱلْقِيَٰمَةِ يَكْفُرُونَ بِشِرْكِكُمْ وَلَا يُنَبِّئُكَ مِثْلُ خَبِيرٍ",
    "translation_en": "If you invoke them, they do not hear your supplication; and if they heard, they would not respond to you. And on the Day of Resurrection they will deny your association. And none can inform you like [one] Acquainted [with all matters].",
    "translation_id": "Jika kamu menyeru mereka, mereka tiada mendengar seruanmu; dan kalau mereka mendengar, mereka tidak dapat memperkenankan permintaanmu. Dan dihari kiamat mereka akan mengingkari kemusyirikanmu dan tidak ada yang dapat memberi keterangan kepadamu sebagai yang diberikan oleh Yang Maha Mengetahui."
  }, {
    "number": 15,
    "text": "يَٰٓأَيُّهَا ٱلنَّاسُ أَنتُمُ ٱلْفُقَرَآءُ إِلَى ٱللَّهِ وَٱللَّهُ هُوَ ٱلْغَنِىُّ ٱلْحَمِيدُ",
    "translation_en": "O mankind, you are those in need of Allah, while Allah is the Free of need, the Praiseworthy.",
    "translation_id": "Hai manusia, kamulah yang berkehendak kepada Allah; dan Allah Dialah Yang Maha Kaya (tidak memerlukan sesuatu) lagi Maha Terpuji."
  }, {
    "number": 16,
    "text": "إِن يَشَأْ يُذْهِبْكُمْ وَيَأْتِ بِخَلْقٍ جَدِيدٍ",
    "translation_en": "If He wills, He can do away with you and bring forth a new creation.",
    "translation_id": "Jika Dia menghendaki, niscaya Dia memusnahkan kamu dan mendatangkan makhluk yang baru (untuk menggantikan kamu)."
  }, {
    "number": 17,
    "text": "وَمَا ذَٰلِكَ عَلَى ٱللَّهِ بِعَزِيزٍ",
    "translation_en": "And that is for Allah not difficult.",
    "translation_id": "Dan yang demikian itu sekali-kali tidak sulit bagi Allah."
  }, {
    "number": 18,
    "text": "وَلَا تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَىٰ وَإِن تَدْعُ مُثْقَلَةٌ إِلَىٰ حِمْلِهَا لَا يُحْمَلْ مِنْهُ شَىْءٌ وَلَوْ كَانَ ذَا قُرْبَىٰٓ إِنَّمَا تُنذِرُ ٱلَّذِينَ يَخْشَوْنَ رَبَّهُم بِٱلْغَيْبِ وَأَقَامُوا۟ ٱلصَّلَوٰةَ وَمَن تَزَكَّىٰ فَإِنَّمَا يَتَزَكَّىٰ لِنَفْسِهِۦ وَإِلَى ٱللَّهِ ٱلْمَصِيرُ",
    "translation_en": "And no bearer of burdens will bear the burden of another. And if a heavily laden soul calls [another] to [carry some of] its load, nothing of it will be carried, even if he should be a close relative. You can only warn those who fear their Lord unseen and have established prayer. And whoever purifies himself only purifies himself for [the benefit of] his soul. And to Allah is the [final] destination.",
    "translation_id": "Dan orang yang berdosa tidak akan memikul dosa orang lain. Dan jika seseorang yang berat dosanya memanggil (orang lain) untuk memikul dosanya itu tiadalah akan dipikulkan untuknya sedikitpun meskipun (yang dipanggilnya itu) kaum kerabatnya. Sesungguhnya yang dapat kamu beri peringatan hanya orang-orang yang takut kepada azab Tuhannya (sekalipun) mereka tidak melihat-Nya dan mereka mendirikan sembahyang. Dan barangsiapa yang mensucikan dirinya, sesungguhnya ia mensucikan diri untuk kebaikan dirinya sendiri. Dan kepada Allahlah kembali(mu)."
  }, {
    "number": 19,
    "text": "وَمَا يَسْتَوِى ٱلْأَعْمَىٰ وَٱلْبَصِيرُ",
    "translation_en": "Not equal are the blind and the seeing,",
    "translation_id": "Dan tidaklah sama orang yang buta dengan orang yang melihat."
  }, {
    "number": 20,
    "text": "وَلَا ٱلظُّلُمَٰتُ وَلَا ٱلنُّورُ",
    "translation_en": "Nor are the darknesses and the light,",
    "translation_id": "dan tidak (pula) sama gelap gulita dengan cahaya,"
  }, {
    "number": 21,
    "text": "وَلَا ٱلظِّلُّ وَلَا ٱلْحَرُورُ",
    "translation_en": "Nor are the shade and the heat,",
    "translation_id": "dan tidak (pula) sama yang teduh dengan yang panas,"
  }, {
    "number": 22,
    "text": "وَمَا يَسْتَوِى ٱلْأَحْيَآءُ وَلَا ٱلْأَمْوَٰتُ إِنَّ ٱللَّهَ يُسْمِعُ مَن يَشَآءُ وَمَآ أَنتَ بِمُسْمِعٍ مَّن فِى ٱلْقُبُورِ",
    "translation_en": "And not equal are the living and the dead. Indeed, Allah causes to hear whom He wills, but you cannot make hear those in the graves.",
    "translation_id": "dan tidak (pula) sama orang-orang yang hidup dan orang-orang yang mati. Sesungguhnya Allah memberi pendengaran kepada siapa yang dikehendaki-Nya dan kamu sekali-kali tiada sanggup menjadikan orang yang didalam kubur dapat mendengar."
  }, {
    "number": 23,
    "text": "إِنْ أَنتَ إِلَّا نَذِيرٌ",
    "translation_en": "You, [O Muhammad], are not but a warner.",
    "translation_id": "Kamu tidak lain hanyalah seorang pemberi peringatan."
  }, {
    "number": 24,
    "text": "إِنَّآ أَرْسَلْنَٰكَ بِٱلْحَقِّ بَشِيرًا وَنَذِيرًا وَإِن مِّنْ أُمَّةٍ إِلَّا خَلَا فِيهَا نَذِيرٌ",
    "translation_en": "Indeed, We have sent you with the truth as a bringer of good tidings and a warner. And there was no nation but that there had passed within it a warner.",
    "translation_id": "Sesungguhnya Kami mengutus kamu dengan membawa kebenaran sebagai pembawa berita gembira dan sebagai pemberi peringatan. Dan tidak ada suatu umatpun melainkan telah ada padanya seorang pemberi peringatan."
  }, {
    "number": 25,
    "text": "وَإِن يُكَذِّبُوكَ فَقَدْ كَذَّبَ ٱلَّذِينَ مِن قَبْلِهِمْ جَآءَتْهُمْ رُسُلُهُم بِٱلْبَيِّنَٰتِ وَبِٱلزُّبُرِ وَبِٱلْكِتَٰبِ ٱلْمُنِيرِ",
    "translation_en": "And if they deny you - then already have those before them denied. Their messengers came to them with clear proofs and written ordinances and with the enlightening Scripture.",
    "translation_id": "Dan jika mereka mendustakan kamu, maka sesungguhnya orang-orang yang sebelum mereka telah mendustakan (rasul-rasulnya); kepada mereka telah datang rasul-rasulnya dengan membawa mukjizat yang nyata, zubur, dan kitab yang memberi penjelasan yang sempurna."
  }, {
    "number": 26,
    "text": "ثُمَّ أَخَذْتُ ٱلَّذِينَ كَفَرُوا۟ فَكَيْفَ كَانَ نَكِيرِ",
    "translation_en": "Then I seized the ones who disbelieved, and how [terrible] was My reproach.",
    "translation_id": "Kemudian Aku azab orang-orang yang kafir; maka (lihatlah) bagaimana (hebatnya) akibat kemurkaan-Ku."
  }, {
    "number": 27,
    "text": "أَلَمْ تَرَ أَنَّ ٱللَّهَ أَنزَلَ مِنَ ٱلسَّمَآءِ مَآءً فَأَخْرَجْنَا بِهِۦ ثَمَرَٰتٍ مُّخْتَلِفًا أَلْوَٰنُهَا وَمِنَ ٱلْجِبَالِ جُدَدٌۢ بِيضٌ وَحُمْرٌ مُّخْتَلِفٌ أَلْوَٰنُهَا وَغَرَابِيبُ سُودٌ",
    "translation_en": "Do you not see that Allah sends down rain from the sky, and We produce thereby fruits of varying colors? And in the mountains are tracts, white and red of varying shades and [some] extremely black.",
    "translation_id": "Tidakkah kamu melihat bahwasanya Allah menurunkan hujan dari langit lalu Kami hasilkan dengan hujan itu buah-buahan yang beraneka macam jenisnya. Dan di antara gunung-gunung itu ada garis-garis putih dan merah yang beraneka macam warnanya dan ada (pula) yang hitam pekat."
  }, {
    "number": 28,
    "text": "وَمِنَ ٱلنَّاسِ وَٱلدَّوَآبِّ وَٱلْأَنْعَٰمِ مُخْتَلِفٌ أَلْوَٰنُهُۥ كَذَٰلِكَ إِنَّمَا يَخْشَى ٱللَّهَ مِنْ عِبَادِهِ ٱلْعُلَمَٰٓؤُا۟ إِنَّ ٱللَّهَ عَزِيزٌ غَفُورٌ",
    "translation_en": "And among people and moving creatures and grazing livestock are various colors similarly. Only those fear Allah, from among His servants, who have knowledge. Indeed, Allah is Exalted in Might and Forgiving.",
    "translation_id": "Dan demikian (pula) di antara manusia, binatang-binatang melata dan binatang-binatang ternak ada yang bermacam-macam warnanya (dan jenisnya). Sesungguhnya yang takut kepada Allah di antara hamba-hamba-Nya, hanyalah ulama. Sesungguhnya Allah Maha Perkasa lagi Maha Pengampun."
  }, {
    "number": 29,
    "text": "إِنَّ ٱلَّذِينَ يَتْلُونَ كِتَٰبَ ٱللَّهِ وَأَقَامُوا۟ ٱلصَّلَوٰةَ وَأَنفَقُوا۟ مِمَّا رَزَقْنَٰهُمْ سِرًّا وَعَلَانِيَةً يَرْجُونَ تِجَٰرَةً لَّن تَبُورَ",
    "translation_en": "Indeed, those who recite the Book of Allah and establish prayer and spend [in His cause] out of what We have provided them, secretly and publicly, [can] expect a profit that will never perish -",
    "translation_id": "Sesungguhnya orang-orang yang selalu membaca kitab Allah dan mendirikan shalat dan menafkahkan sebahagian dari rezeki yang Kami anugerahkan kepada mereka dengan diam-diam dan terang-terangan, mereka itu mengharapkan perniagaan yang tidak akan merugi,"
  }, {
    "number": 30,
    "text": "لِيُوَفِّيَهُمْ أُجُورَهُمْ وَيَزِيدَهُم مِّن فَضْلِهِۦٓ إِنَّهُۥ غَفُورٌ شَكُورٌ",
    "translation_en": "That He may give them in full their rewards and increase for them of His bounty. Indeed, He is Forgiving and Appreciative.",
    "translation_id": "agar Allah menyempurnakan kepada mereka pahala mereka dan menambah kepada mereka dari karunia-Nya. Sesungguhnya Allah Maha Pengampun lagi Maha Mensyukuri."
  }, {
    "number": 31,
    "text": "وَٱلَّذِىٓ أَوْحَيْنَآ إِلَيْكَ مِنَ ٱلْكِتَٰبِ هُوَ ٱلْحَقُّ مُصَدِّقًا لِّمَا بَيْنَ يَدَيْهِ إِنَّ ٱللَّهَ بِعِبَادِهِۦ لَخَبِيرٌۢ بَصِيرٌ",
    "translation_en": "And that which We have revealed to you, [O Muhammad], of the Book is the truth, confirming what was before it. Indeed, Allah, of His servants, is Acquainted and Seeing.",
    "translation_id": "Dan apa yang telah Kami wahyukan kepadamu yaitu Al Kitab (Al Quran) itulah yang benar, dengan membenarkan kitab-kitab yang sebelumnya. Sesungguhnya Allah benar-benar Maha Mengetahui lagi Maha Melihat (keadaan) hamba-hamba-Nya."
  }, {
    "number": 32,
    "text": "ثُمَّ أَوْرَثْنَا ٱلْكِتَٰبَ ٱلَّذِينَ ٱصْطَفَيْنَا مِنْ عِبَادِنَا فَمِنْهُمْ ظَالِمٌ لِّنَفْسِهِۦ وَمِنْهُم مُّقْتَصِدٌ وَمِنْهُمْ سَابِقٌۢ بِٱلْخَيْرَٰتِ بِإِذْنِ ٱللَّهِ ذَٰلِكَ هُوَ ٱلْفَضْلُ ٱلْكَبِيرُ",
    "translation_en": "Then we caused to inherit the Book those We have chosen of Our servants; and among them is he who wrongs himself, and among them is he who is moderate, and among them is he who is foremost in good deeds by permission of Allah. That [inheritance] is what is the great bounty.",
    "translation_id": "Kemudian Kitab itu Kami wariskan kepada orang-orang yang Kami pilih di antara hamba-hamba Kami, lalu di antara mereka ada yang menganiaya diri mereka sendiri dan di antara mereka ada yang pertengahan dan diantara mereka ada (pula) yang lebih dahulu berbuat kebaikan dengan izin Allah. Yang demikian itu adalah karunia yang amat besar."
  }, {
    "number": 33,
    "text": "جَنَّٰتُ عَدْنٍ يَدْخُلُونَهَا يُحَلَّوْنَ فِيهَا مِنْ أَسَاوِرَ مِن ذَهَبٍ وَلُؤْلُؤًا وَلِبَاسُهُمْ فِيهَا حَرِيرٌ",
    "translation_en": "[For them are] gardens of perpetual residence which they will enter. They will be adorned therein with bracelets of gold and pearls, and their garments therein will be silk.",
    "translation_id": "(Bagi mereka) surga 'Adn mereka masuk ke dalamnya, di dalamnya mereka diberi perhiasan dengan gelang-gelang dari emas, dan dengan mutiara, dan pakaian mereka didalamnya adalah sutera."
  }, {
    "number": 34,
    "text": "وَقَالُوا۟ ٱلْحَمْدُ لِلَّهِ ٱلَّذِىٓ أَذْهَبَ عَنَّا ٱلْحَزَنَ إِنَّ رَبَّنَا لَغَفُورٌ شَكُورٌ",
    "translation_en": "And they will say, \"Praise to Allah, who has removed from us [all] sorrow. Indeed, our Lord is Forgiving and Appreciative -",
    "translation_id": "Dan mereka berkata: \"Segala puji bagi Allah yang telah menghilangkan duka cita dari kami. Sesungguhnya Tuhan kami benar-benar Maha Pengampum lagi Maha Mensyukuri."
  }, {
    "number": 35,
    "text": "ٱلَّذِىٓ أَحَلَّنَا دَارَ ٱلْمُقَامَةِ مِن فَضْلِهِۦ لَا يَمَسُّنَا فِيهَا نَصَبٌ وَلَا يَمَسُّنَا فِيهَا لُغُوبٌ",
    "translation_en": "He who has settled us in the home of duration out of His bounty. There touches us not in it any fatigue, and there touches us not in it weariness [of mind].\"",
    "translation_id": "Yang menempatkan kami dalam tempat yang kekal (surga) dari karunia-Nya; didalamnya kami tiada merasa lelah dan tiada pula merasa lesu\"."
  }, {
    "number": 36,
    "text": "وَٱلَّذِينَ كَفَرُوا۟ لَهُمْ نَارُ جَهَنَّمَ لَا يُقْضَىٰ عَلَيْهِمْ فَيَمُوتُوا۟ وَلَا يُخَفَّفُ عَنْهُم مِّنْ عَذَابِهَا كَذَٰلِكَ نَجْزِى كُلَّ كَفُورٍ",
    "translation_en": "And for those who disbelieve will be the fire of Hell. [Death] is not decreed for them so they may die, nor will its torment be lightened for them. Thus do we recompense every ungrateful one.",
    "translation_id": "Dan orang-orang kafir bagi mereka neraka Jahannam. Mereka tidak dibinasakan sehingga mereka mati dan tidak (pula) diringankan dari mereka azabnya. Demikianlah Kami membalas setiap orang yang sangat kafir."
  }, {
    "number": 37,
    "text": "وَهُمْ يَصْطَرِخُونَ فِيهَا رَبَّنَآ أَخْرِجْنَا نَعْمَلْ صَٰلِحًا غَيْرَ ٱلَّذِى كُنَّا نَعْمَلُ أَوَلَمْ نُعَمِّرْكُم مَّا يَتَذَكَّرُ فِيهِ مَن تَذَكَّرَ وَجَآءَكُمُ ٱلنَّذِيرُ فَذُوقُوا۟ فَمَا لِلظَّٰلِمِينَ مِن نَّصِيرٍ",
    "translation_en": "And they will cry out therein, \"Our Lord, remove us; we will do righteousness - other than what we were doing!\" But did We not grant you life enough for whoever would remember therein to remember, and the warner had come to you? So taste [the punishment], for there is not for the wrongdoers any helper.",
    "translation_id": "Dan mereka berteriak di dalam neraka itu: \"Ya Tuhan kami, keluarkanlah kami niscaya kami akan mengerjakan amal yang saleh berlainan dengan yang telah kami kerjakan\". Dan apakah Kami tidak memanjangkan umurmu dalam masa yang cukup untuk berfikir bagi orang yang mau berfikir, dan (apakah tidak) datang kepada kamu pemberi peringatan? maka rasakanlah (azab Kami) dan tidak ada bagi orang-orang yang zalim seorang penolongpun."
  }, {
    "number": 38,
    "text": "إِنَّ ٱللَّهَ عَٰلِمُ غَيْبِ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ إِنَّهُۥ عَلِيمٌۢ بِذَاتِ ٱلصُّدُورِ",
    "translation_en": "Indeed, Allah is Knower of the unseen [aspects] of the heavens and earth. Indeed, He is Knowing of that within the breasts.",
    "translation_id": "Sesungguhnya Allah mengetahui yang tersembunyi di langit dan di bumi. Sesungguhnya Dia Maha Mengetahui segala isi hati."
  }, {
    "number": 39,
    "text": "هُوَ ٱلَّذِى جَعَلَكُمْ خَلَٰٓئِفَ فِى ٱلْأَرْضِ فَمَن كَفَرَ فَعَلَيْهِ كُفْرُهُۥ وَلَا يَزِيدُ ٱلْكَٰفِرِينَ كُفْرُهُمْ عِندَ رَبِّهِمْ إِلَّا مَقْتًا وَلَا يَزِيدُ ٱلْكَٰفِرِينَ كُفْرُهُمْ إِلَّا خَسَارًا",
    "translation_en": "It is He who has made you successors upon the earth. And whoever disbelieves - upon him will be [the consequence of] his disbelief. And the disbelief of the disbelievers does not increase them in the sight of their Lord except in hatred; and the disbelief of the disbelievers does not increase them except in loss.",
    "translation_id": "Dialah yang menjadikan kamu khalifah-khalifah di muka bumi. Barangsiapa yang kafir, maka (akibat) kekafirannya menimpa dirinya sendiri. Dan kekafiran orang-orang yang kafir itu tidak lain hanyalah akan menambah kemurkaan pada sisi Tuhannya dan kekafiran orang-orang yang kafir itu tidak lain hanyalah akan menambah kerugian mereka belaka."
  }, {
    "number": 40,
    "text": "قُلْ أَرَءَيْتُمْ شُرَكَآءَكُمُ ٱلَّذِينَ تَدْعُونَ مِن دُونِ ٱللَّهِ أَرُونِى مَاذَا خَلَقُوا۟ مِنَ ٱلْأَرْضِ أَمْ لَهُمْ شِرْكٌ فِى ٱلسَّمَٰوَٰتِ أَمْ ءَاتَيْنَٰهُمْ كِتَٰبًا فَهُمْ عَلَىٰ بَيِّنَتٍ مِّنْهُ بَلْ إِن يَعِدُ ٱلظَّٰلِمُونَ بَعْضُهُم بَعْضًا إِلَّا غُرُورًا",
    "translation_en": "Say, \"Have you considered your 'partners' whom you invoke besides Allah? Show me what they have created from the earth, or have they partnership [with Him] in the heavens? Or have We given them a book so they are [standing] on evidence therefrom? [No], rather, the wrongdoers do not promise each other except delusion.\"",
    "translation_id": "Katakanlah: \"Terangkanlah kepada-Ku tentang sekutu-sekutumu yang kamu seru selain Allah. Perlihatkanlah kepada-Ku (bahagian) manakah dari bumi ini yang telah mereka ciptakan ataukah mereka mempunyai saham dalam (penciptaan) langit atau adakah Kami memberi kepada mereka sebuah Kitab sehingga mereka mendapat keterangan-keterangan yang jelas daripadanya? Sebenarnya orang-orang yang zalim itu sebahagian dari mereka tidak menjanjikan kepada sebahagian yang lain, melainkan tipuan belaka\"."
  }, {
    "number": 41,
    "text": "إِنَّ ٱللَّهَ يُمْسِكُ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضَ أَن تَزُولَا وَلَئِن زَالَتَآ إِنْ أَمْسَكَهُمَا مِنْ أَحَدٍ مِّنۢ بَعْدِهِۦٓ إِنَّهُۥ كَانَ حَلِيمًا غَفُورًا",
    "translation_en": "Indeed, Allah holds the heavens and the earth, lest they cease. And if they should cease, no one could hold them [in place] after Him. Indeed, He is Forbearing and Forgiving.",
    "translation_id": "Sesungguhnya Allah menahan langit dan bumi supaya jangan lenyap; dan sungguh jika keduanya akan lenyap tidak ada seorangpun yang dapat menahan keduanya selain Allah. Sesungguhnya Dia adalah Maha Penyantun lagi Maha Pengampun."
  }, {
    "number": 42,
    "text": "وَأَقْسَمُوا۟ بِٱللَّهِ جَهْدَ أَيْمَٰنِهِمْ لَئِن جَآءَهُمْ نَذِيرٌ لَّيَكُونُنَّ أَهْدَىٰ مِنْ إِحْدَى ٱلْأُمَمِ فَلَمَّا جَآءَهُمْ نَذِيرٌ مَّا زَادَهُمْ إِلَّا نُفُورًا",
    "translation_en": "And they swore by Allah their strongest oaths that if a warner came to them, they would be more guided than [any] one of the [previous] nations. But when a warner came to them, it did not increase them except in aversion.",
    "translation_id": "Dan mereka bersumpah dengan nama Allah dengan sekuat-kuat sumpah; sesungguhnya jika datang kepada mereka seorang pemberi peringatan, niscaya mereka akan lebih mendapat petunjuk dari salah satu umat-umat (yang lain). Tatkala datang kepada mereka pemberi peringatan, maka kedatangannya itu tidak menambah kepada mereka, kecuali jauhnya mereka dari (kebenaran),"
  }, {
    "number": 43,
    "text": "ٱسْتِكْبَارًا فِى ٱلْأَرْضِ وَمَكْرَ ٱلسَّيِّئِ وَلَا يَحِيقُ ٱلْمَكْرُ ٱلسَّيِّئُ إِلَّا بِأَهْلِهِۦ فَهَلْ يَنظُرُونَ إِلَّا سُنَّتَ ٱلْأَوَّلِينَ فَلَن تَجِدَ لِسُنَّتِ ٱللَّهِ تَبْدِيلًا وَلَن تَجِدَ لِسُنَّتِ ٱللَّهِ تَحْوِيلًا",
    "translation_en": "[Due to] arrogance in the land and plotting of evil; but the evil plot does not encompass except its own people. Then do they await except the way of the former peoples? But you will never find in the way of Allah any change, and you will never find in the way of Allah any alteration.",
    "translation_id": "karena kesombongan (mereka) di muka bumi dan karena rencana (mereka) yang jahat. Rencana yang jahat itu tidak akan menimpa selain orang yang merencanakannya sendiri. Tiadalah yang mereka nanti-nantikan melainkan (berlakunya) sunnah (Allah yang telah berlaku) kepada orang-orang yang terdahulu. Maka sekali-kali kamu tidak akan mendapat penggantian bagi sunnah Allah, dan sekali-kali tidak (pula) akan menemui penyimpangan bagi sunnah Allah itu."
  }, {
    "number": 44,
    "text": "أَوَلَمْ يَسِيرُوا۟ فِى ٱلْأَرْضِ فَيَنظُرُوا۟ كَيْفَ كَانَ عَٰقِبَةُ ٱلَّذِينَ مِن قَبْلِهِمْ وَكَانُوٓا۟ أَشَدَّ مِنْهُمْ قُوَّةً وَمَا كَانَ ٱللَّهُ لِيُعْجِزَهُۥ مِن شَىْءٍ فِى ٱلسَّمَٰوَٰتِ وَلَا فِى ٱلْأَرْضِ إِنَّهُۥ كَانَ عَلِيمًا قَدِيرًا",
    "translation_en": "Have they not traveled through the land and observed how was the end of those before them? And they were greater than them in power. But Allah is not to be caused failure by anything in the heavens or on the earth. Indeed, He is ever Knowing and Competent.",
    "translation_id": "Dan apakah mereka tidak berjalan di muka bumi, lalu melihat bagaimana kesudahan orang-orang yang sebelum mereka, sedangkan orang-orang itu adalah lebih besar kekuatannya dari mereka? Dan tiada sesuatupun yang dapat melemahkan Allah baik di langit maupun di bumi. Sesungguhnya Allah Maha Mengetahui lagi Maha Kuasa."
  }, {
    "number": 45,
    "text": "وَلَوْ يُؤَاخِذُ ٱللَّهُ ٱلنَّاسَ بِمَا كَسَبُوا۟ مَا تَرَكَ عَلَىٰ ظَهْرِهَا مِن دَآبَّةٍ وَلَٰكِن يُؤَخِّرُهُمْ إِلَىٰٓ أَجَلٍ مُّسَمًّى فَإِذَا جَآءَ أَجَلُهُمْ فَإِنَّ ٱللَّهَ كَانَ بِعِبَادِهِۦ بَصِيرًۢا",
    "translation_en": "And if Allah were to impose blame on the people for what they have earned, He would not leave upon the earth any creature. But He defers them for a specified term. And when their time comes, then indeed Allah has ever been, of His servants, Seeing.",
    "translation_id": "Dan kalau sekiranya Allah menyiksa manusia disebabkan usahanya, niscaya Dia tidak akan meninggalkan di atas permukaan bumi suatu mahluk yang melatapun akan tetapi Allah menangguhkan (penyiksaan) mereka, sampai waktu yang tertentu; maka apabila datang ajal mereka, maka sesungguhnya Allah adalah Maha Melihat (keadaan) hamba-hamba-Nya."
  }],
  "tafsir": {
    "id": {
      "kemenag": {
        "name": "Kemenag",
        "source": "Aplikasi Quran Kementrian Agama Republik Indonesia",
        "text": {
          "1": "Pada ayat ini, Allah menerangkan bahwa puji dan syukur hanyalah bagi-Nya, yang telah menciptakan langit dan bumi serta apa yang ada di antara keduanya dengan ciptaan yang amat indah dan ajaib, ciptaan yang belum ada sebelumnya, dan telah diatur-Nya dengan tertib dan lengkap serta sempurna. Dia juga yang telah menugaskan malaikat menyampaikan wahyu kepada para nabi-Nya, untuk menyampaikan berbagai macam urusan. Malaikat itu adalah sejenis makhluk yang mempunyai sayap yang beraneka ragam, ada yang dua, tiga, atau empat bahkan ada yang lebih dari itu. Malaikat bertugas untuk menyampaikan segala perintah dan larangan Allah kepada para nabi-Nya. Allah berkuasa menambah sayap para malaikat lebih banyak lagi menurut kehendak-Nya, sesuai dengan keperluan. Tidak ada kekuatan yang dapat menghalangi-Nya, karena Allah itu Mahakuasa atas segala sesuatu. Di dalam suatu hadis diterangkan bahwa:\n\nSesungguhnya Nabi Muhammad saw melihat Malaikat Jibril pada malam isra' dalam bentuk aslinya, dia mempunyai enam ratus sayap, antara dua sayapnya seperti sepanjang mata memandang ke timur dan barat. (Riwayat Muslim dari Ibnu Mas'ud)",
          "2": "Pada ayat ini, Allah menerangkan bahwa pemberian atau penahanan suatu rahmat termasuk dalam kekuasaan-Nya. Apabila Dia menganugerahkan suatu rahmat kepada manusia, tidak seorang pun dapat menahan dan menghalangi-Nya. Begitu pula sebaliknya, apabila Dia menahan dan menutup sesuatu rahmat dan belum diberikan kepada siapa yang dikehendaki-Nya, maka tiada seorang pun bisa membuka dan memberikannya, karena semua urusan di tangan-Nya. Dia Maha Perkasa berbuat menurut kehendak dan kebijaksanaan-Nya. Oleh karena itu, kita harus selalu menghadap Allah melalui ibadah untuk mencapai cita-cita kita, dan senantiasa dengan bertawakal kepada-Nya, begitu pula di dalam usaha mencapai tujuan dan maksud yang diridai-Nya. Sejalan dengan ini, Allah berfirman:\n\nDan jika Allah menimpakan suatu bencana kepadamu, maka tidak ada yang dapat menghilangkannya kecuali Dia. Dan jika Allah menghendaki kebaikan bagi kamu, maka tidak ada yang dapat menolak karunia-Nya. (Yunus/10: 107) \n\nDan dalam sebuah hadis disebutkan sebagai berikut:\n\nDari al-Mugirah bin Syu'bah bahwa ia berkata, \"Saya mendengar Rasulullah saw apabila selesai salat mengucapkan, 'Tiada tuhan melainkan Allah. Dia Esa tiada ada sekutu bagi-Nya. Bagi-Nya kerajaan dan bagi-Nya segala puji. Dia kuasa atas segala sesuatu. Ya Allah Tuhanku, tidak ada seorang pencegah pun terhadap sesuatu yang Engkau berikan dan tak ada seorang pemberi terhadap sesuatu yang Engkau cegah, tidak bermanfaat kejayaan seseorang dalam menghadapi siksaan Engkau.\" (Riwayat Ahmad, al-Bukhari dan Muslim)",
          "3": "Pada ayat ini, Allah menganjurkan supaya manusia memberikan perhatian secara khusus atas nikmat yang telah diberikan kepadanya dan menjaganya agar tidak lenyap dan menghilang. Untuk kepentingan ini, manusia selalu harus merendahkan diri mengakui bahwa semua nikmat itu dari Allah sebagai anugerah kepadanya, yang wajib disyukuri dengan melakukan ibadah kepada-Nya tidak kepada lain-Nya, taat kepada segala perintah-Nya, dan menjauhi semua larangan-Nya. Satu-satunya cara untuk memelihara dan menjaga kelestarian nikmat yang ada pada seseorang ialah mensyukuri nikmat itu. Dengan demikian, Allah akan selalu menambahnya. Sebaliknya, kalau nikmat itu tidak disyukuri, maka Allah akan menimpakan azab yang keras, sebagaimana firman-Nya:\n\nDan (ingatlah) ketika Tuhanmu memaklumkan, \"Sesungguhnya jika kamu bersyukur, niscaya Aku akan menambah (nikmat) kepadamu.\" (Ibrahim/14: 7)\n\nAllah satu-satunya pemberi rezeki yang hakiki, baik yang turun dari langit berupa hujan dan sebagainya, maupun yang tumbuh dari bumi berupa keperluan hidup seperti beras, air, pakaian, dan sebagainya. Tidak ada Tuhan melainkan Dia. Kalau manusia mau mengerti dan menyadari semuanya itu, tentunya dia tidak akan berpaling daripada-Nya, tetapi dia akan tetap mengesakan-Nya, menyembah hanya kepada-Nya, tidak kepada yang lain-Nya.",
          "4": "Pada ayat ini, Allah menghibur Nabi Muhammad bahwa kalau kaumnya mendustakannya terus-menerus atas kebenaran yang disampaikannya sesudah ia mengemukakan alasan-alasan dan tamsil (ibarat) kepada mereka, maka hendaklah ia bersabar sebagaimana halnya rasul-rasul sebelumnya yang selalu disakiti oleh kaumnya, sampai tiba saatnya ia mendapat kemenangan sesuai dengan ketentuan Allah yang telah dijanjikan-Nya. Hendaklah ia mengembalikan segala urusan kepada Allah. Dia akan memberi balasan atas kesabarannya dan imbalan siksa kepada kaumnya yang selalu mendustakan-Nya.",
          "5": "Pada ayat ini, Allah menerangkan kebenaran janji-Nya, yaitu terjadinya hari Kebangkitan dan hari Pembalasan. Apabila seseorang taat kepada perintah-Nya akan diberi pahala, dan orang yang mendurhakai-Nya akan disiksa. Janji Allah pada waktunya akan menjadi kenyataan. Dia itu tidak akan pernah menyalahi janji-Nya, sebagaimana firman Allah:\n\nSungguh, Allah tidak menyalahi janji. (ali 'Imran/3: 9) \n\nOleh karena itu, tidaklah pada tempatnya bila seseorang teperdaya dengan kehidupan dunia yang mewah, sehingga ia \"lupa daratan\", bahkan melupakan Tuhan. Semua waktunya dipergunakan untuk menumpuk harta tanpa mengingat Allah sedikit pun. Hal demikian itu dilarang oleh Allah sebagaimana firman-Nya:\n\nWahai orang-orang yang beriman! Janganlah harta benda dan anak-anakmu melalaikan kamu dari mengingat Allah. (al-Munafiqun/63: 9)\n\nBegitu pula janganlah seseorang dapat tertipu dan teperdaya dengan bujukan dan godaan setan, dengan mudah menuruti bisikan dan ajakannya karena setan tidak hanya mengajak kepada hal-hal yang keji dan mungkar, tetapi kadangkala ia menyuruh orang untuk berbuat baik dengan tujuan ria. Allah berfirman :\n\nWahai orang-orang yang beriman! Janganlah kamu mengikuti langkah-langkah setan. Barang siapa mengikuti langkah-langkah setan, maka sesungguhnya dia (setan) menyuruh mengerjakan perbuatan yang keji dan mungkar. (an-Nur/24: 21)",
          "6": "Pada ayat ini, Allah menerangkan bahwa setan itu adalah musuh abadi bagi manusia yang selalu membuat keraguan, membisikkan yang jahat dengan daya tariknya yang memesona, supaya manusia menuruti dan mengerjakannya. Firman Allah:\n\nSetan telah menjadikan terasa indah bagi mereka perbuatan (buruk) mereka, sehingga menghalangi mereka dari jalan (Allah), sedangkan mereka adalah orang-orang yang berpandangan tajam. (al-'Ankabut/29: 38)\n\nOleh karena itu, hendaklah manusia menganggap dan menjadikan setan itu musuhnya yang sangat berbahaya, yang tidak perlu dilayani dan diikuti sama sekali, sebagaimana firman Allah:\n\nDan janganlah kamu mengikuti langkah-langkah setan. Sesungguhnya setan itu musuh yang nyata bagimu. (al-An'am/6: 142) \n\nPada akhir ayat ini ditegaskan bahwa maksud dan tujuan setan mendorong manusia berbuat yang bertentangan dengan perintah Allah adalah untuk mencari teman sebanyak-banyaknya, menjadi penghuni neraka yang menyala-nyala. Firman Allah:\n\nApakah mereka (akan mengikuti nenek moyang mereka) walaupun sebenarnya setan menyeru mereka ke dalam azab api yang menyala-nyala (neraka)? (Luqman/31: 21)",
          "7": "Dalam ayat ini diterangkan bahwa orang-orang yang ingkar kepada Allah dan rasul-Nya akan mendapat azab yang keras dan pedih di dalam neraka. Azab itu sebagai balasan atas keingkaran mereka pada bujukan setan, lalu mengikuti langkah-langkahnya. Adapun orang-orang yang membenarkan perintah-perintah yang dibawa oleh rasul-Nya dan mengerjakan amal saleh akan memperoleh ampunan dan pahala yang besar. Dosa-dosa mereka diampuni oleh Allah, pahala mereka dilipatgandakan dan telah disiapkan surga sebagai balasan atas iman yang mantap di dalam hati mereka dan amal saleh yang ikhlas karena Allah semata. Firman Allah:\n\nDan sampaikanlah kabar gembira kepada orang-orang yang beriman dan berbuat kebajikan, bahwa untuk mereka (disediakan) surga-surga yang mengalir di bawahnya sungai-sungai. (al-Baqarah/2: 25)",
          "8": "Pada ayat ini, Allah menerangkan perbedaan besar antara dua golongan disebut pada ayat sebelumnya. Orang-orang yang teperdaya dan dapat ditipu oleh setan, sehingga pekerjaan mereka yang buruk dianggapnya baik, tentunya tidak sama dengan orang-orang yang tidak dapat ditipu oleh setan. Sebagaimana firman Allah:\n\nKatakanlah (Muhammad), \"Apakah perlu Kami beritahukan kepadamu tentang orang yang paling rugi perbuatannya?\" (Yaitu) orang yang sia-sia perbuatannya dalam kehidupan dunia, sedangkan mereka mengira telah berbuat sebaik-baiknya. (al-Kahf/18: 103-104)\n\nTersesat atau mendapat petunjuk ada di tangan Allah. Dia menyesatkan atau memberikan petunjuk kepada orang yang dikehendaki-Nya, sesuai dengan kebijaksanaan-Nya, berdasarkan keadaan hamba yang bersangkutan. Orang-orang yang ditetapkan tersesat, dia selalu mengerjakan perbuatan buruk dan keji. Sebaliknya orang-orang yang diberi petunjuk oleh Allah, selalu mengerjakan amalan yang baik. Oleh karena itu, Nabi Muhammad dilarang Allah untuk sedih dan cemas menghadapi kaumnya yang belum mau beriman dan menerima ajakannya, sehingga tidak membinasakan dirinya. Hal semacam ini diterangkan juga di ayat yang lain, firman Allah:\n\nMaka barangkali engkau (Muhammad) akan mencelakakan dirimu karena bersedih hati setelah mereka berpaling, sekiranya mereka tidak beriman kepada keterangan ini (Al-Qur'an). (al-Kahf/18: 6)\n\nAyat ini ditutup dengan penegasan Allah bahwa Ia Mengetahui apa yang mereka perbuat, termasuk perbuatan buruk dan keji yang akan dibalas-Nya dengan balasan yang setimpal.",
          "9": "Pada ayat ini, Allah menerangkan bahwa Dia-lah Yang Menciptakan angin yang menggerakkan awan tebal yang mengandung air kemudian membawanya ke bumi yang tandus, dan menurunkan hujan. Dengan turunnya air hujan, bumi yang mati dan tidak ada pepohonan sedikit pun di atasnya berubah menjadi subur. Bumi menumbuhkan buah-buahan yang bermacam-macam dan beraneka ragam cita rasanya. Demikianlah Allah menghidupkan bumi sesudah mati dengan hujan yang turun dari awan. Kalau manusia mau menggunakan akalnya dan memikirkan dengan sungguh-sungguh tanda kekuasaan Allah seperti kejadian yang tersebut di atas, tentu ia akan sampai kepada suatu kesimpulan bahwa Allah yang berkuasa menghidupkan tanah yang mati, tentunya kuasa pula menghidupkan manusia yang sudah mati sekalipun telah hancur dan tulang-belulangnya berserakan.\n\nDiriwayatkan dari Abu Ruzain al-'Uqaili bahwa ia bertanya kepada Rasulullah saw tentang bagaimana cara Allah menghidupkan orang mati dan apa tanda-tandanya pada makhluk. Rasulullah saw menjawab, \"Wahai Abu Ruzain, pernahkah engkau melalui suatu lembah kaummu yang gersang, kemudian kamu melaluinya kembali dalam keadaan subur dan menghijau?\" Abu Ruzain menjawab, \"Pernah.\" Rasulullah bersabda, \"Begitulah Allah menghidupkan orang yang sudah mati.\"",
          "10": "Pada ayat ini, Allah menerangkan bahwa barang siapa ingin mendapatkan kemuliaan di dunia dan di akhirat, hendaklah ia senantiasa taat kepada Allah karena semua kemuliaan baik di dunia maupun di akhirat adalah kepunyaan-Nya. Dialah yang menerima perkataan-perkataan yang baik seperti kalimat tauhid, zikir, membaca Al-Qur'an, dan lainnya, begitu pula amal-amal yang baik yang disertai dengan keikhlasan akan diberi pahala oleh Allah. Sesuatu amal, baik berupa perkataan maupun perbuatan, yang dilakukan tanpa keikhlasan tidak akan berpahala, bahkan akan mendapat azab karena dianggap mendustakan agama. Ibadah salat, zakat, dan amal-amal baik yang lain apabila dilakukan dengan ria, yakni dikerjakan bukan untuk mencari keridaan Allah, tetapi mencari pujian atau ketenaran di masyarakat, tidak akan diterima oleh Allah. Firman Allah:\n\nMaka celakalah orang yang salat, (yaitu) orang-orang yang lalai terhadap salatnya, yang berbuat ria, dan enggan (memberikan) bantuan. (al-Ma'un/107: 4-7) \n\nOrang-orang yang merencanakan kejahatan terhadap orang-orang Islam, seperti merencanakan suatu hal yang akan menyebabkan mundurnya Islam atau kurang mendapat perhatian dari masyarakat dan lain-lain, akan mendapat siksa yang pedih di hari Kiamat dan rencana buruknya akan hancur tidak mencapai sasarannya seperti yang dialami orang-orang kafir Quraisy. Mereka dulu merencanakan akan menangkap Rasulullah saw lalu membunuh atau mengasingkannya di suatu tempat yang jauh dari tumpah darahnya, agar Islam menjadi lemah bahkan akan hilang lenyap di permukaan bumi.",
          "11": "Pada ayat ini, Allah menerangkan kejadian Adam yang menjadi nenek moyang manusia. Ia dijadikan oleh Allah langsung dari tanah, kemudian keturunannya dijadikan dari sperma yang pada hakikatnya juga berasal dari tanah karena berasal dari makanan berupa beras, sayur-sayuran dan lain-lain, yang berasal dari tanah. Kemudian mereka dijadikan berpasang-pasangan, terdiri dari laki-laki dan perempuan. Tidak ada seorang perempuan yang mengandung atau melahirkan kecuali semuanya diketahui oleh Allah, tidak ada yang tersembunyi bagi-Nya. Sejalan dengan ayat ini Allah berfirman:\n\nAllah mengetahui apa yang dikandung oleh setiap perempuan, apa yang kurang sempurna dan apa yang bertambah dalam rahim. Dan segala sesuatu ada ukuran di sisi-Nya. (Allah) Yang mengetahui semua yang gaib dan yang nyata; Yang Mahabesar, Mahatinggi. (ar-Ra'd/13: 8-9)\n\nTidak seorang pun yang berumur panjang, kecuali telah ditetapkan Allah lebih dahulu dan tertulis di Lauh Mahfudh, tidak akan bertambah dan tidak akan berkurang. Begitu pula orang yang telah ditetapkan berumur pendek, tidak akan lebih panjang dan tidak lebih pendek demi untuk menjaga keseimbangan di bumi supaya kemakmuran tertib jalannya. Hal demikian itu bagi Allah adalah mudah, karena Dia mengetahui segala sesuatu, tidak ada yang tersembunyi bagi-Nya.",
          "12": "Pada ayat ini, Allah menerangkan bahwa ada dua keistimewaan air, masing-masing mempunyai kegunaan sendiri-sendiri. Keduanya dapat menjadi tempat berkembang biak ikan yang lezat cita rasanya. Air tawar di sungai-sungai yang mengalir melalui desa-desa dan kota-kota besar, sedap diminum, menghilangkan dahaga, menyuburkan tanah, dan menumbuhkan rumput-rumputan, tanam-tanaman, dan pohon-pohonan. Perahu-perahu dapat berlayar di atasnya untuk membawa keperluan hidup dari satu tempat ke tempat lain. Sedangkan air asin, di dalamnya terdapat mutiara dan karang laut yang dapat dijadikan perhiasan, dan menjadi tempat berlayarnya kapal-kapal besar membawa hasil bumi dan tambang dari satu tempat ke tempat-tempat lain, baik di daerah sendiri maupun ke luar negeri sebagai barang ekspor atau mendatangkannya dari luar negeri sebagai barang impor, yang tidak dapat dijangkau oleh perahu-perahu kecil, sebagai barang dagangan untuk mencari karunia Allah. \n\nPada akhir ayat ini dijelaskan bahwa kekuasaan Allah dapat menundukkan air tawar dan air asin sehingga bisa dipergunakan menurut fungsinya masing-masing. Hal demikian itu bertujuan agar manusia bersyukur atas nikmat-nikmat yang telah dianugerahkan Allah kepadanya itu.\n\nMenurut para saintis, air nikmat diminum dan terasa segar apabila mengandung hanya sedikit garam terlarut, sedangkan rasa asin dan pahit air laut disebabkan oleh tingginya kandungan garam yang terlarut di dalamnya. Ukuran kandungan garam di dalam air biasa dinyatakan dengan kegaraman atau salinitas yang satuannya adalah gram garam per kg air, atau karena BD air = 1, dalam gram/liter. Empat belas abad yang lalu, ketika ilmu kimia praktis belum ada, ayat ini telah menyatakan bahwa salinitas air laut berbeda-beda. Kenyataan ini terbukti kini bahwa apa yang dinyatakan dalam ayat ini benar adanya. Hasil pengukuran di seluruh dunia memperlihatkan bahwa salinitas rata-rata air laut adalah sebesar 34,72 gr/l. Tetapi salinitas rata-rata ketiga samudra besar memiliki perbedaan: 34, 90 untuk Samudra Atlantik, 34,76 untuk Samudra Hindia dan 34,62 untuk Samudra Pasifik. Salinitas air di lautan terbuka umumnya bervariasi antara 33 sampai 37 gram/l. Salinitas tertinggi di laut terbuka dijumpai di Laut Merah ( sekitar 41 gr/l), sedangkan salinitas terendah dijumpai di Teluk Bothnia dan Laut Baltik (Masing-masing sekitar 10 dan 20 gr/l).",
          "13": "Pada ayat ini diterangkan bahwa Allah yang memasukkan malam ke dalam siang, maka jadilah siang itu lebih panjang dari malam, begitu pula sebaliknya. Dia memasukkan siang ke dalam malam maka jadilah malam itu lebih panjang dari siang. Silih bergantinya siang dengan malam merupakan suatu rahmat dari Allah. Pada waktu siang, manusia bekerja mencari rezeki dan pada waktu malam mereka beristirahat untuk melepaskan lelah dan mengumpulkan tenaga baru untuk dipergunakan lagi esok harinya.\n\nAllah menundukkan siang dan malam, dan menjadikan matahari dan bulan beredar menurut ketentuan yang telah digariskan. Tidak satu pun di antaranya yang menyalahi ketentuan itu, sehingga tidak terjadi tabrakan. Ini semua merupakan rahmat dari Allah, karena dengan demikian bilangan tahun dan perhitungan waktu dapat diketahui, sebagaimana ditegaskan Allah dalam ayat yang lain:\n\nDialah yang menjadikan matahari bersinar dan bulan bercahaya, dan Dialah yang menetapkan tempat-tempat orbitnya, agar kamu mengetahui bilangan tahun, dan perhitungan (waktu). (Yunus/10: 5) \n\nHanya Allah yang melakukan semua itu. Tuhan yang mempunyai kekuasaan yang sempurna dan mutlak. Dialah Tuhan yang wajib disembah. Semua yang ada di langit dan di bumi adalah hamba-Nya dan di bawah kekuasaan-Nya. Berbeda dengan berhala-berhala yang disembah orang-orang musyrik, yang tidak memiliki daya kemampuan sedikit pun, sekalipun setipis kulit ari. Bahkan, sembahan mereka itu adalah milik Allah Pencipta semesta alam.",
          "14": "Ayat ini menerangkan bahwa tuhan-tuhan yang mereka persekutukan dengan Allah tidak dapat mendengar apabila diseru oleh penyembahnya, karena hanya berupa benda mati yang tidak bernyawa. Andaipun dapat mendengar seruan penyembahnya, tuhan-tuhan itu tidak akan dapat berbuat apa-apa, serta tidak dapat melayani dan mengabulkan permintaan mereka di hari kiamat nanti. Tuhan-tuhan itu berlepas diri dari mereka, tidak mau bertanggung jawab, dan bahkan berkata, \"Sebenarnya mereka itu tidaklah menyembah kami, tetapi menyembah hawa nafsu mereka, dan sesuatu yang dianggap baik menurut ajakan dan bujukan setan.\" Allah berfirman:\n\nDan mereka telah memilih tuhan-tuhan selain Allah, agar tuhan-tuhan itu menjadi pelindung bagi mereka. Sama sekali tidak! Kelak mereka (se-sembahan) itu akan mengingkari penyembahan mereka terhadapnya, dan akan menjadi musuh bagi mereka. (Maryam/19: 81-82)\n\nAyat 14 ini ditutup dengan ketegasan bahwa pemberitaan mengenai tuhan-tuhan yang menjadi sembahan kaum musyrikin adalah benar dan tidak mungkin keliru, karena informasi itu berasal dari Allah, Tuhan Maha Mengetahui segala sesuatu dengan pasti. Tidak ada yang tersembunyi bagi-Nya, baik di bumi maupun di langit. Firman Allah:\n\nBagi Allah tidak ada sesuatu pun yang tersembunyi di bumi dan di langit. (ali 'Imran/3: 5",
          "15": "Pada ayat ini diterangkan bahwa manusia sangat berkepentingan kepada Penciptanya yaitu Allah karena semua manusia membutuhkan pertolongan-Nya dalam seluruh aspek kehidupan, seperti kekuatan, rezeki, menolak bahaya, mendapat kenikmatan, ilmu dan sebagainya, baik urusan dunia maupun akhirat. Semua itu tidak akan terjadi kecuali dengan rahmat dan taufik Allah. \n\nHanya Allah yang wajib disembah dan diharapkan rida-Nya. Ia Mahakaya, tidak memerlukan sesuatu. Maha Terpuji atas nikmat yang telah dianugerahkan kepada para hamba-Nya. Setiap nikmat yang dimiliki oleh manusia berasal dari sisi-Nya. Dialah yang seharusnya dipuji dan disyukuri dalam segala hal. Di ayat lain Allah menegaskan:\n\nMilik-Nyalah apa yang ada di langit dan apa yang ada di bumi. Dan Allah benar-benar Mahakaya, Maha Terpuji. (al-hajj/22: 64)",
          "16": "Ayat-ayat ini menjelaskan bahwa Allah tidak memerlukan suatu apa pun, dan Dia mempunyai kekuasaan yang sempurna. Jika Allah mau menghancurkan makhluk-Nya, maka dengan sekejap saja hancur binasalah semuanya, karena sekalipun Dia yang menciptakan, tetapi Dia tidak mempunyai keperluan sedikit pun padanya. Dia lalu menggantinya dengan makhluk lain yang akan patuh dan taat kepada perintah-Nya, menyerukan yang baik dan mencegah yang keji dan mungkar. Yang demikian itu tidak sulit bagi Allah untuk melaksanakannya, tetapi mudah sekali. Firman Allah:\n\nDan apakah mereka tidak memperhatikan bagaimana Allah memulai penciptaan (makhluk), kemudian Dia mengulanginya (kembali). Sungguh, yang demikian itu mudah bagi Allah. (al-'Ankabut/29: 19)",
          "17": "Ayat-ayat ini menjelaskan bahwa Allah tidak memerlukan suatu apa pun, dan Dia mempunyai kekuasaan yang sempurna. Jika Allah mau menghancurkan makhluk-Nya, maka dengan sekejap saja hancur binasalah semuanya, karena sekalipun Dia yang menciptakan, tetapi Dia tidak mempunyai keperluan sedikit pun padanya. Dia lalu menggantinya dengan makhluk lain yang akan patuh dan taat kepada perintah-Nya, menyerukan yang baik dan mencegah yang keji dan mungkar. Yang demikian itu tidak sulit bagi Allah untuk melaksanakannya, tetapi mudah sekali. Firman Allah:\n\nDan apakah mereka tidak memperhatikan bagaimana Allah memulai penciptaan (makhluk), kemudian Dia mengulanginya (kembali). Sungguh, yang demikian itu mudah bagi Allah. (al-'Ankabut/29: 19)",
          "18": "Pada ayat ini, Allah menerangkan kedahsyatan hari Kiamat. Pada hari itu setiap orang memikul dosanya masing-masing. Seseorang yang berdosa tidak akan memikul dosa orang lain. Jika ada yang merasa dosanya berat sekali, lalu meminta bantuan kepada orang lain untuk memikul sebagian dosanya, maka dosa itu tidak akan dipukulkan kepada yang diminta, sekalipun itu kaum kerabatnya, seperti ayah, anak, dan lain sebagainya. Setiap orang di hari Kiamat itu sibuk dengan urusannya masing-masing memikirkan dan merenungkan apa gerangan yang akan menimpa dirinya. Firman Allah:\n\nWahai manusia! Bertakwalah kepada Tuhanmu dan takutlah pada hari yang (ketika itu) seorang bapak tidak dapat menolong anaknya, dan seorang anak tidak dapat (pula) menolong bapaknya sedikit pun. Sungguh, janji Allah pasti benar, maka janganlah sekali-kali kamu teperdaya oleh kehidupan dunia, dan jangan sampai kamu teperdaya oleh penipu dalam (menaati) Allah. (Luqman/31: 33)\n\nAyat lain menjelaskan:\n\nPada hari itu manusia lari dari saudaranya, dan dari ibu dan bapaknya, dan dari istri dan anak-anaknya. Setiap orang dari mereka pada hari itu mempunyai urusan yang menyibukkannya. ('Abasa/80: 34-37)\n\nDalam tafsir al-Qurthubi diriwayatkan dari 'Ikrimah bahwa seorang bapak menggantungkan harapan kepada anaknya di hari kiamat dan berkata, \"Wahai anakku! Bagaimana aku sebagai bapakmu,\" lalu anak itu memujinya dengan pujian yang baik. Bapak itu berkata lagi kepada anaknya, \"Wahai anakku! Aku benar-benar memerlukan dari amal baikmu sekalipun hanya seberat zarrah, supaya aku selamat dari keadaanku sebagaimana yang engkau lihat.\" Anaknya menjawab, \"Wahai bapakku! Alangkah sedikitnya yang engkau minta, tetapi aku sendiri khawatir terhadap diriku sebagaimana bapak khawatir terhadap diri sendiri. Oleh karena itu, saya tidak dapat memberikan apa-apa barang sedikit pun.\" Kemudian ia beralih kepada istrinya yang menggantungkan harapannya dan berkata, \"Wahai Fulanah! Bagaimanakah aku sebagai suamimu?\" Lalu dipuji-pujinya suaminya itu dengan pujian yang baik. Berkatalah suami itu kepada istrinya, \"Aku meminta kepadamu satu saja dari amal baikmu, semoga dengan pemberianmu aku selamat dari keadaanku, sebagaimana yang kamu saksikan ini.\" Istrinya menjawab, \"Alangkah sedikitnya yang engkau minta, namun aku tidak bisa memberikannya karena aku khawatir juga seperti apa yang engkau khawatirkan.\" \n\nKandungan ayat ini sebagai penghibur hati Rasulullah karena dakwahnya yang tidak mendapat sambutan baik dari kaumnya dan mereka tetap keras kepala. Allah menjelaskan bahwa yang dapat menerima nasihat dan peringatan-Nya hanyalah orang-orang yang takut kepada Allah dan azab-Nya yang pedih di hari kemudian, sekalipun mereka tidak melihatnya. Tidak seperti halnya orang-orang yang telah dipatri hatinya oleh Allah sehingga mereka tidak tahu apa-apa. Mereka mengerjakan salat yang diwajibkan sesuai dengan rukun dan syaratnya, mensucikan hati mereka, dan mendekatkan diri kepada Allah. Barang siapa menyucikan dirinya dari syirik, perbuatan dosa, dan kedurhakaan, seperti ria, ujub, dusta, dan menipu, kebaikannya akan kembali kepada dirinya sendiri. Begitu pula sebaliknya, kalau ia berbuat maksiat bergelimang dosa, maka mudaratnya itu kembali kepada dirinya. \n\nAyat ini ditutup dengan satu penjelasan bahwa semua urusan dikembalikan kepada Allah. Tiap-tiap orang akan dibalas sesuai dengan amal perbuatannya di dunia. Kalau baik akan dibalas dengan baik, begitu pula sebaliknya, kalau amalnya jahat akan dibalas dengan balasan yang setimpal. Firman Allah:\n\nHanya kepada Allah segala urusan dikembalikan. (al-Anfal/8: 44)",
          "19": "Pada ayat ini, Allah menerangkan bahwa orang-orang yang tidak mengetahui atau mengingkari agama yang dibawa oleh Nabi Muhammad tidak sama dengan orang-orang yang membuka matanya lebar-lebar sehingga dapat melihat dan mengetahui dengan jelas kebenaran agama yang dibawanya, lalu mereka mengikuti dan menaatinya. Golongan pertama termasuk orang-orang yang jahat dan tidak mengetahui, sedang golongan kedua adalah orang-orang yang baik dan mengetahui.\n\nFirman Allah:\n\nKatakanlah (Muhammad), \"Tidaklah sama yang buruk dengan yang baik.\" (al-Ma'idah./5: 100) \n\nDan firman-Nya:\n\nKatakanlah, \"Apakah sama orang-orang yang mengetahui dengan orang-orang yang tidak mengetahui?\" (az-Zumar/39: 9)",
          "20": "Pada ayat ini, Allah menerangkan bahwa kekafiran tidak sama dengan iman, karena kekafiran adalah kegelapan, tidak mengetahui peraturan Allah. Orang kafir berjalan dalam kegelapan, tidak dapat keluar darinya, bahkan hanyut dalam kesesatan di dunia dan akhirat. Adapun cahaya iman menerangi orang Islam kepada jalan yang benar dan membawa kebahagiaan dunia dan akhirat. Sebagian mufasir mengartikan 'gelap gulita di sini dengan 'kebatilan, dan 'cahaya dengan 'kebenaran, kebatilan dan kebenaran tidak sama.",
          "21": "Selanjutnya, Allah menerangkan bahwa yang terlindung tidak sama dengan yang terkena panas. Sebagian ulama tafsir mengartikan dhill (teduh/naungan) di sini dengan surga, karena surga itu mempunyai naungan yang menyebabkan hawa sejuk. Sebagaimana firman Allah:\n\nPerumpamaan surga yang dijanjikan kepada orang yang bertakwa (ialah seperti taman), mengalir di bawahnya sungai-sungai; senantiasa berbuah dan teduh. (ar-Ra'd/13: 35) \n\nSedang harr (panas) diartikan dengan neraka, karena ia memang satu tempat yang amat panas dan penuh dengan api yang menyala-nyala, jauh lebih panas dari api yang dikenal di dunia. Sepercik bunga api neraka saja jatuh di dunia, maka dunia akan panas seluruhnya sebagaimana dijelaskan di dalam suatu hadis.\n\nSekiranya sepercik api dari bunga-bunga api neraka (berada) di timur, maka akan dirasakan panasnya (oleh orang-orang yang berada) di barat. (Riwayat ath-thabrani dari Anas bin Malik)",
          "22": "Pada awal ayat ini, Allah menerangkan bahwa orang-orang yang hatinya hidup karena beriman kepada Allah dan rasul-Nya, serta mengetahui Al-Qur'an dan isinya, tidak sama dengan orang yang mati hatinya akibat ditutupi kekafiran. Mereka yang terakhir ini tidak mau mengetahui perintah dan larangan Allah, tidak dapat membedakan antara petunjuk dan kesesatan. Ini adalah perumpamaan bagi orang-orang yang mukmin dan bagi orang-orang kafir. Firman Allah:\n\nDan apakah orang yang sudah mati lalu Kami hidupkan dan Kami beri dia cahaya yang membuatnya dapat berjalan di tengah-tengah orang banyak, sama dengan orang yang berada dalam kegelapan, sehingga dia tidak dapat keluar dari sana? (al-An'am/6: 122) \n\nDan firman-Nya:\n\nPerumpamaan kedua golongan (orang kafir dan mukmin), seperti orang buta dan tuli dengan orang yang dapat melihat dan dapat mendengar. Samakah kedua golongan itu? Maka tidakkah kamu mengambil pelajaran? (Hud/11: 24)\n\nOrang mukmin itu melihat, mendengar, dan bermandikan cahaya terang-benderang ketika melintasi shirathal mustaqim sampai ke surga yang sejuk, mempunyai naungan, dan mata air yang banyak. Sedangkan orang kafir buta dan tuli berjalan di dalam gelap gulita tidak dapat keluar daripadanya, bahkan selalu bersikap sombong di dalam kesesatannya di dunia dan akhirat sampai diberi keputusan masuk neraka yang sangat panas, penuh api menyala-nyala. Allah memberi petunjuk kepada orang-orang yang dikehendaki-Nya, mau mendengar hujjah atas kebenaran rasul, dan menerima agama yang dibawanya yaitu Islam dengan baik. Sebagaimana halnya orang yang telah mati dimasukkan dalam kubur, tidak dapat mendengar nasihat-nasihat dan saran-saran yang akan membimbingnya ke jalan yang benar, begitu pula orang yang mati hatinya. Tidak akan bermanfaat baginya peringatan-peringatan Allah. Mereka tidak dapat memahami isi Al-Qur'an dan ajaran-ajaran agama.",
          "23": "Pada ayat ini, Allah menjelaskan bahwa tugas Nabi Muhammad hanyalah memberi peringatan kepada manusia yang belum mendapat petunjuk. Ia tidak dibebani perintah untuk memaksa mereka menerima petunjuk dan agama yang dibawanya, karena petunjuk itu adalah sepenuhnya berada di tangan Allah. Oleh karena itu, tidak pada tempatnya Nabi Muhammad bersedih hati dan merasa kecewa kalau mereka itu belum mau menyambut baik seruannya. Tugas ini ditegaskan oleh Nabi Muhammad sebagaimana firman Allah:\n\nKatakanlah (Muhammad), \"Sesungguhnya aku hanya seorang pemberi peringatan,\" (shad/38: 65) \n\nDan firman-Nya:\n\nYang diwahyukan kepadaku, bahwa aku hanyalah seorang pemberi peringatan yang nyata.\" (shad/38: 70)",
          "24": "Ayat ini menerangkan bahwa Nabi Muhammad diutus kepada manusia agar mereka beriman kepada Allah Yang Maha Esa disertai dengan syariat yang diwajibkan kepada hamba-Nya. Nabi saw juga diperintahkan untuk memberi kabar gembira kepada orang yang membenarkan risalahnya dan menerima baik agama yang dibawanya dari Allah, bahwa mereka akan dimasukkan ke dalam surga yang penuh dengan kenikmatan dan kesenangan. Juga memberi peringatan kepada orang yang mendustakannya dan menolak wahyu yang diturunkan dari Allah bahwa mereka akan dimasukkan ke dalam neraka yang penuh dengan azab dan siksa yang amat pedih. Pada ayat yang lain Allah menegaskan sebagai berikut:\n\nDan Kami mengutus engkau (Muhammad), hanya sebagai pembawa berita gembira dan pemberi peringatan. (al-Isra'/17: 105)\n\nTidak ada suatu umat pun sejak Nabi Adam kecuali Allah mengutus kepada mereka seorang utusan yang memberi peringatan. Dengan demikian, umat itu tidak mempunyai alasan lagi untuk membantah Allah sesudah diutus-Nya para rasul itu. Firman Allah:\n\nRasul-rasul itu adalah sebagai pembawa berita gembira dan pemberi peringatan, agar tidak ada alasan bagi manusia untuk membantah Allah setelah rasul-rasul itu diutus. (an-Nisa'/4: 165) \n\nDan firman-Nya:\n\nKami tidak akan menyiksa sebelum Kami mengutus seorang rasul. (al-Isra'/17: 15)\n\nPada ayat lain ditegaskan juga sebagai berikut:\n\nDan jika mereka (orang-orang musyrik) mendustakan engkau (Muhammad), begitu pulalah kaum-kaum yang sebelum mereka, kaum Nuh, 'Ad, dan Samud (juga telah mendustakan rasul-rasul-Nya), dan (demikian juga) kaum Ibrahim dan kaum Lut, dan penduduk Madyan. Dan Musa (juga) telah didustakan, namun Aku beri tenggang waktu kepada orang-orang kafir, kemudian Aku siksa mereka, maka betapa hebatnya siksaan-Ku. (al-hajj/22: 42-44)",
          "25": "Pada ayat ini, Allah menerangkan bahwa setelah mereka mengingkari kedatangan rasul dan mendustakan agama yang dibawanya, Dia mengazab orang-orang kafir itu dengan azab yang pedih. Alangkah hebatnya kemurkaan Allah kepada mereka apabila mereka tetap dalam keadaan membangkang, serta tetap mengingkari kerasulan Muhammad saw dan agama yang dibawanya. Mereka akan mengalami seperti apa yang telah dialami umat dahulu. Demikian sunatullah tetap berlaku dan tidak akan berubah. Sebagaimana firman Allah:\n\nSebagai sunnah Allah yang (berlaku juga) bagi orang-orang yang telah terdahulu sebelum(mu), dan engkau tidak akan mendapati perubahan pada sunah Allah. (al-Ahzab/33: 62)",
          "26": "Pada ayat ini, Allah menerangkan bahwa setelah mereka mengingkari kedatangan rasul dan mendustakan agama yang dibawanya, Dia mengazab orang-orang kafir itu dengan azab yang pedih. Alangkah hebatnya kemurkaan Allah kepada mereka apabila mereka tetap dalam keadaan membangkang, serta tetap mengingkari kerasulan Muhammad saw dan agama yang dibawanya. Mereka akan mengalami seperti apa yang telah dialami umat dahulu. Demikian sunatullah tetap berlaku dan tidak akan berubah. Sebagaimana firman Allah:\n\nSebagai sunnah Allah yang (berlaku juga) bagi orang-orang yang telah terdahulu sebelum(mu), dan engkau tidak akan mendapati perubahan pada sunah Allah. (al-Ahzab/33: 62)",
          "27": "Pada ayat ini, Allah menguraikan beberapa hal yang menunjukkan kesempurnaan dan kekuasaan-Nya, yang dapat dilihat manusia setiap waktu. Jika mereka menyadari dan menginsyafi semuanya itu, tentu mereka akan menyadari pula keesaan dan kekuasaan Allah Yang Maha Sempurna itu. Di antara tanda-tanda itu adalah Allah menjadikan sesuatu yang beraneka ragam macamnya yang bersumber dari yang satu. Allah menurunkan hujan dari langit, sehingga tanaman bisa tumbuh dan mengeluarkan buah-buahan yang beraneka ragam warna, rasa, bentuk, dan aromanya, sebagaimana yang kita saksikan. Buah-buahan itu warnanya ada yang kuning, merah, hijau, dan sebagainya. Hal yang sama dijelaskan pula di dalam ayat yang lain. Firman Allah:\n\nDan di bumi terdapat bagian-bagian yang berdampingan, kebun-kebun anggur, tanaman-tanaman, pohon kurma yang bercabang, dan yang tidak bercabang; disirami dengan air yang sama, tetapi Kami lebihkan tanaman yang satu dari yang lainnya dalam hal rasanya. Sungguh, pada yang demikian itu terdapat tanda-tanda (kebesaran Allah) bagi orang-orang yang mengerti. (ar-Ra'd/13: 4)\n\nAllah juga menciptakan gunung-gunung yang kelihatan seperti garis-garis, ada yang kelihatan putih, merah, dan hitam pekat. Di antara gunung-gunung itu terbentang pula jalan-jalan yang beraneka ragam pula warnanya.\n\nMenurut para saintis, garis-garis berwarna pada batuan paling umum dijumpai pada jenis batuan sedimen. Batuan sedimen terbentuk dari hasil pengendapan bahan yang terangkut oleh aliran air atau angin. Bahan yang diendapkan adalah butiran-butiran halus berupa pasir, debu, atau lempung sebagai hasil pelapukan batuan di tempat lain, yang kemudian terlepas dari batuan induknya dan terangkut oleh aliran air atau tiupan angin. Tempat pengendapan bahan sedimen ini umumnya terletak pada bagian-bagian yang rendah di mana kecepatan tenaga pengangkut (arus air, hembusan angin) berkurang. Daerah-daerah yang umum dikenal sebagai tempat pengendapan adalah dataran, pesisir terutama daerah delta, dan dasar laut. \n\nPada proses pengangkutan (transportasi) dan pengendapan (sedimentasi) terjadi pula mekanisme pemilahan (sorting) di mana pada umumnya bahan dengan karakteristik fisik yang sama (misalnya dalam hal ukuran butir atau berat jenis) akan diendapkan pada lingkungan pengendapan yang sama. \n\nProses pelapukan, pengangkutan, dan pengendapan ini berjalan terus- menerus sepanjang sejarah bumi yang dapat memakan waktu ribuan bahkan jutaan tahun. \n\nSelama proses ini berjalan terdapat pula perubahan-perubahan baik dalam hal lingkungan pengendapan maupun jenis bahan yang diendapkan, sehingga pada batuan sedimen terbentuk lapisan-lapisan yang juga melukiskan urutan sejarah (waktu) pengendapan. Mekanisme geologi lain yang biasa terjadi pada batuan sedimen adalah mengalami pengangkatan oleh adanya gaya tektonik sehingga batuan sedimen yang biasanya terbentuk di tempat-tempat yang rendah bisa dijumpai di puncak-puncak gunung. Pada puncak-puncak gunung yang tertoreh, baik oleh pengikisan maupun oleh terjadinya rekahan, lapisan-lapisan sedimen ini akan tampak ke permukaan.\n\nSetiap lapisan pada batuan sedimen dapat memiliki warna yang berbeda karena tersusun dari material yang berbeda. Perbedaan warna ini terutama dicirikan oleh perbedaan susunan mineralogisnya. Misal: mineral-mineral yang mengandung senyawa besi oksida (hematit) berwarna merah, mineral yang berwarna putih antara lain alumino-silika (kaoline), mineral-mineral logam hidroksida (goethite, brucite, diaspore, boehmite) dapat memberikan berbagai warna (kuning, hijau, abu-abu, hitam, merah muda), yang berwarna bening antara lain silika (kuarsa). Batuan atau mineral keras yang berwarna-warni biasa digosok menjadi batu perhiasan.",
          "28": "Pada ayat ini, Allah menambah penjelasan lagi tentang hal-hal yang menunjukkan kesempurnaan dan kekuasaan-Nya. Allah menciptakan binatang melata dan binatang ternak, yang bermacam-macam warnanya sekalipun berasal dari jenis yang satu. Bahkan ada binatang yang satu, tetapi memiliki warna yang bermacam-macam. Mahasuci Allah pencipta alam semesta dengan sebaik-baiknya. Sejalan dengan ini firman Allah:\n\nDan di antara tanda-tanda (kebesaran)-Nya ialah penciptaan langit dan bumi, perbedaan bahasamu dan warna kulitmu. (ar-Rum/30: 22)\n\nDemikianlah Allah menunjukkan tanda-tanda kekuasaan-Nya seperti tersebut di atas untuk dapat diketahui secara mendalam. Hanya ulama yang benar-benar menyadari dan mengetahui tanda-tanda kekuasaan Allah, sehingga mereka benar-benar tunduk kepada kekuasaan-Nya dan takut kepada siksa-Nya.\n\nIbnu 'Abbas berkata, \"Yang dinamakan ulama ialah orang-orang yang mengetahui bahwa Allah itu Mahakuasa atas segala sesuatu.\" Di dalam riwayat lain, Ibnu 'Abbas berkata, \"Ulama itu ialah orang yang tidak mempersekutukan Tuhan dengan sesuatu apa pun, yang menghalalkan yang telah dihalalkan Allah dan mengharamkan yang telah diharamkan-Nya, menjaga perintah-perintah-Nya, dan yakin bahwa dia akan bertemu dengan-Nya yang akan menghisab dan membalas semua amalan manusia.\"\n\nAyat ini ditutup dengan suatu penegasan bahwa Allah Mahaperkasa menindak orang-orang yang kafir kepada-Nya. Dia tidak mengazab orang-orang yang beriman dan taat kepada-Nya, tetapi Maha Pengampun kepada mereka. Dia kuasa mengazab orang-orang yang selalu berbuat maksiat dan bergelimang dosa, sebagaimana Dia kuasa memberi pahala kepada orang-orang yang taat kepada-Nya dan mengampuni dosa-dosa mereka, maka sepatutnya manusia itu takut kepada-Nya.",
          "29": "Pada ayat ini, Allah menerangkan bahwa orang-orang yang selalu membaca Al-Qur'an, meyakini berita, mempelajari kata dan maknanya lalu diamalkan, mengikuti perintah, menjauhi larangan, mengerjakan salat pada waktunya sesuai dengan cara yang telah ditetapkan dan dengan penuh ikhlas dan khusyuk, menafkahkan harta bendanya tanpa berlebih-lebihan dengan ikhlas tanpa ria, baik secara diam-diam atau terang-terangan, mereka adalah orang yang mengamalkan ilmunya dan berbuat baik dengan Tuhan mereka. Mereka itu ibarat pedagang yang tidak merugi, tetapi memperoleh pahala yang berlipat ganda sebagai karunia Allah, berdasarkan amal baktinya. Firman Allah:\n\nAdapun orang-orang yang beriman dan mengerjakan kebajikan, Allah akan menyempurnakan pahala bagi mereka dan menambah sebagian dari karunia-Nya. (an-Nisa'/4: 173) \n\nSelain dari itu, mereka juga akan memperoleh ampunan atas kesalahan dan kejahatan yang telah dilakukan, karena Allah Maha Pengampun lagi Maha Mensyukuri hamba-hamba-Nya, memberikan pahala yang sempurna terhadap amal-amal mereka, memaafkan kesalahannya dan menambah nikmat-Nya. Sejalan dengan ini firman Allah:\n\nSungguh, Allah Maha Pengampun, Maha Mensyukuri. (asy-Syura/42: 23)",
          "30": "Pada ayat ini, Allah menerangkan bahwa orang-orang yang selalu membaca Al-Qur'an, meyakini berita, mempelajari kata dan maknanya lalu diamalkan, mengikuti perintah, menjauhi larangan, mengerjakan salat pada waktunya sesuai dengan cara yang telah ditetapkan dan dengan penuh ikhlas dan khusyuk, menafkahkan harta bendanya tanpa berlebih-lebihan dengan ikhlas tanpa ria, baik secara diam-diam atau terang-terangan, mereka adalah orang yang mengamalkan ilmunya dan berbuat baik dengan Tuhan mereka. Mereka itu ibarat pedagang yang tidak merugi, tetapi memperoleh pahala yang berlipat ganda sebagai karunia Allah, berdasarkan amal baktinya. Firman Allah:\n\nAdapun orang-orang yang beriman dan mengerjakan kebajikan, Allah akan menyempurnakan pahala bagi mereka dan menambah sebagian dari karunia-Nya. (an-Nisa'/4: 173) \n\nSelain dari itu, mereka juga akan memperoleh ampunan atas kesalahan dan kejahatan yang telah dilakukan, karena Allah Maha Pengampun lagi Maha Mensyukuri hamba-hamba-Nya, memberikan pahala yang sempurna terhadap amal-amal mereka, memaafkan kesalahannya dan menambah nikmat-Nya. Sejalan dengan ini firman Allah:\n\nSungguh, Allah Maha Pengampun, Maha Mensyukuri. (asy-Syura/42: 23)",
          "31": "Sesungguhnya Al-Qur'an yang diturunkan kepada Nabi Muhammad adalah Kitabullah yang benar-benar diturunkan dari Allah. Oleh karena itu, Allah mewajibkan kepada Nabi dan kepada segenap umatnya untuk mengamalkan ajarannya dan mengikuti pedoman-pedoman hidup yang terdapat di dalamnya. Bila seorang muslim telah mematuhi secara sempurna ajaran Al-Qur'an itu, maka ia tidak perlu lagi mengamalkan kitab-kitab suci sebelumnya, sekalipun diwajibkan untuk mengimaninya. Sebab apa yang pernah diterangkan dalam kitab-kitab sebelumnya, telah dibenarkan oleh Al-Qur'an. Dengan kata lain, beriman dengan kitab-kitab suci yang pernah diturunkan kepada para rasul sebelum Nabi Muhammad bukan berarti mengamalkan ajarannya, tetapi cukup mengimani kebenarannya, sebab intisari dari apa yang tercantum dalam kitab-kitab itu telah tertera pula dalam Al-Qur'an. Allah Maha Mengetahui perihal hamba-Nya. Allah Mahateliti akan aturan-aturan hidup yang perlu bagi mereka. Atas dasar itulah Dia menetapkan aturan dan hukum-hukum yang sesuai dengan kehidupan mereka, di mana dan kapan mereka berada. Guna kesejahteraan manusia seutuhnya, Allah mengutus para rasul dengan tugas menyampaikan syariat-Nya, di mana Nabi Muhammad adalah rasul terakhir yang diutus untuk sekalian manusia sampai hari Kiamat. Risalah dan syariat yang dibawanya kekal dan abadi sampai tibanya hari Kiamat.\n\nFirman Allah:\n\nAllah lebih mengetahui di mana Dia menempatkan tugas kerasulan-Nya. (al-An'am/6: 124) \n\nImam Ibnu Katsir menjelaskan bahwa maksud pengetahuan Allah yang Mahaluas mengenai perihal hamba-Nya itu ialah Dia mengangkat derajat para nabi dan rasul melebihi manusia keseluruhannya. Bahkan di antara mereka (para nabi) itu sendiri berbeda-beda tingkat ketinggiannya, dan kedudukan Nabi Muhammad melebihi semua mereka.",
          "32": "Allah mewahyukan Al-Qur'an kepada Nabi Muhammad. Kemudian ajaran-ajaran Al-Qur'an itu diwariskan-Nya kepada hamba-hamba-Nya yang terpilih. Mereka itu adalah umat Nabi Muhammad, sebab Allah telah memuliakan umat ini melebihi kemuliaan yang diperoleh umat sebelumnya. Kemuliaan itu tergantung kepada sejauh manakah ajaran Rasulullah itu mereka amalkan, dan sampai di mana mereka sanggup mengikuti petunjuk Allah. Berikut ini dijelaskan tingkatan-tingkatan orang mukmin yang mengamalkan Al-Qur'an:\n\n1.Orang yang zalim kepada dirinya. Maksudnya orang yang mengerjakan perbuatan wajib dan juga tidak meninggalkan perbuatan yang haram.\n\n2.Muqtashid, yakni orang-orang yang melaksanakan segala kewajiban dan meninggalkan larangan-larangannya, tetapi kadang-kadang ia tidak mengerjakan perbuatan yang dipandang sunah atau masih mengerjakan sebagian pekerjaan yang dipandang makruh.\n\n3.Sabiqun bil khairat, yaitu orang yang selalu mengerjakan amalan yang wajib dan sunah, meninggalkan segala perbuatan yang haram dan makruh, serta sebagian hal-hal yang mubah (dibolehkan).\n\nMenurut al-Maragi pembagian di atas dapat pula diungkapkan dengan kata-kata lain, yaitu:\n\n1.Orang yang masih sedikit mengamalkan ajaran Kitabullah dan terlalu senang menuruti hawa nafsunya, atau orang yang masih banyak perbuatan kejahatannya dibanding dengan amal kebaikannya.\n\n2.Orang yang seimbang antara amal kebaikan dan kejahatannya.\n\n3.Orang yang terus-menerus mencari ganjaran Allah dengan melakukan amal kebaikan.\n\nPara ulama tafsir telah menyebutkan beberapa hadis sehubungan dengan maksud di atas. Salah satunya adalah hadis riwayat Ahmad dari Abu Darda', di mana setelah membaca ayat 32 Surah Fathir di atas, Rasulullah bersabda: \n\nAdapun orang yang berlomba dalam berbuat kebaikan mereka akan masuk surga tanpa hisab (perhitungan), sedang orang-orang pertengahan (muqtashid) mereka akan dihisab dengan hisab yang ringan, dan orang yang menganiaya dirinya sendiri mereka akan ditahan dulu di tempat (berhisabnya), sehingga ia mengalami penderitaan kemudian dimasukkan ke dalam surga. Kemudian beliau membaca \"Alhamdulillah al-ladzi adhhaba 'anna al-hazana inna rabbana lagafurun syakur,\" (Segala puji bagi Allah yang telah menghilangkan duka cita dari kami, sesungguhnya Tuhan kami Maha Pengampun lagi Maha Mensyukuri). (Riwayat Ahmad) \n\nWarisan mengamalkan kitab suci dan kemuliaan yang diberikan kepada umat Nabi Muhammad itu merupakan suatu karunia yang amat besar dari Allah, yang tidak seorang pun dapat menghalangi ketetapan itu.",
          "33": "Kemudian Allah menerangkan pahala yang akan diterima orang mukmin di atas yakni surga 'Adn, tempat tinggal abadi buat selama-lamanya, yang akan mereka diami kelak di akhirat ketika mereka telah menghadap Allah. Mereka dianugerahi perhiasan dari emas dan pakaian dari sutra. Diriwayatkan dari Abu Hurairah bahwa Rasulullah bersabda:\n\nSebagian dari orang mukmin itu akan memperoleh perhiasan (di surga) diletakkan pada anggota badan yang terbasuh (air) wudhu. (Riwayat al-Bukhari) \n\nDalam hadis lain, Rasulullah bersabda:\n\nDari Abu Hurairah r.a. bahwa Abu Umamah meriwayatkan hadis bahwa Rasulullah mengatakan kepada para sahabat, dan menyebutkan perhiasan penghuni surga. Beliau berkata, \"Mereka diberi gelang emas dan perak yang bertatahkan mutiara, mereka juga memakai mahkota dari mutiara yaqut yang bersambung. Mereka memakai mahkota seperti mahkota raja-raja. Mereka muda-muda, tidak berjenggot dan berkumis, dan mata mereka bercelak. (Riwayat Ibnu Abi hatim)\n\nAtas anugerah Allah yang berlipat ganda itu, mereka memuji kebesaran-Nya dan bersyukur atas keselamatan mereka dari kesedihan dan kepedihan. Ibnu 'Abbas mengartikan kesedihan (hazan) itu dengan api neraka, karena kepedihan akibat dosa atau kepedihan akibat hebatnya siksaan di Padang Mahsyar. Lepasnya mereka dari segala siksaan dan ketakutan adalah semata-mata karena ampunan Allah bagi orang yang berbuat kesalahan (dosa) dan balasan syukur bagi orang yang selalu menaati-Nya. Diriwayatkan dalam sebuah hadis dari Ibnu 'Umar dimana Nabi saw bersabda:\n\nOrang (yang selalu mengucapkan)\"La ilaha illallah\" tidak akan merasa kesepian di dalam kematiannya, di dalam kuburnya, dan juga pada hari Kebangkitan. Seolah-olah aku berada dengan mereka di mana mereka membersihkan kepalanya dari tanah/debu, dan mereka berkata, \"Segala puji bagi Allah yang telah melenyapkan kedukaan dari kami! Sesungguhnya Tuhan kami Maha Pengampun lagi Maha Penerima syukur.\" (Riwayat ath-thabrani dari Ibnu 'Umar)\n\nRingkasnya, mereka terlepas dari segala ketakutan dan siksaan yang telah diancamkan pada orang-orang yang berdosa akibat bisikan dan rayuan setan ketika hidup di dunia ini.",
          "34": "Kemudian Allah menerangkan pahala yang akan diterima orang mukmin di atas yakni surga 'Adn, tempat tinggal abadi buat selama-lamanya, yang akan mereka diami kelak di akhirat ketika mereka telah menghadap Allah. Mereka dianugerahi perhiasan dari emas dan pakaian dari sutra. Diriwayatkan dari Abu Hurairah bahwa Rasulullah bersabda:\n\nSebagian dari orang mukmin itu akan memperoleh perhiasan (di surga) diletakkan pada anggota badan yang terbasuh (air) wudhu. (Riwayat al-Bukhari) \n\nDalam hadis lain, Rasulullah bersabda:\n\nDari Abu Hurairah r.a. bahwa Abu Umamah meriwayatkan hadis bahwa Rasulullah mengatakan kepada para sahabat, dan menyebutkan perhiasan penghuni surga. Beliau berkata, \"Mereka diberi gelang emas dan perak yang bertatahkan mutiara, mereka juga memakai mahkota dari mutiara yaqut yang bersambung. Mereka memakai mahkota seperti mahkota raja-raja. Mereka muda-muda, tidak berjenggot dan berkumis, dan mata mereka bercelak. (Riwayat Ibnu Abi hatim)\n\nAtas anugerah Allah yang berlipat ganda itu, mereka memuji kebesaran-Nya dan bersyukur atas keselamatan mereka dari kesedihan dan kepedihan. Ibnu 'Abbas mengartikan kesedihan (hazan) itu dengan api neraka, karena kepedihan akibat dosa atau kepedihan akibat hebatnya siksaan di Padang Mahsyar. Lepasnya mereka dari segala siksaan dan ketakutan adalah semata-mata karena ampunan Allah bagi orang yang berbuat kesalahan (dosa) dan balasan syukur bagi orang yang selalu menaati-Nya. Diriwayatkan dalam sebuah hadis dari Ibnu 'Umar dimana Nabi saw bersabda:\n\nOrang (yang selalu mengucapkan)\"La ilaha illallah\" tidak akan merasa kesepian di dalam kematiannya, di dalam kuburnya, dan juga pada hari Kebangkitan. Seolah-olah aku berada dengan mereka di mana mereka membersihkan kepalanya dari tanah/debu, dan mereka berkata, \"Segala puji bagi Allah yang telah melenyapkan kedukaan dari kami! Sesungguhnya Tuhan kami Maha Pengampun lagi Maha Penerima syukur.\" (Riwayat ath-thabrani dari Ibnu 'Umar)\n\nRingkasnya, mereka terlepas dari segala ketakutan dan siksaan yang telah diancamkan pada orang-orang yang berdosa akibat bisikan dan rayuan setan ketika hidup di dunia ini.",
          "35": "Orang yang telah memperoleh nikmat dari Allah itu menyadari bahwa semua pemberian tersebut adalah semata-mata karena kasih sayang-Nya. Tidaklah seimbang besarnya pemberian Allah itu dengan perbuatan baik yang mereka kerjakan. Oleh karena itu, masuknya orang-orang mukmin ke dalam surga sama sekali bukanlah karena kebaikan yang mereka kerjakan, tetapi karena rahmat dan karunia Allah bagi orang yang mematuhi perintah-Nya.\n\nRasulullah saw bersabda:\n\nTiada masuk surga seorang di antara kamu karena perbuatannya. Mereka (para sahabat) bertanya, \"Apakah engkau juga tidak begitu wahai Rasulullah?\" Beliau menjawab, \"Aku juga tidak, melainkan karena Allah memberi rahmat dan karunia kepadaku.\" (Riwayat Muslim dari Jabir bin 'Abdullah) \n\nDi surga itu mereka tidak menemui kesulitan atau rintangan lagi sebagaimana yang mereka rasakan dalam kehidupan di dunia ini. Mereka juga tidak merasa lelah dan letih. Semuanya terasa nikmat dan menggembirakan.\n\nRingkasnya surga itulah tempat nikmat yang kekal dan abadi, di mana penghuninya dapat menikmati kesenangan itu sebagai ganjaran kepatuhan dan ketaatan mereka di dunia ini. Allah berfirman:\n\n(Kepada mereka dikatakan), \"Makan dan minumlah dengan nikmat karena amal yang telah kamu kerjakan pada hari-hari yang telah lalu.\" (al-haqqah/69: 24)",
          "36": "Dalam ayat ini dijelaskan bahwa bagi orang-orang kafir yang senantiasa menyembunyikan kebenaran agama yang buktinya telah diperoleh oleh akal mereka, baik dari keterangan ayat-ayat Al-Qur'an maupun melalui hasil pemikiran yang mendalam, bagi mereka disediakan neraka Jahanam. Keadaan mereka di sana antara hidup dan mati. Mungkin kematian lebih baik daripada menanggung kesengsaraan seperti itu, tetapi Allah sengaja menetapkan siksaan demikian sebagai balasan kejahatan yang mereka lakukan. Dalam Surah al-A'la/87: 13 ditegaskan bahwa keadaan mereka tidak mati dan tidak hidup, sebagai tafsir dari kata \"tidak ditetapkan kematian atas mereka\". \n\nDi samping itu dijelaskan bahwa azab neraka Jahanam tidak pula dikurangi kepedihannya, sekalipun manusia-manusia malang yang sedang mengalami siksaan di sana menjerit-jerit meminta tolong. Ada keterangan dari ayat lain yang menggambarkan bahwa kematian sangat mereka harapkan daripada keadaan mereka antara hidup dan mati, harapan kematian itu disimpulkan dari makna yang terkandung dalam ayat:\n\nDan mereka berseru, \"Wahai (Malaikat) Malik! Biarlah Tuhanmu mematikan kami saja.\" Dia menjawab, \"Sungguh, kamu akan tetap tinggal (di neraka ini).\" (az-Zukhruf/43: 77)\n\nImam Muslim meriwayatkan sebuah hadis tentang keadaan orang-orang kafir yang berbunyi sebagai berikut:\n\nAdapun penghuni neraka di mana mereka sebagai penduduknya, mereka tidak akan mati di dalamnya dan juga tidak hidup. (Riwayat Muslim dari Abu Sa'id al-Khudri)\n\nTentang siksaan yang tidak diringankan itu, bahkan makin ditambah lagi, juga diperoleh penjelasan dalam ayat lain, misalnya:\n\nSehingga apabila Kami bukakan untuk mereka pintu azab yang sangat keras, seketika itu mereka menjadi putus asa. (al-Mu'minun/23: 77) \n\nDan firman-Nya:\n\nMaka karena itu rasakanlah! Maka tidak ada yang akan Kami tambahkan kepadamu selain azab. (an-Naba'/78: 30) \n\nDan Kami akan mengumpulkan mereka pada hari Kiamat dengan wajah tersungkur, dalam keadaan buta, bisu, dan tuli. Tempat kediaman mereka adalah neraka Jahanam. Setiap kali nyala api Jahanam itu akan padam, Kami tambah lagi nyalanya bagi mereka. (al-Isra'/17: 97)\n\nSiksaan demikian itu balasan yang pantas bagi setiap orang yang mengingkari nikmat Allah, tidak mengakui kemahaesaan-Nya dan tidak percaya kepada rasul yang diutus-Nya.",
          "37": "Lebih lanjut diterangkan bahwa orang yang bernasib malang itu memohon kepada Allah agar dilepaskan dari azab dan dikembalikan ke dunia lagi. Mereka berjanji akan menaati Allah yang selama di dunia mereka lalaikan. Akan tetapi, seandainya permohonan itu dikabulkan”dan ini tidak mungkin sama sekali”tentulah mereka akan mengulangi kembali perbuatan lama yang terlarang. Perbuatan yang mereka sesali dan pernah mereka lakukan di dunia dulu adalah perbuatan syirik dan segala perbuatan jahat lainnya. Allah menjawab dan menghardik mereka dengan ucapan yang menghina bahwa di dunia dulu kepada mereka telah diberikan kesempatan hidup dengan umur yang cukup panjang untuk memperbaiki kesalahan dan menerima kebenaran yang disampaikan rasul selaku orang yang memberi peringatan. Dengan kata lain, permohonan demikian tidak diterima Allah sama sekali. Ayat lain menyatakan:\n\nYa Tuhan kami, keluarkanlah kami darinya (kembalikanlah kami ke dunia), jika kami masih juga kembali (kepada kekafiran), sungguh, kami adalah orang-orang yang zalim.\" Dia (Allah) berfirman, \"Tinggallah dengan hina di dalamnya, dan janganlah kamu berbicara dengan Aku.\" (al-Mu'minun/23: 107-108) \n\nAllah berfirman:\n\nDan barang siapa dibiarkan sesat oleh Allah, maka tidak ada baginya pelindung setelah itu. Kamu akan melihat orang-orang zalim ketika mereka melihat azab berkata, \"Adakah kiranya jalan untuk kembali (ke dunia)?\" (asy-Syura/42: 44)\n\nTentang umur yang dimaksudkan dalam ayat 37 ini, Ibnu 'Abbas menerangkan dalam satu riwayat, yaitu 40 tahun, dan riwayat lain mengatakan 60 tahun. Ibnu Katsir dalam tafsirnya memilih riwayat yang paling sahih dari Ibnu 'Abbas yakni 60 tahun. Demikian pula hadis riwayat Imam Ahmad dari Abu Hurairah. Di antara sekian banyak lafaz hadis itu, ada yang berarti: Adapun orang yang memberi peringatan yang disebutkan dalam ayat ini adalah Nabi Muhammad sendiri yang mengajarkan Kitabullah kepada umatnya, mengancam mereka dengan siksaan yang pedih bagi siapa yang tidak patuh kepada perintah Allah dan tidak mau menaati-Nya.\n\nRingkasnya, permohonan mereka itu tidak dikabulkan untuk kembali ke dunia ialah karena dua hal. Pertama, karena mereka rata-rata telah diberi kesempatan untuk hidup begitu lama antara 60 - 70 tahun, dan kedua, rasul sudah diutus kepada mereka untuk menyampaikan ajaran dan peringatan dari Tuhan.\n\nPerhatikan firman Allah:\n\nHampir meledak karena marah. Setiap kali ada sekumpulan (orang-orang kafir) dilemparkan ke dalamnya, penjaga-penjaga (neraka itu) bertanya kepada mereka, \"Apakah belum pernah ada orang yang datang memberi peringatan kepadamu (di dunia)?\" (al-Mulk/67: 8) \n\nDalam Tafsir al-Wadhih dikatakan bahwa nadzir (pemberi peringatan) dalam ayat ini berarti Rasulullah yang membawa Al-Qur'an, boleh pula diartikan sebagai umur tua dan kematian. Memang umur dan kematian tersebut adalah peringatan penting bagi manusia bahwa sebentar lagi dia akan meninggalkan dunia yang fana ini, dan diwajibkan mempertanggungjawabkan perbuatannya. Jelaslah bahwa orang-orang kafir di atas kekal di dalam neraka dan tidak dikeluarkan selama-lamanya. Azab nerakalah yang mereka rasakan sepanjang masa sebagai imbalan yang setimpal bagi orang yang zalim yang tidak mau tunduk kepada ajaran rasul sebagai utusan Allah dalam kehidupan duniawinya. Ayat ini menegaskan jangan diharap mereka akan memperoleh penolong yang akan menyelamatkan mereka dari azab neraka dari rantai dan belenggu yang terbuat dari api neraka.",
          "38": "Ayat ini memerintahkan kepada Nabi Muhammad agar memberi peringatan keras kepada orang-orang musyrik bahwa Allah Maha Mengetahui segala apa yang mereka sembunyikan. Allah juga Maha Mengetahui perasaan yang terkandung dalam hati mereka, dan rencana apa yang akan mereka kerjakan. Allah pulalah yang mengetahui segala yang tak terlihat oleh pancaindra manusia, baik yang ada di langit maupun di bumi. Oleh karena itu, hendaklah orang-orang musyrik itu merasa takut kepada Allah, sebab segala gerak-gerik mereka di bawah pengawasan-Nya. Segala yang mereka rencanakan untuk menipu rasul dan melenyapkan kebenaran agama-Nya di bumi ini, atau usaha mereka untuk membantu sekutu mereka dalam menuhankan berhala, pasti diketahui Allah. \n\nAllah Mengetahui segala perasaan yang terkandung dalam hati manusia, dan perbuatan apa saja yang mereka kerjakan. Firman Allah \"Sesungguhnya Dia Maha Mengetahui apa yang ada dalam dada manusia\" mengisyaratkan kepada pengertian sekalipun orang-orang kafir diberi kesempatan untuk hidup lebih lama lagi, namun mereka tidak akan meninggalkan kekufurannya. Oleh karena itu, sia-sia Allah memanjangkan umurnya.",
          "39": "Ayat ini menegaskan bahwa manusia dijadikan sebagai khalifah di bumi. Sebagai khalifah, yang dapat diartikan sebagai penguasa, manusia diberi kemampuan untuk memanfaatkan alam ini dengan sebaik-baiknya guna kesejahteraan hidup mereka. Sebagian ahli tafsir menerangkan maksud khala'if fi al-ardh ialah sebagian manusia menggantikan manusia yang lain, satu generasi menggantikan generasi lain agar mereka mengambil pelajaran karena Allah telah membinasakan umat terdahulu disebabkan dosa yang mereka lakukan.\n\nSemuanya bertujuan agar mereka menyadari siapakah mereka itu sebenarnya. Rasa keinsafan demikian insya Allah akan mendorong untuk mensyukuri segala nikmat-Nya yang tidak terhingga, mengesakan-Nya dari segala perbuatan dan kepercayaan yang berbau syirik, serta menaati segala perintah-Nya. Semakin bertambah rasa kekafiran itu dalam lubuk hati mereka, makin bertambah pula kemarahan dan kemurkaan Allah. Akan tetapi, tidaklah berarti bahwa hal demikian akan mengurangi kebesaran dan keagungan Allah, sebab Dia tidak memerlukan puji dan syukur manusia untuk keagungan dan kemuliaan-Nya, seperti bunyi ayat:\n\nDan barang siapa bersyukur (kepada Allah), maka sesungguhnya dia bersyukur untuk dirinya sendiri; dan barang siapa tidak bersyukur (kufur), maka sesungguhnya Allah Mahakaya, Maha Terpuji. (Luqman/31: 12) \n\nSebaliknya, kerugian akan menimpa mereka di hari akhirat kelak karena tidak mau kembali ke jalan yang benar, dan tetap berada dalam kekafiran. Mereka kekal dalam siksaan api neraka Jahanam seperti diuraikan di atas. Sengaja kalimat, \"tidaklah menambah kekafiran itu bagi orang-orang kafir\" disebutkan dua kali karena mengandung maksud bahwa kufur yang menimbulkan kemarahan Allah dan kufur yang mendatangkan kerugian, keduanya terpisah dan mengandung makna sendiri-sendiri.",
          "40": "Dalam ayat ini, Allah memerintahkan Nabi Muhammad agar mengajak orang-orang musyrik itu untuk berdialog menjajaki jalan pikiran mereka yang salah. Apa sebab orang-orang musyrik itu meminta pertolongan kepada patung dan berhala yang mereka sekutukan kepada Allah. Adakah bukti yang menunjukkan bahwa berhala itu pantas disembah. Orang-orang musyrik Mekah itu tidak paham benar akan hakikat tuhan mereka, bagaimana keadaannya. Seandainya mereka menyadari bahwa tuhan-tuhan mereka itu tidak sanggup berbuat apa-apa, tentulah mereka tidak menyembahnya. Tetapi sebaliknya, kalau memang betul berhala-berhala itu mempunyai kekuatan (untuk mencipta), tentulah mereka mampu memperlihatkan hasilnya. Demikian juga, apabila Allah mempunyai sekutu dalam menciptakan langit, tentu sekutu itu juga berhak disembah seperti yang mereka duga. Apakah ada kitab suci (yang benar isinya) yang dapat menguatkan dalil-dalil tentang adanya sekutu bagi Tuhan itu? \n\nNabi Muhammad memberi kesempatan kepada kaum musyrik agar mengemukakan alasan penyembahan mereka terhadap berhala, terutama kemampuan tuhan-tuhan itu untuk menciptakan makhluk, sehingga ia berhak disembah dan dipersekutukan dengan Allah dalam soal penciptaan. Karena kepercayaan demikian hanya semata-mata warisan dari nenek moyang mereka (lihat Surah al-Baqarah/2: 170), maka tiada satu alasan yang dapat mereka kemukakan, baik alasan yang diterima dari dalil naqli (nas) maupun alasan aqli (logika). Di mana pun tidak pernah ada dijumpai suatu kitab suci yang menyerukan manusia menyembah berhala, sebab semuanya hanyalah imajinasi dan khayalan orang-orang dahulu saja. Setelah Al-Qur'an menyalahkan dan mematahkan jalan pikiran mereka, dan bahwa apa yang mereka turuti itu adalah jalan pikiran pemimpin-pemimpin mereka yang sesat, maka tentulah pendapat mereka batil dan membawa kepada kesengsaraan.",
          "41": "Allah melukiskan kebenaran dan keagungan kekuasaan-Nya. Dengan kekuasaan-Nya, langit tercipta tanpa tiang, dan gunung-gunung berdiri dengan kokoh. Allah menyebarkan makhluk melata (dabbah), manusia, dan hewan di atas bumi, seperti bunyi ayat:\n\nDia menciptakan langit tanpa tiang sebagaimana kamu melihatnya, dan Dia meletakkan gunung-gunung (di permukaan) bumi agar ia (bumi) tidak menggoyangkan kamu; dan memperkembangbiakkan segala macam jenis makhluk bergerak yang bernyawa di bumi. Dan Kami turunkan air hujan dari langit, lalu Kami tumbuhkan padanya segala macam tumbuh-tumbuhan yang baik. (Luqman/31: 10) \n\nSemuanya membuktikan kebesaran dan kekuasaan Allah Yang Mahaagung. Pengertian Allah menahan langit dan bumi ialah menahan langit itu dengan hukum gravitasi agar tidak guncang dan roboh, atau bergeser dari tempatnya. Allah memelihara dan mengawasi keduanya dengan pengawasan yang Dia sendirilah yang mengetahuinya. Semua benda-benda langit di jagat raya ini beredar menurut garis edarnya masing-masing. Para ahli ilmu astronomi dapat membuktikan bahwa tidak pernah terjadi benturan antara benda-benda angkasa itu satu dengan yang lain. Semuanya beredar menurut garis edarnya masing-masing. Keterangan lain yang menguatkan arti yang terkandung dalam ayat di atas yakni:\n\nDan di antara tanda-tanda (kebesaran)-Nya ialah berdirinya langit dan bumi dengan kehendak-Nya. Kemudian apabila Dia memanggil kamu sekali panggil dari bumi, seketika itu kamu keluar (dari kubur). (ar-Rum/30: 25)\n\nKuatnya bangunan langit dan bumi itu sehingga tidak pernah mengalami kerusakan, keruntuhan, dan sebagainya adalah karena kekuasaan Allah juga. Jika Allah Yang Mahakuasa itu bermaksud menghancurkan bumi dan langit itu, tiada satu kekuatan pun dari makhluk yang sanggup mencegahnya. Demikianlah pula dijelaskan oleh ayat lain:\n\nTidakkah engkau memperhatikan bahwa Allah menundukkan bagimu (manusia) apa yang ada di bumi dan kapal yang berlayar di lautan dengan perintah-Nya. Dan Dia menahan (benda-benda) langit agar tidak jatuh ke bumi, melainkan dengan izin-Nya? Sungguh, Allah Maha Pengasih, Maha Penyayang kepada manusia. (al-hajj/22: 65)\n\nDi samping sifat-Nya Yang Maha Perkasa itu, Allah juga mempunyai sifat rasa kasih sayang kepada hamba-Nya. Biarpun manusia di bumi ini kebanyakan kafir dan tidak mau tunduk pada pengajaran dan pedoman hidup menuju kesejahteraan dunia dan akhirat yang telah ditetapkan-Nya, namun azab dan murka Allah tiada segera diturunkan untuk menghukum kaum kafir dan pendurhaka. Kasih sayang Allah itu ialah selain menunda siksaan bagi orang kafir dan ingkar, juga sangat mudah memberi ampunan kepada siapa yang mau tobat dari segala kesalahannya, bagaimanapun besarnya perbuatan maksiat yang pernah dilakukannya. Allah Maha Perkasa, Maha Pengasih, dan Penyayang kepada seluruh hamba-Nya, baik terhadap orang mukmin maupun kafir.",
          "42": "Orang-orang musyrik itu bersumpah dengan sepenuh hati, seandainya Allah mengirimkan seorang rasul yang memperingatkan kesesatan jalan pikiran dan kerusakan moral masyarakatnya, pasti merekalah yang paling mudah menerima petunjuk rasul itu, dibanding dengan umat mana pun yang pernah ada sebelum mereka. Penjelasan ayat ini diperkuat pula oleh ayat lain yang berbunyi:\n\nSekiranya di sisi kami ada sebuah kitab dari (kitab-kitab yang diturunkan) kepada orang-orang dahulu, tentu kami akan menjadi hamba Allah yang disucikan (dari dosa). Tetapi ternyata mereka mengingkarinya (Al-Qur'an); maka kelak mereka akan mengetahui (akibat keingkarannya itu). (ash-shaffat/37: 168-170)\n\nDalam Tafsir al-Khazin diriwayatkan bahwa orang-orang kafir Mekah ketika mengetahui Ahli Kitab (Yahudi dan Nasrani) mendustakan para rasul yang diutus kepada mereka, mereka pun bersumpah dengan nama Allah seandainya kepada mereka diutus pula rasul seperti yang pernah diutus kepada Bani Israil itu, tentulah mereka akan menjadi bangsa yang lebih banyak memperoleh petunjuk dibanding dengan kaum Yahudi dan Nasrani. Sikap demikian itu mereka tunjukkan sebelum Muhammad saw diutus sebagai rasul. Tetapi, setelah beliau betul-betul diutus ke tengah mereka, mereka pun mendustakannya sebagaimana sikap Ahli Kitab terhadap rasul-Nya. Untuk memperingatkan kaum Muslimin akan sikap orang-orang kafir yang telah memperoleh kebenaran murni tentang Nabi Muhammad dan risalahnya itu, Allah menurunkan ayat-ayat di atas. \n\nSetelah impian mereka menjadi kenyataan, yakni dengan diutusnya Muhammad saw sebagai rasul di tengah masyarakat mereka untuk menyampaikan kebenaran dari Allah, yang tercantum dalam Al-Qur'an al-Karim, maka dengan serta merta mereka mendustakannya. Bahkan sikap keingkaran dan kesombongan mereka makin menjadi-jadi. Mereka bukannya makin dekat kepada kebenaran, bahkan semakin jauh dengan alasan menjaga kehormatan dan martabat kaumnya. Tegasnya, para pemimpin musyrik Mekah itu enggan mengikuti ajaran Nabi Muhammad. Keadaan mereka serupa dengan unta liar yang kabur, semakin dikejar oleh pemiliknya, semakin cepat larinya dan semakin tersesat jalannya, sehingga sukar ditangkap.",
          "43": "Ayat ini masih menjelaskan sikap orang musyrik Mekah terhadap dakwah Nabi saw. Dengan segala daya dan pikiran, dengan harta dan kekayaan yang dimiliki, mereka menentang dakwah Nabi Muhammad, bahkan beliau diboikot dan dihalangi. Tetapi, segala rencana jahat guna mematahkan dakwah Islam itu pada akhirnya menjadi bumerang bagi mereka. Kegagalan kaum kafir Mekah mencegah tersiarnya dakwah Islam telah tertulis dengan tinta emas dalam sejarah Islam. Setiap usaha dan rencana jahat untuk memadamkan cahaya agama Allah di bumi ini, pasti akan gagal, sebab Allah selalu akan memelihara eksistensi agama-Nya di bumi ini, sampai akhir zaman, biarpun tidak disukai oleh orang-orang musyrik, sebagaimana disebutkan dalam ayat:\n\nMereka hendak memadamkan cahaya (agama) Allah dengan mulut (ucapan-ucapan) mereka, tetapi Allah tetap menyempurnakan cahaya-Nya meskipun orang-orang kafir membencinya. (ash-shaff/61: 8) \n\nDalam Aisar at-Tafasir disebutkan satu riwayat bahwa Ka'ab berkata kepada Ibnu 'Abbas, \"Dalam Taurat diterangkan bahwa siapa yang menggali lubang untuk kawannya, dialah yang masuk ke dalamnya.\" Ibnu 'Abbas menjawab, \"Hal itu aku temukan dalam Al-Qur'an.\" Ka'ab bertanya, \"Di mana?\" Ibnu 'Abbas menjawab, \"Bacalah wa la yahiqul makrus-sayyi' illa bi ahlih (Rencana yang jahat itu hanya akan menimpa orang yang merencanakannya sendiri.)\" \n\nSeperti diuraikan di atas, kadang-kadang Allah menunda kedatangan siksa sebagai bukti kasih sayang-Nya kepada orang-orang kafir. Tetapi, jangan dikira bahwa Allah tidak akan menyiksa mereka bila mereka tidak tobat, sebab bila mereka di dunia belum merasakan siksaan, di akhirat kelak pasti akan mereka alami juga. Di akhirat nanti baru mereka yakini ke mana orang yang zalim itu ditempatkan Allah sesuai dengan ancaman Allah ketika mereka masih di dunia.\n\nDan orang-orang yang zalim kelak akan tahu ke tempat mana mereka akan kembali. (asy-Syu'ara'/26: 227)\n\nSekalipun azab itu sudah pasti datang, orang-orang yang tidak mengimaninya masih saja menentang kedatangannya dengan tidak menghentikan segala perbuatan jahatnya. Dalam ayat ini, Allah mengungkapkan nasib mereka kelak dengan mengatakan bahwa tidak ada yang mereka tunggu-tunggu itu melainkan siksaan seperti apa yang telah menimpa manusia dahulu kala disebabkan keingkaran mereka terhadap risalah para rasul. Tetapi, ujung ayat ini menegaskan bahwa sunah Allah menentukan bahwa setiap orang yang mendustakan ajaran-Nya pasti akan disiksa dengan azab yang tidak akan berubah dan tidak akan dipindahkan kepada orang lain. Allah tidak akan melimpahkan rahmat-Nya pada seseorang yang sudah tercatat sebagai pembangkang dan pendosa, serta tidak akan memikulkan dosanya kepada diri orang lain.\n\nDan seseorang tidak akan memikul beban dosa orang lain. (al-An'am/6: 164) \n\n(44) Allah memerintahkan kepada Nabi Muhammad supaya memperingatkan kaum pendusta (musyrik), apakah mereka tidak pernah melakukan perjalanan untuk menyaksikan betapa dahsyatnya azab yang diturunkan pada bangsa-bangsa dahulu akibat keingkaran mereka pada kebenaran ajaran Allah.\n\nSemula ayat ini ditujukan kepada kaum musyrik Mekah, yang umumnya bermata pencaharian berdagang. Pada musim-musim tertentu, kafilah Quraisy berangkat menuju Syam (Syiria) dan Irak. Pada daerah-daerah gurun pasir yang mereka lewati, banyak terdapat bekas-bekas negeri yang pernah dihuni manusia di zaman kuno, akibat kedurhakaan penduduknya kepada rasul utusan Allah. Mereka disiksa, dan bumi tempat mereka berpijak dijungkirbalikkan sehingga hancur sama sekali. Allah memperingatkan kaum pedagang Quraisy, andaikata mereka juga mengikuti jejak bangsa yang mendustakan-Nya, maka kepada mereka pasti akan berlaku sunatullah. Mereka akan merasakan siksaan dan azab yang tidak sanggup mereka tolak. \n\nUntuk meyakinkan mereka, ayat 44 ini lebih lanjut memberi penjelasan bahwa umat-umat yang telah merasakan balasan akibat sikap dan tindak-tanduk mereka yang menentang ajaran rasul itu adalah umat yang perkasa, berani, punya harta, dan anak keturunan yang banyak sekali. Namun demikian, keperkasaan, kekayaan, dan keturunan mereka yang besar itu ternyata tidak sanggup membela dan melindunginya dari azab Allah. \n\nMaksud berjalan di muka bumi, menurut penafsiran Sayid Quthub dalam Tafsir fi Â¨ilal al-Qur'an, adalah berjalan dengan mata hati terbuka dan pikiran yang segar sambil merenungkan peristiwa-peristiwa yang pernah menimpa umat dahulu, betapa dan bagaimana keadaan mereka sewaktu ditimpa azab Allah. Perjalanan demikian, menurutnya, menambah perasaan takwa kepada Allah, membangunkan hati dari kelalaian dan kelengahan akan sunatullah yang pasti berlaku itu. Mereka diingatkan bahwa Allah Yang Mahakuasa itu tidak pernah kewalahan untuk melaksanakan keputusan-Nya, apabila Dia telah menginginkan. Sebab dengan tegas dikatakan tiada satu daya dan kekuatan yang sanggup melemahkan Allah, baik kekuatan itu terdapat di langit maupun di bumi. Bagaimana Allah itu lemah? Bukankah ilmu dan kekuasaan-Nya meliputi kerajaan langit dan bumi? Bagaimana mungkin makhluk ciptaan-Nya, Sekalipun seluruh manusia bersatu menandingi kekuasaan Allah, tidak akan sanggup menjatuhkan atau menandingi kekuasaan-Nya, sedang semuanya dijadikan dengan fisik yang lemah? Allah berfirman:\n\nAllah hendak memberikan keringanan kepadamu, karena manusia diciptakan (bersifat) lemah. (an-Nisa'/4: 28)\n\nPerhatikanlah akhir ayat ini dengan penegasan bahwa Allah Maha Mengetahui dan Mahakuasa terhadap segala makhluk ciptaan-Nya. Dalam Tafsir al-Maragi dijelaskan bahwa Allah Maha Mengetahui dan Mahakuasa terhadap orang-orang yang harus mendapatkan siksaan dengan segera. Sebaliknya, orang yang tobat, dan ingin kembali kepada Tuhan dari kesesatannya, Dia memberi petunjuk kepadanya sehingga beriman sepenuhnya. Ketika orang-orang musyrik meminta kepada Nabi Muhammad agar azab yang dijanjikan itu segera diturunkan, maka diterangkan kepada mereka bahwa Allah menentukan peraturan-Nya bagi umat ini, yakni siksaan tidak segera diturunkan kepada mereka yang melakukan kedurhakaan atau keingkaran terhadap ajaran rasul. Sebab diharapkan sebagian di antara mereka mungkin masih ada yang insaf dan kembali kepada ajaran Tuhannya",
          "44": "Ayat ini masih menjelaskan sikap orang musyrik Mekah terhadap dakwah Nabi saw. Dengan segala daya dan pikiran, dengan harta dan kekayaan yang dimiliki, mereka menentang dakwah Nabi Muhammad, bahkan beliau diboikot dan dihalangi. Tetapi, segala rencana jahat guna mematahkan dakwah Islam itu pada akhirnya menjadi bumerang bagi mereka. Kegagalan kaum kafir Mekah mencegah tersiarnya dakwah Islam telah tertulis dengan tinta emas dalam sejarah Islam. Setiap usaha dan rencana jahat untuk memadamkan cahaya agama Allah di bumi ini, pasti akan gagal, sebab Allah selalu akan memelihara eksistensi agama-Nya di bumi ini, sampai akhir zaman, biarpun tidak disukai oleh orang-orang musyrik, sebagaimana disebutkan dalam ayat:\n\nMereka hendak memadamkan cahaya (agama) Allah dengan mulut (ucapan-ucapan) mereka, tetapi Allah tetap menyempurnakan cahaya-Nya meskipun orang-orang kafir membencinya. (ash-shaff/61: 8) \n\nDalam Aisar at-Tafasir disebutkan satu riwayat bahwa Ka'ab berkata kepada Ibnu 'Abbas, \"Dalam Taurat diterangkan bahwa siapa yang menggali lubang untuk kawannya, dialah yang masuk ke dalamnya.\" Ibnu 'Abbas menjawab, \"Hal itu aku temukan dalam Al-Qur'an.\" Ka'ab bertanya, \"Di mana?\" Ibnu 'Abbas menjawab, \"Bacalah wa la yahiqul makrus-sayyi' illa bi ahlih (Rencana yang jahat itu hanya akan menimpa orang yang merencanakannya sendiri.)\" \n\nSeperti diuraikan di atas, kadang-kadang Allah menunda kedatangan siksa sebagai bukti kasih sayang-Nya kepada orang-orang kafir. Tetapi, jangan dikira bahwa Allah tidak akan menyiksa mereka bila mereka tidak tobat, sebab bila mereka di dunia belum merasakan siksaan, di akhirat kelak pasti akan mereka alami juga. Di akhirat nanti baru mereka yakini ke mana orang yang zalim itu ditempatkan Allah sesuai dengan ancaman Allah ketika mereka masih di dunia.\n\nDan orang-orang yang zalim kelak akan tahu ke tempat mana mereka akan kembali. (asy-Syu'ara'/26: 227)\n\nSekalipun azab itu sudah pasti datang, orang-orang yang tidak mengimaninya masih saja menentang kedatangannya dengan tidak menghentikan segala perbuatan jahatnya. Dalam ayat ini, Allah mengungkapkan nasib mereka kelak dengan mengatakan bahwa tidak ada yang mereka tunggu-tunggu itu melainkan siksaan seperti apa yang telah menimpa manusia dahulu kala disebabkan keingkaran mereka terhadap risalah para rasul. Tetapi, ujung ayat ini menegaskan bahwa sunah Allah menentukan bahwa setiap orang yang mendustakan ajaran-Nya pasti akan disiksa dengan azab yang tidak akan berubah dan tidak akan dipindahkan kepada orang lain. Allah tidak akan melimpahkan rahmat-Nya pada seseorang yang sudah tercatat sebagai pembangkang dan pendosa, serta tidak akan memikulkan dosanya kepada diri orang lain.\n\nDan seseorang tidak akan memikul beban dosa orang lain. (al-An'am/6: 164)",
          "45": "Ayat ini menjelaskan manifestasi dari sifat rahman dan rahim dari Allah. Jika Allah langsung menyiksa orang-orang musyrik itu seperti apa yang mereka kehendaki, pasti mereka dan binatang-binatang mati kehausan akibat kurang minum. Tetapi, Allah tidak bertindak begitu sekalipun Dia berkuasa, sebaliknya Dia tetapkan suatu ketentuan yakni siksaan itu ditunda sampai pada waktu yang hanya diketahui-Nya sendiri. Akan tetapi, kalau azab itu telah menimpa, tidak akan dikurangi dan mereka tidak akan bisa melepaskan diri. Ketentuan Allah yang demikian itu hanya berlaku bagi umat Nabi Muhammad saja, sedang pada umat sebelumnya bila mereka bersalah, langsung dihukum tanpa penundaan. \n\nDalam Tafsir al-Wadhih dijelaskan bahwa ketentuan itu adalah kemuliaan yang dikaruniakan Allah kepada Nabi Muhammad, sebagai suatu hukum bagi beliau dan umatnya. Dengan harapan agar orang-orang yang masih belum mau beriman segera tobat, kembali kepada petunjuk dan ajaran-Nya. Tetapi, bila janji Allah telah datang, tidak ada waktu lagi untuk menundanya. Di situlah nanti masing-masing orang akan diperhitungkan perbuatannya. Yang baik dibalas dengan ganjaran kebaikan, yang jahat dibalas dengan azab.\n\nDengan kasih dan sayang Allah, Al-Qur'an menyerukan supaya manusia bertobat dan kembali kepada-Nya. Biarpun azab itu telah ditunda kedatangannya, namun kapan waktunya yang pasti, tiada seorang pun yang mengetahuinya. Orang yang merasa dirinya bersalah tidak perlu berputus asa, sebab betapapun besarnya kesalahan, jika diakhiri dengan penyesalan dan tobat yang sesungguhnya, pasti akan diampuni Allah. Dialah Yang Maha Pengampun dan Penyayang. Dialah Yang Maha Mengetahui dan memperhatikan sekalian hamba-Nya."
        }
      }
    }
  }
}