{
  "name": "Fussilat",
  "name_translations": {
    "ar": "فصلت",
    "en": "Explained in detail",
    "id": "Yang Dijelaskan"
  },
  "number_of_ayah": 54,
  "number_of_surah": 41,
  "place": "Mecca",
  "recitations": [{
    "name": "Mishari Rashid al-`Afasy",
    "audio_url": "https://download.quranicaudio.com/quran/mishaari_raashid_al_3afaasee/041.mp3"
  }, {
    "name": "Abdur-Rahman as-Sudais",
    "audio_url": "https://download.quranicaudio.com/quran/abdurrahmaan_as-sudays/041.mp3"
  }, {
    "name": "Saad al-Ghamdi",
    "audio_url": "https://download.quranicaudio.com/quran/sa3d_al-ghaamidi/complete/041.mp3"
  }],
  "type": "Makkiyah",
  "verses": [{
    "number": 1,
    "text": "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ حمٓ",
    "translation_en": "Ha, Meem.",
    "translation_id": "Haa Miim."
  }, {
    "number": 2,
    "text": "تَنزِيلٌ مِّنَ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ",
    "translation_en": "[This is] a revelation from the Entirely Merciful, the Especially Merciful -",
    "translation_id": "Diturunkan dari Tuhan Yang Maha Pemurah lagi Maha Penyayang."
  }, {
    "number": 3,
    "text": "كِتَٰبٌ فُصِّلَتْ ءَايَٰتُهُۥ قُرْءَانًا عَرَبِيًّا لِّقَوْمٍ يَعْلَمُونَ",
    "translation_en": "A Book whose verses have been detailed, an Arabic Qur'an for a people who know,",
    "translation_id": "Kitab yang dijelaskan ayat-ayatnya, yakni bacaan dalam bahasa Arab, untuk kaum yang mengetahui,"
  }, {
    "number": 4,
    "text": "بَشِيرًا وَنَذِيرًا فَأَعْرَضَ أَكْثَرُهُمْ فَهُمْ لَا يَسْمَعُونَ",
    "translation_en": "As a giver of good tidings and a warner; but most of them turn away, so they do not hear.",
    "translation_id": "yang membawa berita gembira dan yang membawa peringatan, tetapi kebanyakan mereka berpaling, tidak mau mendengarkan."
  }, {
    "number": 5,
    "text": "وَقَالُوا۟ قُلُوبُنَا فِىٓ أَكِنَّةٍ مِّمَّا تَدْعُونَآ إِلَيْهِ وَفِىٓ ءَاذَانِنَا وَقْرٌ وَمِنۢ بَيْنِنَا وَبَيْنِكَ حِجَابٌ فَٱعْمَلْ إِنَّنَا عَٰمِلُونَ",
    "translation_en": "And they say, \"Our hearts are within coverings from that to which you invite us, and in our ears is deafness, and between us and you is a partition, so work; indeed, we are working.\"",
    "translation_id": "Mereka berkata: \"Hati kami berada dalam tutupan (yang menutupi) apa yang kamu seru kami kepadanya dan telinga kami ada sumbatan dan antara kami dan kamu ada dinding, maka bekerjalah kamu; sesungguhnya kami bekerja (pula)\"."
  }, {
    "number": 6,
    "text": "قُلْ إِنَّمَآ أَنَا۠ بَشَرٌ مِّثْلُكُمْ يُوحَىٰٓ إِلَىَّ أَنَّمَآ إِلَٰهُكُمْ إِلَٰهٌ وَٰحِدٌ فَٱسْتَقِيمُوٓا۟ إِلَيْهِ وَٱسْتَغْفِرُوهُ وَوَيْلٌ لِّلْمُشْرِكِينَ",
    "translation_en": "Say, O [Muhammad], \"I am only a man like you to whom it has been revealed that your god is but one God; so take a straight course to Him and seek His forgiveness.\" And woe to those who associate others with Allah -",
    "translation_id": "Katakanlah: \"Bahwasanya aku hanyalah seorang manusia seperti kamu, diwahyukan kepadaku bahwasanya Tuhan kamu adalah Tuhan yang Maha Esa, maka tetaplah pada jalan yang lurus menuju kepada-Nya dan mohonlah ampun kepada-Nya. Dan kecelakaan besarlah bagi orang-orang yang mempersekutukan-Nya,"
  }, {
    "number": 7,
    "text": "ٱلَّذِينَ لَا يُؤْتُونَ ٱلزَّكَوٰةَ وَهُم بِٱلْءَاخِرَةِ هُمْ كَٰفِرُونَ",
    "translation_en": "Those who do not give zakah, and in the Hereafter they are disbelievers.",
    "translation_id": "(yaitu) orang-orang yang tidak menunaikan zakat dan mereka kafir akan adanya (kehidupan) akhirat."
  }, {
    "number": 8,
    "text": "إِنَّ ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّٰلِحَٰتِ لَهُمْ أَجْرٌ غَيْرُ مَمْنُونٍ",
    "translation_en": "Indeed, those who believe and do righteous deeds - for them is a reward uninterrupted.",
    "translation_id": "Sesungguhnya orang-orang yang beriman dan beramal saleh, mereka mendapat pahala yang tiada putus-putusnya\"."
  }, {
    "number": 9,
    "text": "قُلْ أَئِنَّكُمْ لَتَكْفُرُونَ بِٱلَّذِى خَلَقَ ٱلْأَرْضَ فِى يَوْمَيْنِ وَتَجْعَلُونَ لَهُۥٓ أَندَادًا ذَٰلِكَ رَبُّ ٱلْعَٰلَمِينَ",
    "translation_en": "Say, \"Do you indeed disbelieve in He who created the earth in two days and attribute to Him equals? That is the Lord of the worlds.\"",
    "translation_id": "Katakanlah: \"Sesungguhnya patutkah kamu kafir kepada Yang menciptakan bumi dalam dua masa dan kamu adakan sekutu-sekutu bagi-Nya? (Yang bersifat) demikian itu adalah Rabb semesta alam\"."
  }, {
    "number": 10,
    "text": "وَجَعَلَ فِيهَا رَوَٰسِىَ مِن فَوْقِهَا وَبَٰرَكَ فِيهَا وَقَدَّرَ فِيهَآ أَقْوَٰتَهَا فِىٓ أَرْبَعَةِ أَيَّامٍ سَوَآءً لِّلسَّآئِلِينَ",
    "translation_en": "And He placed on the earth firmly set mountains over its surface, and He blessed it and determined therein its [creatures'] sustenance in four days without distinction - for [the information] of those who ask.",
    "translation_id": "Dan dia menciptakan di bumi itu gunung-gunung yang kokoh di atasnya. Dia memberkahinya dan Dia menentukan padanya kadar makanan-makanan (penghuni)nya dalam empat masa. (Penjelasan itu sebagai jawaban) bagi orang-orang yang bertanya."
  }, {
    "number": 11,
    "text": "ثُمَّ ٱسْتَوَىٰٓ إِلَى ٱلسَّمَآءِ وَهِىَ دُخَانٌ فَقَالَ لَهَا وَلِلْأَرْضِ ٱئْتِيَا طَوْعًا أَوْ كَرْهًا قَالَتَآ أَتَيْنَا طَآئِعِينَ",
    "translation_en": "Then He directed Himself to the heaven while it was smoke and said to it and to the earth, \"Come [into being], willingly or by compulsion.\" They said, \"We have come willingly.\"",
    "translation_id": "Kemudian Dia menuju kepada penciptaan langit dan langit itu masih merupakan asap, lalu Dia berkata kepadanya dan kepada bumi: \"Datanglah kamu keduanya menurut perintah-Ku dengan suka hati atau terpaksa\". Keduanya menjawab: \"Kami datang dengan suka hati\"."
  }, {
    "number": 12,
    "text": "فَقَضَىٰهُنَّ سَبْعَ سَمَٰوَاتٍ فِى يَوْمَيْنِ وَأَوْحَىٰ فِى كُلِّ سَمَآءٍ أَمْرَهَا وَزَيَّنَّا ٱلسَّمَآءَ ٱلدُّنْيَا بِمَصَٰبِيحَ وَحِفْظًا ذَٰلِكَ تَقْدِيرُ ٱلْعَزِيزِ ٱلْعَلِيمِ",
    "translation_en": "And He completed them as seven heavens within two days and inspired in each heaven its command. And We adorned the nearest heaven with lamps and as protection. That is the determination of the Exalted in Might, the Knowing.",
    "translation_id": "Maka Dia menjadikannya tujuh langit dalam dua masa. Dia mewahyukan pada tiap-tiap langit urusannya. Dan Kami hiasi langit yang dekat dengan bintang-bintang yang cemerlang dan Kami memeliharanya dengan sebaik-baiknya. Demikianlah ketentuan Yang Maha Perkasa lagi Maha Mengetahui."
  }, {
    "number": 13,
    "text": "فَإِنْ أَعْرَضُوا۟ فَقُلْ أَنذَرْتُكُمْ صَٰعِقَةً مِّثْلَ صَٰعِقَةِ عَادٍ وَثَمُودَ",
    "translation_en": "But if they turn away, then say, \"I have warned you of a thunderbolt like the thunderbolt [that struck] 'Aad and Thamud.",
    "translation_id": "Jika mereka berpaling maka katakanlah: \"Aku telah memperingatkan kamu dengan petir, seperti petir yang menimpa kaum 'Aad dan Tsamud\"."
  }, {
    "number": 14,
    "text": "إِذْ جَآءَتْهُمُ ٱلرُّسُلُ مِنۢ بَيْنِ أَيْدِيهِمْ وَمِنْ خَلْفِهِمْ أَلَّا تَعْبُدُوٓا۟ إِلَّا ٱللَّهَ قَالُوا۟ لَوْ شَآءَ رَبُّنَا لَأَنزَلَ مَلَٰٓئِكَةً فَإِنَّا بِمَآ أُرْسِلْتُم بِهِۦ كَٰفِرُونَ",
    "translation_en": "[That occurred] when the messengers had come to them before them and after them, [saying], \"Worship not except Allah.\" They said, \"If our Lord had willed, He would have sent down the angels, so indeed we, in that with which you have been sent, are disbelievers.\"",
    "translation_id": "Ketika para rasul datang kepada mereka dari depan dan belakang mereka (dengan menyerukan): \"Janganlah kamu menyembah selain Allah\". Mereka menjawab: \"Kalau Tuhan kami menghendaki tentu Dia akan menurunkan malaikat-malaikat-Nya, maka sesungguhnya kami kafir kepada wahyu yang kamu diutus membawanya\"."
  }, {
    "number": 15,
    "text": "فَأَمَّا عَادٌ فَٱسْتَكْبَرُوا۟ فِى ٱلْأَرْضِ بِغَيْرِ ٱلْحَقِّ وَقَالُوا۟ مَنْ أَشَدُّ مِنَّا قُوَّةً أَوَلَمْ يَرَوْا۟ أَنَّ ٱللَّهَ ٱلَّذِى خَلَقَهُمْ هُوَ أَشَدُّ مِنْهُمْ قُوَّةً وَكَانُوا۟ بِـَٔايَٰتِنَا يَجْحَدُونَ",
    "translation_en": "As for 'Aad, they were arrogant upon the earth without right and said, \"Who is greater than us in strength?\" Did they not consider that Allah who created them was greater than them in strength? But they were rejecting Our signs.",
    "translation_id": "Adapun kaum 'Aad maka mereka menyombongkan diri di muka bumi tanpa alasan yang benar dan berkata: \"Siapakah yang lebih besar kekuatannya dari kami?\" Dan apakah mereka itu tidak memperhatikan bahwa Allah Yang menciptakan mereka adalah lebih besar kekuatan-Nya daripada mereka? Dan adalah mereka mengingkari tanda-tanda (kekuatan) Kami."
  }, {
    "number": 16,
    "text": "فَأَرْسَلْنَا عَلَيْهِمْ رِيحًا صَرْصَرًا فِىٓ أَيَّامٍ نَّحِسَاتٍ لِّنُذِيقَهُمْ عَذَابَ ٱلْخِزْىِ فِى ٱلْحَيَوٰةِ ٱلدُّنْيَا وَلَعَذَابُ ٱلْءَاخِرَةِ أَخْزَىٰ وَهُمْ لَا يُنصَرُونَ",
    "translation_en": "So We sent upon them a screaming wind during days of misfortune to make them taste the punishment of disgrace in the worldly life; but the punishment of the Hereafter is more disgracing, and they will not be helped.",
    "translation_id": "Maka Kami meniupkan angin yang amat gemuruh kepada mereka dalam beberapa hari yang sial, karena Kami hendak merasakan kepada mereka itu siksaan yang menghinakan dalam kehidupan dunia. Dan Sesungguhnya siksa akhirat lebih menghinakan sedang mereka tidak diberi pertolongan."
  }, {
    "number": 17,
    "text": "وَأَمَّا ثَمُودُ فَهَدَيْنَٰهُمْ فَٱسْتَحَبُّوا۟ ٱلْعَمَىٰ عَلَى ٱلْهُدَىٰ فَأَخَذَتْهُمْ صَٰعِقَةُ ٱلْعَذَابِ ٱلْهُونِ بِمَا كَانُوا۟ يَكْسِبُونَ",
    "translation_en": "And as for Thamud, We guided them, but they preferred blindness over guidance, so the thunderbolt of humiliating punishment seized them for what they used to earn.",
    "translation_id": "Dan adapun kaum Tsamud, maka mereka telah Kami beri petunjuk tetapi mereka lebih menyukai buta (kesesatan) daripada petunjuk, maka mereka disambar petir azab yang menghinakan disebabkan apa yang telah mereka kerjakan."
  }, {
    "number": 18,
    "text": "وَنَجَّيْنَا ٱلَّذِينَ ءَامَنُوا۟ وَكَانُوا۟ يَتَّقُونَ",
    "translation_en": "And We saved those who believed and used to fear Allah.",
    "translation_id": "Dan Kami selamatkan orang-orang yang beriman dan mereka adalah orang-orang yang bertakwa."
  }, {
    "number": 19,
    "text": "وَيَوْمَ يُحْشَرُ أَعْدَآءُ ٱللَّهِ إِلَى ٱلنَّارِ فَهُمْ يُوزَعُونَ",
    "translation_en": "And [mention, O Muhammad], the Day when the enemies of Allah will be gathered to the Fire while they are [driven] assembled in rows,",
    "translation_id": "Dan (ingatlah) hari (ketika) musuh-musuh Allah di giring ke dalam neraka, lalu mereka dikumpulkan semuanya."
  }, {
    "number": 20,
    "text": "حَتَّىٰٓ إِذَا مَا جَآءُوهَا شَهِدَ عَلَيْهِمْ سَمْعُهُمْ وَأَبْصَٰرُهُمْ وَجُلُودُهُم بِمَا كَانُوا۟ يَعْمَلُونَ",
    "translation_en": "Until, when they reach it, their hearing and their eyes and their skins will testify against them of what they used to do.",
    "translation_id": "Sehingga apabila mereka sampai ke neraka, pendengaran, penglihatan dan kulit mereka menjadi saksi terhadap mereka tentang apa yang telah mereka kerjakan."
  }, {
    "number": 21,
    "text": "وَقَالُوا۟ لِجُلُودِهِمْ لِمَ شَهِدتُّمْ عَلَيْنَا قَالُوٓا۟ أَنطَقَنَا ٱللَّهُ ٱلَّذِىٓ أَنطَقَ كُلَّ شَىْءٍ وَهُوَ خَلَقَكُمْ أَوَّلَ مَرَّةٍ وَإِلَيْهِ تُرْجَعُونَ",
    "translation_en": "And they will say to their skins, \"Why have you testified against us?\" They will say, \"We were made to speak by Allah, who has made everything speak; and He created you the first time, and to Him you are returned.",
    "translation_id": "Dan mereka berkata kepada kulit mereka: \"Mengapa kamu menjadi saksi terhadap kami?\" Kulit mereka menjawab: \"Allah yang menjadikan segala sesuatu pandai berkata telah menjadikan kami pandai (pula) berkata, dan Dialah yang menciptakan kamu pada kali pertama dan hanya kepada-Nya lah kamu dikembalikan\"."
  }, {
    "number": 22,
    "text": "وَمَا كُنتُمْ تَسْتَتِرُونَ أَن يَشْهَدَ عَلَيْكُمْ سَمْعُكُمْ وَلَآ أَبْصَٰرُكُمْ وَلَا جُلُودُكُمْ وَلَٰكِن ظَنَنتُمْ أَنَّ ٱللَّهَ لَا يَعْلَمُ كَثِيرًا مِّمَّا تَعْمَلُونَ",
    "translation_en": "And you were not covering yourselves, lest your hearing testify against you or your sight or your skins, but you assumed that Allah does not know much of what you do.",
    "translation_id": "Kamu sekali-sekali tidak dapat bersembunyi dari kesaksian pendengaran, penglihatan dan kulitmu kepadamu bahkan kamu mengira bahwa Allah tidak mengetahui kebanyakan dari apa yang kamu kerjakan."
  }, {
    "number": 23,
    "text": "وَذَٰلِكُمْ ظَنُّكُمُ ٱلَّذِى ظَنَنتُم بِرَبِّكُمْ أَرْدَىٰكُمْ فَأَصْبَحْتُم مِّنَ ٱلْخَٰسِرِينَ",
    "translation_en": "And that was your assumption which you assumed about your Lord. It has brought you to ruin, and you have become among the losers.\"",
    "translation_id": "Dan yang demikian itu adalah prasangkamu yang telah kamu sangka kepada Tuhanmu, Dia telah membinasakan kamu, maka jadilah kamu termasuk orang-orang yang merugi."
  }, {
    "number": 24,
    "text": "فَإِن يَصْبِرُوا۟ فَٱلنَّارُ مَثْوًى لَّهُمْ وَإِن يَسْتَعْتِبُوا۟ فَمَا هُم مِّنَ ٱلْمُعْتَبِينَ",
    "translation_en": "So [even] if they are patient, the Fire is a residence for them; and if they ask to appease [Allah], they will not be of those who are allowed to appease.",
    "translation_id": "Jika mereka bersabar (menderita azab) maka nerakalah tempat diam mereka dan jika mereka mengemukakan alasan-alasan, maka tidaklah mereka termasuk orang-orang yang diterima alasannya."
  }, {
    "number": 25,
    "text": "وَقَيَّضْنَا لَهُمْ قُرَنَآءَ فَزَيَّنُوا۟ لَهُم مَّا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَحَقَّ عَلَيْهِمُ ٱلْقَوْلُ فِىٓ أُمَمٍ قَدْ خَلَتْ مِن قَبْلِهِم مِّنَ ٱلْجِنِّ وَٱلْإِنسِ إِنَّهُمْ كَانُوا۟ خَٰسِرِينَ",
    "translation_en": "And We appointed for them companions who made attractive to them what was before them and what was behind them [of sin], and the word has come into effect upon them among nations which had passed on before them of jinn and men. Indeed, they [all] were losers.",
    "translation_id": "Dan Kami tetapkan bagi mereka teman-teman yang menjadikan mereka memandang bagus apa yang ada di hadapan dan di belakang mereka dan tetaplah atas mereka keputusan azab pada umat-umat yang terdahulu sebelum mereka dari jinn dan manusia, sesungguhnya mereka adalah orang-orang yang merugi."
  }, {
    "number": 26,
    "text": "وَقَالَ ٱلَّذِينَ كَفَرُوا۟ لَا تَسْمَعُوا۟ لِهَٰذَا ٱلْقُرْءَانِ وَٱلْغَوْا۟ فِيهِ لَعَلَّكُمْ تَغْلِبُونَ",
    "translation_en": "And those who disbelieve say, \"Do not listen to this Qur'an and speak noisily during [the recitation of] it that perhaps you will overcome.\"",
    "translation_id": "Dan orang-orang yang kafir berkata: \"Janganlah kamu mendengar dengan sungguh-sungguh akan Al Quran ini dan buatlah hiruk-pikuk terhadapnya, supaya kamu dapat mengalahkan mereka\"."
  }, {
    "number": 27,
    "text": "فَلَنُذِيقَنَّ ٱلَّذِينَ كَفَرُوا۟ عَذَابًا شَدِيدًا وَلَنَجْزِيَنَّهُمْ أَسْوَأَ ٱلَّذِى كَانُوا۟ يَعْمَلُونَ",
    "translation_en": "But We will surely cause those who disbelieve to taste a severe punishment, and We will surely recompense them for the worst of what they had been doing.",
    "translation_id": "Maka sesungguhnya Kami akan merasakan azab yang keras kepada orang-orang kafir dan Kami akan memberi balasan kepada mereka dengan seburuk-buruk pembalasan bagi apa yang telah mereka kerjakan."
  }, {
    "number": 28,
    "text": "ذَٰلِكَ جَزَآءُ أَعْدَآءِ ٱللَّهِ ٱلنَّارُ لَهُمْ فِيهَا دَارُ ٱلْخُلْدِ جَزَآءًۢ بِمَا كَانُوا۟ بِـَٔايَٰتِنَا يَجْحَدُونَ",
    "translation_en": "That is the recompense of the enemies of Allah - the Fire. For them therein is the home of eternity as recompense for what they, of Our verses, were rejecting.",
    "translation_id": "Demikianlah balasan terhadap musuh-musuh Allah, (yaitu) neraka; mereka mendapat tempat tinggal yang kekal di dalamnya sebagai balasan atas keingkaran mereka terhadap ayat-ayat Kami."
  }, {
    "number": 29,
    "text": "وَقَالَ ٱلَّذِينَ كَفَرُوا۟ رَبَّنَآ أَرِنَا ٱلَّذَيْنِ أَضَلَّانَا مِنَ ٱلْجِنِّ وَٱلْإِنسِ نَجْعَلْهُمَا تَحْتَ أَقْدَامِنَا لِيَكُونَا مِنَ ٱلْأَسْفَلِينَ",
    "translation_en": "And those who disbelieved will [then] say, \"Our Lord, show us those who misled us of the jinn and men [so] we may put them under our feet that they will be among the lowest.\"",
    "translation_id": "Dan orang-orang kafir berkata: \"Ya Rabb kami perlihatkanlah kepada kami dua jenis orang yang telah menyesatkan kami (yaitu) sebagian dari jinn dan manusia agar kami letakkan keduanya di bawah telapak kaki kami supaya kedua jenis itu menjadi orang-orang yang hina\"."
  }, {
    "number": 30,
    "text": "إِنَّ ٱلَّذِينَ قَالُوا۟ رَبُّنَا ٱللَّهُ ثُمَّ ٱسْتَقَٰمُوا۟ تَتَنَزَّلُ عَلَيْهِمُ ٱلْمَلَٰٓئِكَةُ أَلَّا تَخَافُوا۟ وَلَا تَحْزَنُوا۟ وَأَبْشِرُوا۟ بِٱلْجَنَّةِ ٱلَّتِى كُنتُمْ تُوعَدُونَ",
    "translation_en": "Indeed, those who have said, \"Our Lord is Allah \" and then remained on a right course - the angels will descend upon them, [saying], \"Do not fear and do not grieve but receive good tidings of Paradise, which you were promised.",
    "translation_id": "Sesungguhnya orang-orang yang mengatakan: \"Tuhan kami ialah Allah\" kemudian mereka meneguhkan pendirian mereka, maka malaikat akan turun kepada mereka dengan mengatakan: \"Janganlah kamu takut dan janganlah merasa sedih; dan gembirakanlah mereka dengan jannah yang telah dijanjikan Allah kepadamu\"."
  }, {
    "number": 31,
    "text": "نَحْنُ أَوْلِيَآؤُكُمْ فِى ٱلْحَيَوٰةِ ٱلدُّنْيَا وَفِى ٱلْءَاخِرَةِ وَلَكُمْ فِيهَا مَا تَشْتَهِىٓ أَنفُسُكُمْ وَلَكُمْ فِيهَا مَا تَدَّعُونَ",
    "translation_en": "We [angels] were your allies in worldly life and [are so] in the Hereafter. And you will have therein whatever your souls desire, and you will have therein whatever you request [or wish]",
    "translation_id": "Kamilah pelindung-pelindungmu dalam kehidupan dunia dan akhirat; di dalamnya kamu memperoleh apa yang kamu inginkan dan memperoleh (pula) di dalamnya apa yang kamu minta."
  }, {
    "number": 32,
    "text": "نُزُلًا مِّنْ غَفُورٍ رَّحِيمٍ",
    "translation_en": "As accommodation from a [Lord who is] Forgiving and Merciful.\"",
    "translation_id": "Sebagai hidangan (bagimu) dari Tuhan Yang Maha Pengampun lagi Maha Penyayang."
  }, {
    "number": 33,
    "text": "وَمَنْ أَحْسَنُ قَوْلًا مِّمَّن دَعَآ إِلَى ٱللَّهِ وَعَمِلَ صَٰلِحًا وَقَالَ إِنَّنِى مِنَ ٱلْمُسْلِمِينَ",
    "translation_en": "And who is better in speech than one who invites to Allah and does righteousness and says, \"Indeed, I am of the Muslims.\"",
    "translation_id": "Siapakah yang lebih baik perkataannya daripada orang yang menyeru kepada Allah, mengerjakan amal yang saleh, dan berkata: \"Sesungguhnya aku termasuk orang-orang yang menyerah diri?\""
  }, {
    "number": 34,
    "text": "وَلَا تَسْتَوِى ٱلْحَسَنَةُ وَلَا ٱلسَّيِّئَةُ ٱدْفَعْ بِٱلَّتِى هِىَ أَحْسَنُ فَإِذَا ٱلَّذِى بَيْنَكَ وَبَيْنَهُۥ عَدَٰوَةٌ كَأَنَّهُۥ وَلِىٌّ حَمِيمٌ",
    "translation_en": "And not equal are the good deed and the bad. Repel [evil] by that [deed] which is better; and thereupon the one whom between you and him is enmity [will become] as though he was a devoted friend.",
    "translation_id": "Dan tidaklah sama kebaikan dan kejahatan. Tolaklah (kejahatan itu) dengan cara yang lebih baik, maka tiba-tiba orang yang antaramu dan antara dia ada permusuhan seolah-olah telah menjadi teman yang sangat setia."
  }, {
    "number": 35,
    "text": "وَمَا يُلَقَّىٰهَآ إِلَّا ٱلَّذِينَ صَبَرُوا۟ وَمَا يُلَقَّىٰهَآ إِلَّا ذُو حَظٍّ عَظِيمٍ",
    "translation_en": "But none is granted it except those who are patient, and none is granted it except one having a great portion [of good].",
    "translation_id": "Sifat-sifat yang baik itu tidak dianugerahkan melainkan kepada orang-orang yang sabar dan tidak dianugerahkan melainkan kepada orang-orang yang mempunyai keuntungan yang besar."
  }, {
    "number": 36,
    "text": "وَإِمَّا يَنزَغَنَّكَ مِنَ ٱلشَّيْطَٰنِ نَزْغٌ فَٱسْتَعِذْ بِٱللَّهِ إِنَّهُۥ هُوَ ٱلسَّمِيعُ ٱلْعَلِيمُ",
    "translation_en": "And if there comes to you from Satan an evil suggestion, then seek refuge in Allah. Indeed, He is the Hearing, the Knowing.",
    "translation_id": "Dan jika syetan mengganggumu dengan suatu gangguan, maka mohonlah perlindungan kepada Allah. Sesungguhnya Dialah yang Maha Mendengar lagi Maha Mengetahui."
  }, {
    "number": 37,
    "text": "وَمِنْ ءَايَٰتِهِ ٱلَّيْلُ وَٱلنَّهَارُ وَٱلشَّمْسُ وَٱلْقَمَرُ لَا تَسْجُدُوا۟ لِلشَّمْسِ وَلَا لِلْقَمَرِ وَٱسْجُدُوا۟ لِلَّهِ ٱلَّذِى خَلَقَهُنَّ إِن كُنتُمْ إِيَّاهُ تَعْبُدُونَ",
    "translation_en": "And of His signs are the night and day and the sun and moon. Do not prostrate to the sun or to the moon, but prostate to Allah, who created them, if it should be Him that you worship.",
    "translation_id": "Dan di antara tanda-tanda kekuasaan-Nya ialah malam, siang, matahari dan bulan. Janganlah sembah matahari maupun bulan, tapi sembahlah Allah Yang menciptakannya, Jika Ialah yang kamu hendak sembah."
  }, {
    "number": 38,
    "text": "فَإِنِ ٱسْتَكْبَرُوا۟ فَٱلَّذِينَ عِندَ رَبِّكَ يُسَبِّحُونَ لَهُۥ بِٱلَّيْلِ وَٱلنَّهَارِ وَهُمْ لَا يَسْـَٔمُونَ",
    "translation_en": "But if they are arrogant - then those who are near your Lord exalt Him by night and by day, and they do not become weary.",
    "translation_id": "Jika mereka menyombongkan diri, maka mereka (malaikat) yang di sisi Tuhanmu bertasbih kepada-Nya di malam dan siang hari, sedang mereka tidak jemu-jemu."
  }, {
    "number": 39,
    "text": "وَمِنْ ءَايَٰتِهِۦٓ أَنَّكَ تَرَى ٱلْأَرْضَ خَٰشِعَةً فَإِذَآ أَنزَلْنَا عَلَيْهَا ٱلْمَآءَ ٱهْتَزَّتْ وَرَبَتْ إِنَّ ٱلَّذِىٓ أَحْيَاهَا لَمُحْىِ ٱلْمَوْتَىٰٓ إِنَّهُۥ عَلَىٰ كُلِّ شَىْءٍ قَدِيرٌ",
    "translation_en": "And of His signs is that you see the earth stilled, but when We send down upon it rain, it quivers and grows. Indeed, He who has given it life is the Giver of Life to the dead. Indeed, He is over all things competent.",
    "translation_id": "Dan di antara tanda-tanda-Nya (Ialah) bahwa kau lihat bumi kering dan gersang, maka apabila Kami turunkan air di atasnya, niscaya ia bergerak dan subur. Sesungguhnya Tuhan Yang menghidupkannya, Pastilah dapat menghidupkan yang mati. Sesungguhnya Dia Maha Kuasa atas segala sesuatu."
  }, {
    "number": 40,
    "text": "إِنَّ ٱلَّذِينَ يُلْحِدُونَ فِىٓ ءَايَٰتِنَا لَا يَخْفَوْنَ عَلَيْنَآ أَفَمَن يُلْقَىٰ فِى ٱلنَّارِ خَيْرٌ أَم مَّن يَأْتِىٓ ءَامِنًا يَوْمَ ٱلْقِيَٰمَةِ ٱعْمَلُوا۟ مَا شِئْتُمْ إِنَّهُۥ بِمَا تَعْمَلُونَ بَصِيرٌ",
    "translation_en": "Indeed, those who inject deviation into Our verses are not concealed from Us. So, is he who is cast into the Fire better or he who comes secure on the Day of Resurrection? Do whatever you will; indeed, He is Seeing of what you do.",
    "translation_id": "Sesungguhnya orang-orang yang mengingkari ayat-ayat Kami, mereka tidak tersembunyi dari Kami. Maka apakah orang-orang yang dilemparkan ke dalam neraka lebih baik, ataukah orang-orang yang datang dengan aman sentosa pada hari Kiamat? Perbuatlah apa yang kamu kehendaki; Sesungguhnya Dia Maha Melihat apa yang kamu kerjakan."
  }, {
    "number": 41,
    "text": "إِنَّ ٱلَّذِينَ كَفَرُوا۟ بِٱلذِّكْرِ لَمَّا جَآءَهُمْ وَإِنَّهُۥ لَكِتَٰبٌ عَزِيزٌ",
    "translation_en": "Indeed, those who disbelieve in the message after it has come to them... And indeed, it is a mighty Book.",
    "translation_id": "Sesungguhnya orang-orang yang mengingkari Al Quran ketika Al Quran itu datang kepada mereka, (mereka itu pasti akan celaka), dan sesungguhnya Al Quran itu adalah kitab yang mulia."
  }, {
    "number": 42,
    "text": "لَّا يَأْتِيهِ ٱلْبَٰطِلُ مِنۢ بَيْنِ يَدَيْهِ وَلَا مِنْ خَلْفِهِۦ تَنزِيلٌ مِّنْ حَكِيمٍ حَمِيدٍ",
    "translation_en": "Falsehood cannot approach it from before it or from behind it; [it is] a revelation from a [Lord who is] Wise and Praiseworthy.",
    "translation_id": "Yang tidak datang kepadanya (Al Quran) kebatilan baik dari depan maupun dari belakangnya, yang diturunkan dari Rabb Yang Maha Bijaksana lagi Maha Terpuji."
  }, {
    "number": 43,
    "text": "مَّا يُقَالُ لَكَ إِلَّا مَا قَدْ قِيلَ لِلرُّسُلِ مِن قَبْلِكَ إِنَّ رَبَّكَ لَذُو مَغْفِرَةٍ وَذُو عِقَابٍ أَلِيمٍ",
    "translation_en": "Nothing is said to you, [O Muhammad], except what was already said to the messengers before you. Indeed, your Lord is a possessor of forgiveness and a possessor of painful penalty.",
    "translation_id": "Tidaklah ada yang dikatakan (oleh orang-orang kafir) kepadamu itu selain apa yang sesungguhnya telah dikatakan kepada rasul-rasul sebelum kamu. Sesungguhnya Rabb-mu benar-benar mempunyai ampunan dan hukuman yang pedih."
  }, {
    "number": 44,
    "text": "وَلَوْ جَعَلْنَٰهُ قُرْءَانًا أَعْجَمِيًّا لَّقَالُوا۟ لَوْلَا فُصِّلَتْ ءَايَٰتُهُۥٓ ءَا۬عْجَمِىٌّ وَعَرَبِىٌّ قُلْ هُوَ لِلَّذِينَ ءَامَنُوا۟ هُدًى وَشِفَآءٌ وَٱلَّذِينَ لَا يُؤْمِنُونَ فِىٓ ءَاذَانِهِمْ وَقْرٌ وَهُوَ عَلَيْهِمْ عَمًى أُو۟لَٰٓئِكَ يُنَادَوْنَ مِن مَّكَانٍۭ بَعِيدٍ",
    "translation_en": "And if We had made it a non-Arabic Qur'an, they would have said, \"Why are its verses not explained in detail [in our language]? Is it a foreign [recitation] and an Arab [messenger]?\" Say, \"It is, for those who believe, a guidance and cure.\" And those who do not believe - in their ears is deafness, and it is upon them blindness. Those are being called from a distant place.",
    "translation_id": "Dan jikalau Kami jadikan Al Quran itu suatu bacaan dalam bahasa selain Arab, tentulah mereka mengatakan: \"Mengapa tidak dijelaskan ayat-ayatnya?\" Apakah (patut Al Quran) dalam bahasa asing sedang (rasul adalah orang) Arab? Katakanlah: \"Al Quran itu adalah petunjuk dan penawar bagi orang-orang mukmin. Dan orang-orang yang tidak beriman pada telinga mereka ada sumbatan, sedang Al Quran itu suatu kegelapan bagi mereka. Mereka itu adalah (seperti) yang dipanggil dari tempat yang jauh\"."
  }, {
    "number": 45,
    "text": "وَلَقَدْ ءَاتَيْنَا مُوسَى ٱلْكِتَٰبَ فَٱخْتُلِفَ فِيهِ وَلَوْلَا كَلِمَةٌ سَبَقَتْ مِن رَّبِّكَ لَقُضِىَ بَيْنَهُمْ وَإِنَّهُمْ لَفِى شَكٍّ مِّنْهُ مُرِيبٍ",
    "translation_en": "And We had already given Moses the Scripture, but it came under disagreement. And if not for a word that preceded from your Lord, it would have been concluded between them. And indeed they are, concerning the Qur'an, in disquieting doubt.",
    "translation_id": "Dan sesungguhnya telah Kami berikan kepada Musa Taurat lalu diperselisihkan tentang Taurat itu. Kalau tidak ada keputusan yang telah terdahulu dari Rabb-mu, tentulah orang-orang kafir itu sudah dibinasakan. Dan Sesungguhnya mereka terhadap Al Quran benar-benar dalam keragu-raguan yang membingungkan."
  }, {
    "number": 46,
    "text": "مَّنْ عَمِلَ صَٰلِحًا فَلِنَفْسِهِۦ وَمَنْ أَسَآءَ فَعَلَيْهَا وَمَا رَبُّكَ بِظَلَّٰمٍ لِّلْعَبِيدِ",
    "translation_en": "Whoever does righteousness - it is for his [own] soul; and whoever does evil [does so] against it. And your Lord is not ever unjust to [His] servants.",
    "translation_id": "Barangsiapa yang mengerjakan amal yang saleh maka (pahalanya) untuk dirinya sendiri dan barangsiapa mengerjakan perbuatan jahat, maka (dosanya) untuk dirinya sendiri; dan sekali-kali tidaklah Rabb-mu menganiaya hamba-hamba-Nya."
  }, {
    "number": 47,
    "text": "إِلَيْهِ يُرَدُّ عِلْمُ ٱلسَّاعَةِ وَمَا تَخْرُجُ مِن ثَمَرَٰتٍ مِّنْ أَكْمَامِهَا وَمَا تَحْمِلُ مِنْ أُنثَىٰ وَلَا تَضَعُ إِلَّا بِعِلْمِهِۦ وَيَوْمَ يُنَادِيهِمْ أَيْنَ شُرَكَآءِى قَالُوٓا۟ ءَاذَنَّٰكَ مَا مِنَّا مِن شَهِيدٍ",
    "translation_en": "To him [alone] is attributed knowledge of the Hour. And fruits emerge not from their coverings nor does a female conceive or give birth except with His knowledge. And the Day He will call to them, \"Where are My 'partners'?\" they will say, \"We announce to You that there is [no longer] among us any witness [to that].\"",
    "translation_id": "Kepada-Nya-lah dikembalikan pengetahuan tentang hari Kiamat. Dan tidak ada buah-buahan keluar dari kelopaknya dan tidak seorang perempuanpun mengandung dan tidak (pula) melahirkan, melainkan dengan sepengetahuan-Nya. Pada hari Tuhan memanggil mereka: \"Dimanakah sekutu-sekutu-Ku itu?\", mereka menjawab: \"Kami nyatakan kepada Engkau bahwa tidak ada seorangpun di antara kami yang memberi kesaksian (bahwa Engkau punya sekutu)\"."
  }, {
    "number": 48,
    "text": "وَضَلَّ عَنْهُم مَّا كَانُوا۟ يَدْعُونَ مِن قَبْلُ وَظَنُّوا۟ مَا لَهُم مِّن مَّحِيصٍ",
    "translation_en": "And lost from them will be those they were invoking before, and they will be certain that they have no place of escape.",
    "translation_id": "Dan hilang lenyaplah dari mereka apa yang selalu mereka sembah dahulu, dan mereka yakin bahwa tidak ada bagi mereka satu jalan keluarpun."
  }, {
    "number": 49,
    "text": "لَّا يَسْـَٔمُ ٱلْإِنسَٰنُ مِن دُعَآءِ ٱلْخَيْرِ وَإِن مَّسَّهُ ٱلشَّرُّ فَيَـُٔوسٌ قَنُوطٌ",
    "translation_en": "Man is not weary of supplication for good [things], but if evil touches him, he is hopeless and despairing.",
    "translation_id": "Manusia tidak jemu memohon kebaikan, dan jika mereka ditimpa malapetaka dia menjadi putus asa lagi putus harapan."
  }, {
    "number": 50,
    "text": "وَلَئِنْ أَذَقْنَٰهُ رَحْمَةً مِّنَّا مِنۢ بَعْدِ ضَرَّآءَ مَسَّتْهُ لَيَقُولَنَّ هَٰذَا لِى وَمَآ أَظُنُّ ٱلسَّاعَةَ قَآئِمَةً وَلَئِن رُّجِعْتُ إِلَىٰ رَبِّىٓ إِنَّ لِى عِندَهُۥ لَلْحُسْنَىٰ فَلَنُنَبِّئَنَّ ٱلَّذِينَ كَفَرُوا۟ بِمَا عَمِلُوا۟ وَلَنُذِيقَنَّهُم مِّنْ عَذَابٍ غَلِيظٍ",
    "translation_en": "And if We let him taste mercy from Us after an adversity which has touched him, he will surely say, \"This is [due] to me, and I do not think the Hour will occur; and [even] if I should be returned to my Lord, indeed, for me there will be with Him the best.\" But We will surely inform those who disbelieved about what they did, and We will surely make them taste a massive punishment.",
    "translation_id": "Dan jika Kami merasakan kepadanya sesuatu rahmat dari Kami sesudah dia ditimpa kesusahan, pastilah dia berkata: \"Ini adalah hakku, dan aku tidak yakin bahwa hari Kiamat itu akan datang. Dan jika aku dikembalikan kepada Tuhanku maka sesungguhnya aku akan memperoleh kebaikan pada sisi-Nya\". Maka Kami benar-benar akan memberitakan kepada orang-orang kafir apa yang telah mereka kerjakan dan akan Kami rasakan kepada mereka azab yang keras."
  }, {
    "number": 51,
    "text": "وَإِذَآ أَنْعَمْنَا عَلَى ٱلْإِنسَٰنِ أَعْرَضَ وَنَـَٔا بِجَانِبِهِۦ وَإِذَا مَسَّهُ ٱلشَّرُّ فَذُو دُعَآءٍ عَرِيضٍ",
    "translation_en": "And when We bestow favor upon man, he turns away and distances himself; but when evil touches him, then he is full of extensive supplication.",
    "translation_id": "Dan apabila Kami memberikan nikmat kepada manusia, ia berpaling dan menjauhkan diri; tetapi apabila ia ditimpa malapetaka, maka ia banyak berdoa."
  }, {
    "number": 52,
    "text": "قُلْ أَرَءَيْتُمْ إِن كَانَ مِنْ عِندِ ٱللَّهِ ثُمَّ كَفَرْتُم بِهِۦ مَنْ أَضَلُّ مِمَّنْ هُوَ فِى شِقَاقٍۭ بَعِيدٍ",
    "translation_en": "Say, \"Have you considered: if the Qur'an is from Allah and you disbelieved in it, who would be more astray than one who is in extreme dissension?\"",
    "translation_id": "Katakanlah: \"Bagaimana pendapatmu jika (Al Quran) itu datang dari sisi Allah, kemudian kamu mengingkarinya. Siapakah yang lebih sesat daripada orang yang selalu berada dalam penyimpangan yang jauh?\""
  }, {
    "number": 53,
    "text": "سَنُرِيهِمْ ءَايَٰتِنَا فِى ٱلْءَافَاقِ وَفِىٓ أَنفُسِهِمْ حَتَّىٰ يَتَبَيَّنَ لَهُمْ أَنَّهُ ٱلْحَقُّ أَوَلَمْ يَكْفِ بِرَبِّكَ أَنَّهُۥ عَلَىٰ كُلِّ شَىْءٍ شَهِيدٌ",
    "translation_en": "We will show them Our signs in the horizons and within themselves until it becomes clear to them that it is the truth. But is it not sufficient concerning your Lord that He is, over all things, a Witness?",
    "translation_id": "Kami akan memperlihatkan kepada mereka tanda-tanda (kekuasaan) Kami di segala wilayah bumi dan pada diri mereka sendiri, hingga jelas bagi mereka bahwa Al Quran itu adalah benar. Tiadakah cukup bahwa sesungguhnya Tuhanmu menjadi saksi atas segala sesuatu?"
  }, {
    "number": 54,
    "text": "أَلَآ إِنَّهُمْ فِى مِرْيَةٍ مِّن لِّقَآءِ رَبِّهِمْ أَلَآ إِنَّهُۥ بِكُلِّ شَىْءٍ مُّحِيطٌۢ",
    "translation_en": "Unquestionably, they are in doubt about the meeting with their Lord. Unquestionably He is, of all things, encompassing.",
    "translation_id": "Ingatlah bahwa sesungguhnya mereka adalah dalam keraguan tentang pertemuan dengan Tuhan mereka. Ingatlah bahwa sesungguhnya Dia Maha Meliputi segala sesuatu."
  }],
  "tafsir": {
    "id": {
      "kemenag": {
        "name": "Kemenag",
        "source": "Aplikasi Quran Kementrian Agama Republik Indonesia",
        "text": {
          "1": "Penjelasan tentang arti \"ha Mim\" dapat dilihat pada Al-Qur'an dan Tafsirnya jilid I, tentang keterangan arti dari fawatih as-suwar.",
          "2": "Ayat ini menerangkan bahwa Al-Qur'an berasal dari Allah Yang Maha Pemurah lagi Maha Penyayang, diturunkan kepada rasul-Nya, Muhammad saw, dengan perantaraan Malaikat Jibril.\n\nPada ayat ini dikatakan bahwa Al-Qur'an itu berasal dari Allah Yang Maha Pemurah lagi Maha Penyayang. Pernyataan ini mengandung maksud bahwa Al-Qur'an ini diturunkan kepada manusia sebagai tanda bahwa Allah Maha Pemurah dan Maha Pengasih kepada hamba-hamba-Nya. Al-Qur'an bagi manusia dapat diibaratkan sebagai obat bagi orang yang sakit guna menyembuhkan penyakitnya. Manusia sangat menginginkan kebahagiaan hidup di dunia dan akhirat. Mereka tidak mengetahui jalan yang harus ditempuh untuk mencapai keinginannya itu. Karena sifat Maha Pemurah dan Maha Penyayang kepada hamba-hamba-Nya itu, Allah menurunkan petunjuk ke jalan yang dimaksud sehingga manusia mencapai keinginannya itu. Petunjuk-petunjuk itu terdapat di dalam Al-Qur'an yang diturunkan-Nya kepada Nabi Muhammad.\n\nAllah berfirman:\n\nDan Kami tidak mengutus engkau (Muhammad) melainkan untuk (menjadi) rahmat bagi seluruh alam. (al-Anbiya'/21: 107)\n\nMaksud pernyataan bahwa Nabi Muhammad saw diutus ke dunia merupakan rahmat bagi semesta alam ialah Allah mengutusnya untuk menyampaikan agama Allah kepada manusia. Agama Allah itu merupakan rahmat bagi manusia, dan pokok-pokok agama Allah itu terdapat di dalam Al-Qur'an. Jadi yang menjadi rahmat utama itu ialah Al-Qur'an.\n\nFirman Allah:\n\nDan sungguh, (Al-Qur'an) ini benar-benar diturunkan oleh Tuhan seluruh alam, yang dibawa turun oleh Ar-Ruh Al-Amin (Jibril), ke dalam hatimu (Muhammad) agar engkau termasuk orang yang memberi peringatan, dengan bahasa Arab yang jelas. Dan sungguh, (Al-Qur'an) itu (disebut) dalam kitab-kitab orang yang terdahulu. (asy-Syu'ara'/26: 192-197)",
          "3": "Al-Qur'an yang diturunkan kepada Nabi Muhammad terdiri atas ayat-ayat. Ayat-ayat itu diterangkan satu per satu dengan jelas. Setiap ayat dipisahkan dengan ayat-ayat yang lain, dengan tanda-tanda yang jelas pula. Ada permulaan dan akhir dari tiap-tiap surah. Isinya bermacam-macam petunjuk, ada yang berhubungan dengan pelajaran, nasihat, akhlak yang mulia, mensucikan jiwa, kisah-kisah rasul yang terdahulu dengan umat-umatnya, petunjuk ke jalan kebahagiaan hidup di dunia dan akhirat, dan sebagainya.\n\nAllah berfirman:\n\n(Inilah) Kitab yang ayat-ayatnya disusun dengan rapi kemudian dijelaskan secara terperinci, (yang diturunkan) dari sisi (Allah) Yang Mahabijaksana, Mahateliti. (Hud/11: 1)\n\nDiterangkan pula bahwa Al-Qur'an diturunkan berbahasa Arab, bahasa ibu dari rasul yang menyampaikannya dan sesuai pula dengan bahasa yang digunakan oleh bangsa yang pertama kali menerimanya. Dengan demikian, Al-Qur'an itu mudah dipahami kandungan dan maksudnya oleh mereka dan dengan mudah pula mereka menyampaikan kepada bangsa-bangsa lain di seluruh dunia, yang mempunyai bahasa ibu bukan bahasa Arab.\n\nAllah berfirman:\n\nDan Kami tidak mengutus seorang rasul pun, melainkan dengan bahasa kaumnya, agar dia dapat memberi penjelasan kepada mereka. (Ibrahim/14: 4)\n\nPada akhir ayat ini diterangkan bahwa Al-Qur'an itu berfaedah bagi yang mengetahui dan memahaminya. Maksudnya ialah bahwa Al-Qur'an itu akan berfaedah bagi orang-orang yang berpengetahuan, ingin mencari kebenaran yang hakiki, dan ingin memperoleh petunjuk yang benar yang dapat menghantarkan kepada kebahagiaan dunia dan akhirat. Mereka mempelajari Al-Qur'an, membandingkannya dengan ajaran-ajaran yang lain serta menyerap ajarannya dengan pengetahuan yang telah ada pada diri mereka. Mereka itu yang dapat memahami dan menyelami rahasia dan petunjuk Al-Qur'an.\n\nDari pengertian ini dapat dipahami bahwa orang-orang yang ada penyakit dalam hatinya tidak ingin mencari kebenaran, karena mereka telah terikat oleh agama atau kepercayaan yang telah mereka anut sebelumnya. Demikian juga dengan orang yang memperturutkan hawa nafsu, fanatik terhadap golongan, atau mengutamakan pangkat dan kedudukan, tidak akan dapat menyelami dan memahami isi Al-Qur'an, apalagi mendapat petunjuk darinya.\n\nSebagian ahli tafsir ada yang menafsirkan ayat ini dengan mengatakan bahwa Al-Qur'an akan dipahami oleh orang-orang yang mengetahui bahasa Arab, karena bahasa Arab itu adalah bahasa yang paling luas, lengkap, dan dalam maknanya, serta mudah memengaruhi jiwa. Waktu itu orang-orang Arab mengetahui bahasa dengan baik, banyak di antara mereka menjadi ahli bahasa, sastrawan yang terkenal, dan banyak pula yang menjadi penyair. Bahasa Arab Al-Qur'an adalah bahasa Arab yang sangat tinggi nilainya, baik gaya bahasanya maupun gramatikanya. Oleh karena itu, orang yang dapat memahami ayat-ayatnya hanyalah orang yang memiliki pengetahuan bahasa Arab yang mendalam.",
          "4": "Ayat ini menerangkan bahwa Al-Qur'an membawa berita gembira bagi orang-orang yang mengamalkan petunjuk-Nya. Ia juga membawa berita yang menakutkan bagi orang-orang yang mengingkarinya. Orang yang mengikuti petunjuknya akan memperoleh kenikmatan hidup di dunia dan akan dimasukkan ke dalam surga yang penuh kenikmatan di akhirat. Sedangkan orang yang mengingkarinya dan mendustakan ayat-ayatnya akan memperoleh kesengsaraan yang tidak terhingga di akhirat nanti.\n\nSekalipun demikian tujuan dan isi Al-Qur'an, namun orang-orang musyrik tetap tidak mengacuhkannya, bahkan mereka menyombongkan diri, tidak mau mendengarkan, apalagi mengikuti petunjuk-petunjuknya.",
          "5": "Pada ayat ini disebutkan penyebab orang-orang musyrik mengingkari dan mendustakan ayat-ayat Al-Qur'an, yaitu:\n\n1. Mereka menyatakan bahwa hati mereka telah tertutup, tidak dapat dimasuki oleh seruan kepada iman, melaksanakan petunjuk-petunjuk Al-Qur'an, dan yang disampaikan Muhammad saw.\n\n2. Mereka menyatakan bahwa telinga-telinga mereka telah tersumbat sehingga tidak dapat mendengar seruan Muhammad saw dan ayat-ayat Al-Qur'an yang dibacakan kepadanya.\n\n3. Mereka mengatakan bahwa antara mereka dan kaum Muslimin ada dinding pemisah yang menghalangi mereka menerima seruan itu.\n\nSebagian ahli tafsir berpendapat bahwa yang diterangkan ayat ini merupakan gambaran keadaan orang-orang musyrik yang jiwa dan hati mereka tidak dapat lagi memahami seruan Rasulullah saw dan tidak mau mengikuti petunjuk Al-Qur'an. Hati mereka diserupakan dengan benda yang terletak dalam suatu tempat yang tertutup, telinga mereka diserupakan dengan telinga orang tuli yang tidak dapat mendengar sesuatu pun, dan keadaan mereka diserupakan dengan orang yang berdiri di samping dinding tebal dan tinggi, sehingga tidak mengetahui apa yang terjadi di balik dinding itu.\n\nKarena seruan tidak berfaedah sedikit pun bagi orang-orang musyrik, mereka disuruh melakukan segala yang mereka inginkan, termasuk usaha tipu daya, menyiksa dan menyakiti orang-orang yang beriman, menjauhkan manusia dari Muhammad, dan menghancurkan Islam dan kaum Muslimin. Akan tetapi, Allah pun akan menjaga kaum Muslimin dari tindakan mereka.",
          "6": "Mendengar alasan-alasan yang dikemukakan orang-orang musyrik pada ayat-ayat yang lalu, Allah memerintahkan kepada Rasulullah menjawab ucapan mereka dengan mengatakan bahwa nabi adalah manusia biasa yang tidak ada perbedaan dengan mereka, hanya saja beliau mendapat wahyu bahwa Tuhan yang berhak disembah adalah Tuhan Yang Maha Esa. Oleh karena itu, mereka diperintahkan untuk beribadah hanya kepada-Nya, dilarang menyekutukan-Nya, dan memohon ampun atas dosa-dosa yang telah mereka lakukan.\n\nPada akhir ayat ini Allah menegaskan bahwa kerugian dan kesengsaraan yang besar akan dialami oleh orang-orang yang mempersekutukan Tuhan. Mereka akan kekal di dalam neraka di akhirat nanti.",
          "7": "Yang dimaksud dengan orang-orang yang mempersekutukan Allah pada ayat di atas ialah orang-orang yang tidak menunaikan zakat dan orang-orang yang mengingkari adanya hari akhir.\n\nZakat diwajibkan pada periode Medinah dan ayat ini termasuk Makkiyyah (ayat-ayat yang diturunkan sebelum hijrah ke Medinah). Oleh karena itu, yang dimaksud dengan zakat ialah mensucikan jiwa dari kesyirikan dan kekikiran.\n\nIbnu 'Abbas menerangkan pengertian la yu'tuna az-zakah (tidak menunaikan zakat) adalah tidak bersaksi bahwa tidak ada tuhan selain Allah. Itulah zakat al-anfus (penyucian jiwa) karena surah ini termasuk surah Makkiyyah dan zakat diwajibkan di Medinah. Sebagian mufasir berpendapat bahwa orang kafir Mekah senang berinfak dan memberi minum dan makan jamaah haji. Namun mereka tidak memberikannya kepada Nabi Muhammad dan orang-orang yang beriman. Maka turunlah ayat ini.",
          "8": "Pada ayat ini diterangkan janji Allah kepada orang-orang yang beriman. Semua orang yang beriman kepada Allah dan rasul-Nya, mengerjakan perintah-perintah Allah, dan menjauhi larangan-larangan-Nya akan memperoleh balasan yang paling baik dan tidak terputus dari Allah. Itulah pembalasan yang paling baik, yaitu pembalasan yang diberikan kepada orang-orang yang beramal saleh.\n\nMenurut as-Suddi ayat ini diturunkan berhubungan dengan orang sakit yang tidak dapat lagi diharapkan kesembuhannya, orang yang telah sangat tua, sehingga ia tidak dapat lagi beramal seperti ia beramal di waktu masih muda, tetapi mereka masih mempunyai semangat yang tinggi dan ingin beramal seperti yang pernah dilakukannya. Terhadap orang yang seperti itu, Allah memberikan pahala seperti pahala yang diberikan kepada orang yang sanggup mengerjakan amal itu.",
          "9": "Allah memerintahkan kepada Nabi Muhammad agar menanyakan kepada orang-orang musyrik Mekah kenapa mereka mengingkari Allah yang telah menciptakan bumi dalam dua hari. Kenapa mereka menyembah tuhan-tuhan yang lain di samping menyembah Allah? Padahal Allah Maha Suci dari segala sesuatu.\n\nSebagian ahli tafsir berpendapat bahwa yang dimaksud dengan menjadikan bumi pada ayat ini ialah menciptakan wujudnya, dan yang dimaksud dengan \"hari atau masa\" dalam ayat ini ialah waktu, karena hari dan malam belum ada di saat langit dan bumi diciptakan.\n\nMakna pembentukan bumi dalam waktu dua hari, dapat ditafsirkan secara ilmiah bahwa pembentukan bumi ini terjadi pada dua periode atau dua masa. Hari pertama adalah masa ketika sekitar 4,6 miliar yang lampau, awan debu dan gas yang mengapung di ruang angkasa mulai mengecil (lihat penjelasan dalam al-A.'raf/7: 54 tentang pembentukan langit dan bumi dalam enam masa). Materi pada pusat awan itu mengumpul menjadi matahari dan sisa gas dan debunya memipih berbentuk cakram di sekitar matahari. Kemudian butir-butir debu dalam awan itu saling melekat dan membentuk planetisimal yang kemudian saling bertabrakan membentuk planet, di antaranya adalah bumi. Hari kedua diawali ketika proses pemanasan akibat peluruhan radioaktif menyebabkan proto bumi meleleh, dan bahan-bahan yang berat seperti besi tenggelam ke pusat bumi sedangkan yang ringan seperti air dan karbondioksida beralih ke luar. Planet bumi kemudian mendingin dan sekitar 2,5 miliar tahun yang lampau bumi terlihat seperti apa yang kita lihat sekarang ini.\n\nPertanyaan yang disampaikan kepada orang-orang musyrik pada ayat ini, tidak bermaksud untuk bertanya, tetapi untuk mencela perbuatan mereka menyembah berhala. Seakan-akan dikatakan kepada mereka bahwa bukankah mereka telah mengetahui dengan pasti bahwa berhala-berhala yang mereka sembah itu terbuat dari batu yang tidak dapat berbuat sesuatu pun, bahkan berhala itu mereka sendiri yang membuatnya, mengapa mereka sembah yang demikian itu. Jika mereka mau menghambakan diri, maka hambakanlah kepada yang menciptakan bumi dalam dua masa dan yang menentukan segala sesuatu.\n\nTuhan yang berhak mereka sembah ialah Allah yang menciptakan, menguasai, mengatur, memelihara kelangsungan adanya, dan yang menentukan akhir kesudahan semesta alam ini, bukan berhala yang mereka sembah itu.",
          "10": "Pada ayat ini diterangkan keindahan penciptaan dan hukum-hukum yang berlaku pada bumi. Dia telah menjadikan gunung-gunung di permukaan bumi, ada yang tinggi ada yang sedang, ada yang merupakan dataran tinggi saja, ada yang berapi, dan gunung yang merupakan pasak atau paku bumi. Dengan adanya gunung, permukaan bumi menjadi indah, ada yang tinggi dan ada yang rendah. Tumbuh-tumbuhan pegunungan pun berbeda dengan tumbuh-tumbuhan yang ada di dataran rendah demikian pula binatang-binatangnya. Dengan adanya gunung-gunung, maka ada sungai-sungai yang mengalir dari dataran tinggi ke dataran rendah, dan akhirnya bermuara ke laut. Seakan-akan gunung itu merupakan tempat penyimpanan air yang terus-menerus mengalir memenuhi keperluan manusia.\n\nSelanjutnya Allah menerangkan bahwa Dia menciptakan bumi ini sebagai tempat yang penuh keberkahan bagi manusia, dan penuh dengan keindahan. Bumi juga dilengkapi dengan segala macam kebutuhan yang diperlukan manusia untuk kelangsungan hidupnya dan keperluan makhluk-makhluk lain. Sejak dari udara yang dihisap setiap saat, makanan-makanan yang diperlukan, tempat-tempat yang sejuk dan nyaman, lautan yang luas, barang tambang yang terpendam di dalam tanah dan banyak lagi nikmat yang lain yang disediakan-Nya yang tidak terhitung macam dan jumlahnya.\n\nDia pula yang telah menentukan ukuran dan kadar segala sesuatu. Mengadakan makanan yang dapat mengenyangkan sesuai dengan keadaan binatang atau manusia yang memerlukannya. Untuk manusia disediakan padi, gandum, dan sebagainya. Untuk binatang ternak disediakan-Nya rumput dan sebagainya. Betapa banyak jumlah manusia, betapa banyak ikan di laut, burung yang beterbangan, binatang-binatang yang hidup di dalam rimba, semuanya disediakan Allah rezeki dan keperluan hidupnya, sesuai dengan keadaan masing-masing.\n\nAllah menerangkan bahwa Dia menciptakan bumi dan gunung-gunung yang ada padanya dalam dua masa dan menciptakan keperluan-keperluan, makanan, dan sebagainya dalam dua masa pula. Semuanya dilakukan dalam empat masa. Dalam waktu empat masa itu, terciptalah semuanya dan dasar-dasar dari segala sesuatu yang ada di alam ini, sesuai dengan masa dan keadaan dalam perkembangan selanjutnya.\n\nTafsiran ilmiah empat hari, bisa jadi tercermin empat masa dalam kurun waktu geologi yakni: Proterozoikum, dimana kehidupan masih sangat tidak jelas; Paleozoikum di mana kehidupan mulai jelas yang ditandai antara lain oleh amfibi, reptil, ikan-ikan besar, dan tumbuhan paku; Mesozoikum, kehidupan pertengahan yang ditandai dengan berlimpahnya vegetasi dan binatang laut, antara lain hewan laut, komodo, pohon daun lebar; dan Kenozoikum, kehidupan baru, dimana ditandai oleh banyaknya kehidupan di zaman Kenozoikum yang punah. Pada masa Kenozoikum ditandai oleh munculnya gajah, dan pepohonan semakin berkembang dan paling penting adalah kemunculan manusia.",
          "11": "Pada ayat ini Allah menerangkan keadaan langit. Setelah Allah menciptakan bumi Dia menuju ke langit, waktu itu langit berupa asap. Bagaimana keadaan asap itu dan apa hakikatnya, hanya Allah sajalah yang mengetahui-Nya. Sekalipun ada yang mencoba menerangkan keadaan asap yang dimaksud, baik yang dikemukakan oleh pendeta-pendeta Yahudi, maupun oleh para ahli yang telah mencoba menyelidikinya, namun belum ada keterangan yang pasti yang menerangkan keadaan dan hakikat asap itu.\n\nMenurut teori ilmu pengetahuan, ayat di atas menggambarkan mengenai permulaan alam semesta. Peristiwa tersebut ditandai dengan terjadinya peristiwa yang oleh para ilmuwan disebut Big Bang. Peristiwa tersebut sangat jelas terlihat pada surah al-Anbiya'/21 ayat 30 yang penggalannya berbunyi demikian: \"....bahwa langit dan bumi keduanya dahulu adalah satu yang padu, kemudian Kami pisahkan...\" .\n\nIlmu kosmologi modern, baik dari pengamatan maupun teori, secara jelas mengindikasikan bahwa pada suatu saat, seluruh alam semesta terdiri hanya dari awan dari \"asap\" yang terdiri atas komposisi gas yang padat dan sangat panas. Kumpulan ini terdiri atas sejumlah besar kekuatan atom yang saling berkaitan dan berada di bawah tekanan yang sangat kuat. Jari-jari kumpulan yang berbentuk bola ini diperkirakan sekitar 5 juta kilometer. Cairan atom pertamanya berupa ledakan dahsyat (yang biasa disebut Big Bang), dan mengakibatkan terbentuk dan terpencarnya berbagai benda langit. Hal ini sudah menjadi prinsip yang teruji dan menjadi dasar dalam kosmologi modern. Dengan semakin majunya ilmu pengetahuan, para peneliti saat ini dapat menyaksikan \"kelahiran\" bintang dengan menggunakan teleskop yang sangat canggih. Teori mengenai bentukan \"asap\" sebagai asal-muasal suatu bintang, juga telah disebutkan dalam Surah Fushshilat/41: 11 di atas.\n\nKarena bumi dan langit di atasnya (matahari, bulan, bintang, planet, galaksi, dan sebagainya) terbentuk dari \"asap\" yang sama, maka para pakar menyimpulkan bahwa bumi dan isi langit seluruhnya adalah satu kesatuan sebelumnya. Dari material \"asap\" yang sama ini, kemudian mereka terpisah satu sama lain. Hal yang demikian ini juga telah diungkapkan oleh Al-Qur'an dalam Surah al-Anbiya'/21: 30 tersebut di atas. \n\nPada ayat ini, seolah-olah Allah menerangkan bahwa bumi lebih dahulu diciptakan dari langit dengan segala isinya, termasuk di dalamnya matahari, bulan, dan bintang-bintang. Ayat yang lain menerangkan bahwa Allah menciptakan langit lebih dahulu dari menciptakan bumi. Oleh karena itu, ada sebagian mufasir yang mencoba mengompromikan kedua ayat ini. Menurut mereka, dalam perencanaan, Allah lebih dahulu merencanakan bumi dengan segala isinya. Akan tetapi, dalam pelaksanaannya, Allah menciptakan langit dengan segala isinya lebih dahulu, kemudian sesudah itu baru menciptakan bumi dengan segala isinya.\n\nSetelah selesai menciptakan langit dan bumi beserta segala isinya, Allah memerintahkan keduanya untuk datang kepada-Nya, baik dalam keadaan senang maupun terpaksa. Langit dan bumi mengatakan bahwa mereka akan datang dengan tunduk dan patuh. Kemudian Allah bertitah kepada langit, \"Perhatikanlah sinar mataharimu, cahaya bulanmu, cahaya gemerlap dari binatang-bintang, hembuskanlah anginmu, edarkanlah awanmu, sehingga dapat menurunkan hujan.\" Allah berfirman pula kepada bumi, \"Alirkanlah sungai-sungaimu, serta tumbuhkanlah tanaman-tanaman dan pohon-pohonmu.\" Keduanya menjawab, \"Kami penuhi segala perintah-Mu dengan patuh dan taat.\"\n\nSebagian ahli tafsir menafsirkan \"datanglah kamu keduanya menurut perintah-Ku dengan suka atau terpaksa\" dengan \"jadilah kamu keduanya menurut Sunnah-Ku yang telah Aku tetapkan, jangan menyimpang sedikit pun dari ketentuan-Ku itu, ikutilah proses-proses kejadianmu sesuai dengan waktu yang telah ditentukan.\" Dengan kata lain dapat dipahami bahwa Allah memerintahkan kepada langit dan bumi untuk menyempurnakan kejadiannya sesuai dengan ketetapan yang telah ditentukan, seperti bumi akan tercipta pada saatnya, demikian pula gunung-gunung, air, udara, binatang-binatang, manusia, dan tumbuh-tumbuhan. Semuanya akan terjadi pada waktu yang ditentukan-Nya, tidak ada satu pun yang menyimpang dari ketentuan-Nya.\n\nDari ayat ini dapat dipahami bahwa kejadian langit dan bumi itu, mulai dari terjadinya sampai kepada bentuk yang ada sekarang, melalui proses-proses tertentu sesuai dengan sunah Allah. Segala sesuatu yang ada di bumi dan di langit akan ada pada waktunya, dan akan hilang atau musnah pada waktunya pula, sesuai dengan keadaan langit dan bumi pada waktu itu.",
          "12": "Ayat ini menerangkan bahwa Allah menyempurnakan kejadian langit itu dengan menjadikan tujuh langit dalam dua masa. Dengan demikian, lamanya Allah merencanakan penciptaan langit dan bumi ialah selama enam masa. Firman Allah:\n\nSungguh, Tuhanmu (adalah) Allah yang menciptakan langit dan bumi dalam enam masa. (al-A'raf/7: 54)\n\nDiterangkan juga bahwa Allah menghiasi langit dengan bintang-bintang yang gemerlapan. Ada bintang yang bercahaya sendiri dan ada pula yang menerima pantulan cahaya dari bintang yang lain. Oleh karena itu, cahaya bintang-bintang itu terlihat tidak sama. Ketidaksamaan cahaya bintang-bintang itu menimbulkan keindahan yang tiada taranya.\n\nAllah menjadikan pada tiap-tiap langit sesuatu yang diperlukan, sesuai dengan hikmah dan sunah-Nya. Seperti adanya memberi tarik pada tiap-tiap planet dan menjadikannya berjalan pada garis edarnya, sehingga planet-planet itu tidak akan jatuh dan berbenturan antara yang satu dengan yang lain. Untuk setiap planet itu ditetapkan tugas-tugas tertentu, sesuai dengan keadaan dan sifatnya, seperti tugas bulan tidak sama dengan tugas matahari, karena kejadian keduanya berlainan.\n\nSemua yang diterangkan itu merupakan ciptaan Allah, Tuhan Yang Mahakuasa, dan mereka harus tunduk kepada ketetapan-Nya. Tidak ada satu pun dari ciptaan Allah yang menyimpang dari ketetapan-Nya. Dia mengetahui keadaan makhluk yang diciptakan-Nya itu, baik yang halus maupun yang kasar, baik yang nyata maupun yang tersembunyi.",
          "13": "Ayat ini menerangkan perintah Allah kepada Nabi Muhammad agar menyeru kepada orang-orang kafir untuk beriman kepada Allah yang telah menciptakan langit dan bumi dan apa yang ada pada keduanya. Jika mereka tidak menerima ajakan itu dan berpaling, Rasulullah diperintahkan untuk mengingatkan mereka tentang azab yang akan ditimpakan Allah kepada setiap orang yang ingkar kepada-Nya. Di antara azab yang pernah ditimpakan kepada orang-orang yang ingkar ialah suara keras yang mengguntur dari langit dan memusnahkan semua yang dikenainya, seperti yang pernah ditimpakan kepada kaum 'Ad, kaum Samud, penduduk Aikah, dan sebagainya. Malapetaka itu menimpa mereka karena mengingkari seruan rasul yang diutus kepada mereka dan mengabaikan peringatan para rasul itu. Rasulullah menambahkan bahwa jika mereka tidak ingin ditimpa malapetaka seperti itu, maka ikutilah seruan yang disampaikannya dan agar hanya menyembah Allah, Tuhan Yang Maha Esa, tidak mempersekutukan-Nya dengan sesuatu apa pun.\n\nSeruan Rasulullah itu ditanggapi orang-orang musyrik dengan sikap angkuh dan sombong. Mereka mengingkarinya dengan mengatakan bahwa sekiranya Allah hendak mengutus para rasul kepada manusia, tentu Dia tidak akan mengutus manusia seperti Nabi Muhammad. Akan tetapi, Allah akan mengutus orang-orang yang mempunyai kelebihan dari manusia biasa, mempunyai kekuatan gaib, sanggup mengabulkan langsung segala yang diminta orang-orang yang diserunya, seperti malaikat, jin dan sebagainya. Menurut mereka, rasul yang diangkat dari manusia biasa tidak akan bisa memerkenankan permintaan orang-orang yang diserunya karena tidak mempunyai kelebihan apa pun. Sementara, menurut mereka, Allah belum berkehendak mengutus rasul itu. Itulah sebabnya mereka mengingkari kerasulan Nabi Muhammad.\n\nDiriwayatkan oleh al-Baihaqi dalam kitab \" Ad-Dalail\" dan Ibnu Asakir dari Jabir bin 'Abdullah. Ia mengatakan bahwa Abu Jahal dan para pemimpin kaum Quraisy berkata, \"Sesungguhnya kurang jelas bagi kita apa yang disampaikan oleh Muhammad itu, jika kamu menemukan seorang ahli sihir, tenung, dan syair, maka hendaklah ia berbicara dengannya, dan datang kepada kita untuk menerangkan maksud yang disampaikan Muhammad saw itu.\" 'Utbah bin Rabi'ah berkata, \"Demi Allah, aku benar-benar telah mendengar sihir, tenung, dan syair. Aku benar-benar memahami rumpun engkau hai Muhammad adalah orang yang paling baik dalam rumpun keluarga Abdul Muththalib?\" Muhammad tidak menjawab. 'Utbah berkata lagi, \"Mengapa engkau mencela tuhan-tuhan kami dan menganggap kami sesat? Jika engkau menghendaki wanita, pilihlah olehmu sepuluh wanita yang paling cantik yang kamu kehendaki dari suku Quraisy ini. Jika engkau menghendaki harta, kami kumpulkan harta itu sesuai dengan yang kamu perlukan.\" \n\nSetelah Rasulullah mendengar ucapan 'Utbah, beliau membaca Surah Fushshilat ini sejak permulaan ayat sampai kepada ayat ini, yang menerangkan malapetaka yang pernah ditimpakan kepada kaum 'Ad, dan Samud. Mendengar ayat yang dibacakan Rasulullah saw, Utbah diam seribu bahasa, lalu pulang ke rumahnya, tidak langsung kepada kaumnya. Tatkala kaumnya melihat 'Utbah dalam keadaan demikian, mereka mengatakan bahwa 'Utbah telah kena sihir Muhammad. Lalu mereka mencari 'Utbah dan berkata kepadanya, \"Ya 'Utbah, engkau tidak datang kepada kami itu adalah karena engkau telah kena sihir.\" Maka 'Utbah marah dan bersumpah tidak akan berbicara lagi dengan Muhammad, kemudian ia berkata, \"Demi Allah, aku benar-benar telah berbicara dengannya, lalu ia menjawab dengan satu jawaban yang menurut pendapatku jawaban itu bukan syair, bukan sihir, dan bukan pula tenung. Tatkala ia sampai kepada ucapan: petir yang seperti menimpa kaum 'Ad dan Samud, aku pun diam seribu bahasa. Aku benar-benar mengetahui bahwa Muhammad itu, apabila ia mengatakan sesuatu, ia tidak berdusta, dan ia takut kepada azab yang akan menimpa itu.\"\n\nSebagaimana diketahui bahwa 'Utbah termasuk pemuka Quraisy dan orang yang berpengetahuan luas di antara mereka. Di samping seorang sastrawan ia juga mengetahui seluk-beluk sihir dan tenung yang dipercayai orang pada waktu itu. Kebungkaman 'Utbah itu menunjukkan bahwa hatinya telah beriman kepada Rasulullah, tetapi karena pengaruh nafsu dan kedudukan, maka ia mengingkari suara hatinya. Demikian pula halnya dengan kebanyakan orang-orang musyrik. Hatinya telah beriman dan ia telah takut kepada azab yang akan ditimpakan kepadanya seandainya ia tidak beriman, tetapi mereka tetap tidak beriman karena khawatir akan dikucilkan oleh kaumnya. Oleh karena itu, mereka mencari-cari alasan untuk menutupi hati mereka dengan mengatakan bahwa mustahil Allah mengangkat seorang rasul dari golongan manusia biasa. Jika Allah mengangkat rasul, tentu rasul itu dari golongan malaikat.",
          "14": "Ayat ini menerangkan perintah Allah kepada Nabi Muhammad agar menyeru kepada orang-orang kafir untuk beriman kepada Allah yang telah menciptakan langit dan bumi dan apa yang ada pada keduanya. Jika mereka tidak menerima ajakan itu dan berpaling, Rasulullah diperintahkan untuk mengingatkan mereka tentang azab yang akan ditimpakan Allah kepada setiap orang yang ingkar kepada-Nya. Di antara azab yang pernah ditimpakan kepada orang-orang yang ingkar ialah suara keras yang mengguntur dari langit dan memusnahkan semua yang dikenainya, seperti yang pernah ditimpakan kepada kaum 'Ad, kaum Samud, penduduk Aikah, dan sebagainya. Malapetaka itu menimpa mereka karena mengingkari seruan rasul yang diutus kepada mereka dan mengabaikan peringatan para rasul itu. Rasulullah menambahkan bahwa jika mereka tidak ingin ditimpa malapetaka seperti itu, maka ikutilah seruan yang disampaikannya dan agar hanya menyembah Allah, Tuhan Yang Maha Esa, tidak mempersekutukan-Nya dengan sesuatu apa pun.\n\nSeruan Rasulullah itu ditanggapi orang-orang musyrik dengan sikap angkuh dan sombong. Mereka mengingkarinya dengan mengatakan bahwa sekiranya Allah hendak mengutus para rasul kepada manusia, tentu Dia tidak akan mengutus manusia seperti Nabi Muhammad. Akan tetapi, Allah akan mengutus orang-orang yang mempunyai kelebihan dari manusia biasa, mempunyai kekuatan gaib, sanggup mengabulkan langsung segala yang diminta orang-orang yang diserunya, seperti malaikat, jin dan sebagainya. Menurut mereka, rasul yang diangkat dari manusia biasa tidak akan bisa memerkenankan permintaan orang-orang yang diserunya karena tidak mempunyai kelebihan apa pun. Sementara, menurut mereka, Allah belum berkehendak mengutus rasul itu. Itulah sebabnya mereka mengingkari kerasulan Nabi Muhammad.\n\nDiriwayatkan oleh al-Baihaqi dalam kitab \" Ad-Dalail\" dan Ibnu Asakir dari Jabir bin 'Abdullah. Ia mengatakan bahwa Abu Jahal dan para pemimpin kaum Quraisy berkata, \"Sesungguhnya kurang jelas bagi kita apa yang disampaikan oleh Muhammad itu, jika kamu menemukan seorang ahli sihir, tenung, dan syair, maka hendaklah ia berbicara dengannya, dan datang kepada kita untuk menerangkan maksud yang disampaikan Muhammad saw itu.\" 'Utbah bin Rabi'ah berkata, \"Demi Allah, aku benar-benar telah mendengar sihir, tenung, dan syair. Aku benar-benar memahami rumpun engkau hai Muhammad adalah orang yang paling baik dalam rumpun keluarga Abdul Muththalib?\" Muhammad tidak menjawab. 'Utbah berkata lagi, \"Mengapa engkau mencela tuhan-tuhan kami dan menganggap kami sesat? Jika engkau menghendaki wanita, pilihlah olehmu sepuluh wanita yang paling cantik yang kamu kehendaki dari suku Quraisy ini. Jika engkau menghendaki harta, kami kumpulkan harta itu sesuai dengan yang kamu perlukan.\" \n\nSetelah Rasulullah mendengar ucapan 'Utbah, beliau membaca Surah Fushshilat ini sejak permulaan ayat sampai kepada ayat ini, yang menerangkan malapetaka yang pernah ditimpakan kepada kaum 'Ad, dan Samud. Mendengar ayat yang dibacakan Rasulullah saw, Utbah diam seribu bahasa, lalu pulang ke rumahnya, tidak langsung kepada kaumnya. Tatkala kaumnya melihat 'Utbah dalam keadaan demikian, mereka mengatakan bahwa 'Utbah telah kena sihir Muhammad. Lalu mereka mencari 'Utbah dan berkata kepadanya, \"Ya 'Utbah, engkau tidak datang kepada kami itu adalah karena engkau telah kena sihir.\" Maka 'Utbah marah dan bersumpah tidak akan berbicara lagi dengan Muhammad, kemudian ia berkata, \"Demi Allah, aku benar-benar telah berbicara dengannya, lalu ia menjawab dengan satu jawaban yang menurut pendapatku jawaban itu bukan syair, bukan sihir, dan bukan pula tenung. Tatkala ia sampai kepada ucapan: petir yang seperti menimpa kaum 'Ad dan Samud, aku pun diam seribu bahasa. Aku benar-benar mengetahui bahwa Muhammad itu, apabila ia mengatakan sesuatu, ia tidak berdusta, dan ia takut kepada azab yang akan menimpa itu.\"\n\nSebagaimana diketahui bahwa 'Utbah termasuk pemuka Quraisy dan orang yang berpengetahuan luas di antara mereka. Di samping seorang sastrawan ia juga mengetahui seluk-beluk sihir dan tenung yang dipercayai orang pada waktu itu. Kebungkaman 'Utbah itu menunjukkan bahwa hatinya telah beriman kepada Rasulullah, tetapi karena pengaruh nafsu dan kedudukan, maka ia mengingkari suara hatinya. Demikian pula halnya dengan kebanyakan orang-orang musyrik. Hatinya telah beriman dan ia telah takut kepada azab yang akan ditimpakan kepadanya seandainya ia tidak beriman, tetapi mereka tetap tidak beriman karena khawatir akan dikucilkan oleh kaumnya. Oleh karena itu, mereka mencari-cari alasan untuk menutupi hati mereka dengan mengatakan bahwa mustahil Allah mengangkat seorang rasul dari golongan manusia biasa. Jika Allah mengangkat rasul, tentu rasul itu dari golongan malaikat.",
          "15": "Pada ayat ini, Allah menerangkan keadaan kaum 'Ad yang telah ditimpa azab Allah dan sikapnya terhadap seruan rasul yang diutus kepadanya. Diterangkan bahwa kaum 'Ad itu menyombongkan diri, merasa diri mereka tidak ada yang menandingi, dan semua tunduk kepadanya. Oleh karena itu, mereka durhaka kepada Tuhan yang telah menciptakan dan memberikan karunia kepada mereka, dan tidak menerima seruan rasul Allah yang diutus kepada mereka. Mereka menantang siapa yang sanggup menandingi mereka.\n\nAllah mengancam dan memperingatkan mereka dengan mengatakan apakah mereka telah memikirkan betul-betul yang mereka ucapkan, dan apakah mereka tidak mengetahui siapa yang mereka tentang itu? Yang mereka tentang itu adalah Allah Yang Mahakuasa, yang menciptakan segala sesuatu termasuk diri mereka sendiri, Yang Mahaperkasa, yang lebih kuat dari mereka. Jika Allah menghendaki, maka Dia dapat menimpakan bencana apa pun terhadap mereka dan sedikit pun mereka tidak akan dapat menghindarkan diri dari bencana itu.\n\nMereka sebenarnya telah mengetahui dan meyakini bukti-bukti kebesaran dan kekuasaan Kami, yang disampaikan oleh para rasul yang diutus kepada mereka. Akan tetapi, mereka mengingkarinya dan mendurhakai para rasul itu.",
          "16": "Pada ayat ini Allah menerangkan bentuk azab yang ditimpakan kepada kaum 'Ad. Dia menghembuskan angin kencang yang sangat dingin diiringi dengan suara gemuruh yang memusnahkan mereka. Angin kencang yang sangat dingin itu terus-menerus melanda mereka dalam tujuh malam dan delapan hari, yang merupakan hari yang sial bagi mereka, sebagaimana diterangkan dalam firman Allah:\n\nSedangkan kaum 'Ad, mereka telah dibinasakan dengan angin topan yang sangat dingin, Allah menimpakan angin itu kepada mereka selama tujuh malam delapan hari terus-menerus; maka kamu melihat kaum 'Ad pada waktu itu mati bergelimpangan seperti batang-batang pohon kurma yang telah kosong (lapuk). (al-haqqah/69: 6-7)\n\nDiterangkan pada ayat ini bahwa tujuan Allah menimpakan azab yang dahsyat itu kepada kaum 'Ad agar mereka merasakan akibat dari menyombongkan diri dan takabur terhadap Allah dan para rasul yang diutus kepada mereka, yaitu kehinaan, kerendahan, dan malapetaka yang menimpa mereka dalam kehidupan duniawi. Sedang azab akhirat lebih dahsyat dan sangat menghinakan mereka. Mereka tidak akan memperoleh seorang penolong pun yang dapat membebaskan dari azab itu.",
          "17": "Kepada kaum Samud, Allah telah menyampaikan agama-Nya dengan perantaraan Nabi Saleh. Allah telah menunjukkan kepada mereka jalan keselamatan dan jalan yang lurus, dengan memperlihatkan tanda-tanda kebesaran dan kekuasaan-Nya yang ada di cakrawala luas ini. Allah juga mengajarkan kepada mereka hukum-hukum yang dapat membahagiakan mereka di dunia dan akhirat. Akan tetapi, mereka mengutamakan kekafiran dari keimanan yang berarti pula mereka lebih mengutamakan kehinaan dan kesengsaraan daripada kemuliaan dan kebahagiaan. Karena sikap dan perbuatan mereka itu, maka Allah menurunkan kepada mereka azab berupa suara keras yang mengguntur dari langit.\n\nPada ayat yang lain, Allah menerangkan azab yang ditimpakan kepada kaum Samud. Allah berfirman:\n\nKemudian suara yang mengguntur menimpa orang-orang zalim itu, sehingga mereka mati bergelimpangan di rumahnya. Seolah-olah mereka belum pernah tinggal di tempat itu. Ingatlah, kaum Samud mengingkari Tuhan mereka. Ingatlah, binasalah kaum Samud. (Hud/11: 67-68)",
          "18": "Nabi Saleh dan orang-orang yang beriman diselamatkan Allah dari azab itu. Mereka tidak ditimpa malapetaka dan bencana yang dahsyat itu karena keimanan dan ketakwaan mereka kepada-Nya.",
          "19": "Ayat ini menerangkan perintah Allah kepada Nabi Muhammad agar menyampaikan kepada orang-orang yang ingkar itu keadaan mereka pada hari Kiamat nanti. Pada hari itu, semua musuh-musuh Allah dan orang-orang yang ingkar kepada-Nya akan dikumpulkan dalam neraka. Mereka dihalau ke dalamnya seperti orang menggiring dan menghalau binatang ternak. Tidak ada satu pun yang luput dan tertinggal di antara mereka.",
          "20": "Tatkala mereka sampai di pinggir neraka, mereka ditanya tentang perbuatan-perbuatan yang telah mereka lakukan selama hidup di dunia. Sebagai saksi atas perbuatan yang telah mereka lakukan itu ialah seluruh anggota badan mereka yang langsung melakukan perbuatan-perbuatan dosa itu, seperti telinga, mata, dan anggota-anggota tubuh mereka. Tiap-tiap makhluk ditanya sesuai dengan keadaan dan sifatnya. Apa yang ditanya dan bagaimana jawaban makhluk-makhluk itu, termasuk ilmu yang gaib, hanya Allah sendiri yang mengetahuinya. Mungkin ada soal yang berhubungan dengan niat dan isi hatinya, atau mengenai perbuatan-perbuatannya. Jika pertanyaan itu tentang ketaatan beribadah, sopan-santun, hubungan silaturrahim, amal saleh, dan yang serupa dengan itu dihadapkan kepada orang yang suka mengerjakan perbuatan itu selama hidup di dunia, tentu orang-orang itu akan menjawabnya dengan gembira kepada Allah. Jika budi pekerti yang buruk, memutuskan hubungan silaturrahim, perbuatan jahat, dan perbuatan lain yang serupa dengan itu, dihadapkan kepada orang yang mengerjakannya, tentulah mereka menjawab dengan gemetar dan penuh ketakutan. Allah Maha Mengetahui tentang itu.",
          "21": "Tatkala mendengar dan melihat bahwa kulitnya sendiri menjadi saksi atas perbuatan-perbuatannya, orang-orang kafir mencela kulit mereka itu dengan mengatakan, \"Mengapa kamu menjadi saksi atas diri kami, padahal kamulah yang membantu dan mendorong kami berbuat maksiat selama hidup di dunia?\" Kulit-kulit mereka menjawab, \"Allah Yang Mahakuasa telah menjadikan kami pandai berbicara, sehingga kami dapat menerangkan dengan jelas dan lengkap segala yang pernah kamu perintahkan kepada kami untuk mengerjakannya.\" Firman Allah:\n\nPada hari ini Kami tutup mulut mereka; tangan mereka akan berkata kepada Kami dan kaki mereka akan memberi kesaksian terhadap apa yang dahulu mereka kerjakan. (Yasin/36: 65)\n\nMengenai pertanyaan dan persaksian di akhirat ini diterangkan dalam hadis Nabi saw yang diriwayatkan dari Anas bin Malik, ia berkata:\n\nKetika kami bersama Rasulullah saw, beliau tertawa lalu berkata, \"Apakah kamu mengetahui kenapa aku tertawa?\" Kami menjawab, \"Allah dan Rasul-Nya yang lebih mengetahui.\" Beliau berkata, \"Aku tertawa karena pembicaraan seorang hamba dengan Tuhan (di hari Kiamat). Hamba berkata, \"Hai Tuhanku Apakah Engkau tidak melindungi aku dari kezaliman?\" Rasulullah berkata, \"Tuhan berkata, 'Benar.\" Rasulullah berkata, \"Hamba itu mengatakan, 'Maka saya tidak mengizinkan diriku kecuali saksi dari diriku sendiri.\" Rasulullah saw berkata, \"Allah berfirman, 'Cukuplah diri engkau menjadi saksi atas perbuatanmu sendiri pada hari ini, dan persaksian malaikat yang mencatat.\" Rasulullah berkata, \"Kemudian ditutuplah mulut orang itu dan dikatakan kepada anggota-anggota badannya, 'Berbicaralah, maka anggota-anggota badan itu menerangkan perbuatannya.\" Rasulullah berkata, \"Kemudian dibiarkan orang itu berbicara terhadap anggota badan mereka.\" Nabi berkata, \"Maka hamba itu berkata (kepada anggota badannya), 'Celaka dan hancurlah kamu semua. Aku ini berjuang untuk membela kamu.\"(Riwayat Muslim dan Ibnu hibban)\n\nAllah menerangkan bahwa Dialah Yang menciptakan manusia pada kali yang pertama, dari tidak ada kepada ada, dan Dia pula yang menjadikan untuk mereka dalil-dalil yang nyata. Jika Allah sanggup menciptakan manusia pada kali yang pertama, tentu Dia sanggup pula mengulangi penciptaan itu pada kali yang kedua, dengan membangkitkan manusia sesudah matinya, kemudian Dia membalas semua perbuatan manusia dengan adil.",
          "22": "Diriwayatkan dari al-Bukhari dan Muslim beserta imam-imam yang lain dari Ibnu Mas'ud ia berkata, \"Ketika aku bersembunyi di belakang tirai Ka'bah, maka datanglah tiga orang: seorang Quraisy dan dua orang Bani saqif, atau seorang Bani saqif dan dua orang Quraisy, sedikit sekali ilmunya dan amat buncit perut mereka, mereka mengucapkan perkataan yang tidak pernah aku dengar. Maka salah seorang mereka berkata, 'Apakah kamu berpendapat bahwa Allah mendengar perkataan kita ini? Maka yang lain menjawab, 'Sesungguhnya apabila kita mengeraskan suara kita, niscaya Dia mendengarnya dan apabila kita tidak mengeraskannya niscaya Dia tidak mendengarnya. Maka yang lain berkata, 'Jika Dia mendengar sesuatu daripadanya, pasti Dia mendengar seluruhnya.\" Maka Ibnu Mas'ud menyampaikan yang demikian pada Nabi saw, maka Allah menurunkan ayat ini sampai kepada firman-Nya: mi nal khasirin.\n\nAyat ini menerangkan bahwa manusia itu tidak dapat menyembunyikan dan merahasiakan perbuatan-perbuatan kejinya, sekalipun ia berbuat kemaksiatan, kejahatan, dan kekafiran secara terang-terangan dan mengingkari hari kebangkitan dan pembalasan Allah. Bahkan, ia mengira di saat ia menyembunyikan perbuatannya dari manusia, Allah pun tidak mengetahui apa-apa yang mereka kerjakan. Oleh karena itu, ia tidak akan dapat menghukum dan memberi pembalasan.\n\nAyat ini memperingatkan orang-orang yang beriman agar selalu waspada dan memikirkan benar-benar perbuatan-perbuatan yang akan mereka lakukan, karena Allah mengetahui segala yang mereka perbuat, tidak ada sesuatu pun yang tersembunyi bagi-Nya.",
          "23": "Dugaan orang-orang kafir bahwa Allah tidak mengetahui dan tidak melihat perbuatan-perbuatan buruk yang dilakukannya adalah persangkaan yang tidak baik. Persangkaan yang demikian akan menimbulkan keberanian untuk melakukan perbuatan-perbuatan terlarang, sehingga berakibat kerugian pada diri sendiri. Akibat persangkaan yang demikian itu, mereka akan mendapat kerugian dan kehinaan di dunia dan azab pedih di akhirat nanti.\n\nDari ayat ini, dapat dipahami bahwa sangkaan yang baik ialah meyakini bahwa Allah mengetahui segala perbuatan hamba-Nya sejak dari yang halus sampai kepada yang besar, sejak dari yang nampak sampai kepada yang tersembunyi, dan Allah mengetahui segala isi hatinya.\n\nJika seseorang telah memercayai yang demikian, maka ia selalu meneliti segala yang akan diperbuatnya, mana yang diridai Allah dan mana yang tidak diridai-Nya. Ia akan menghentikan serta menjauhkan diri dari segala perbuatan yang tidak diridai Allah, karena ia telah yakin bahwa Allah melihat dan mengetahui semua perbuatannya itu.\n\nDiriwayatkan oleh Ahmad, Muslim, Abu Dawud., dan Ibnu Majah dari Jabir bin 'Abdullah:\n\nRasulullah saw bersabda, \"Kamu jangan sekali-kali mati kecuali berbaik sangka kepada Allah. (Riwayat Ahmad, Muslim, Abu Dawud, dan Ibnu Majah)\n\nPara ulama berpendapat bahwa sangkaan itu ada dua macam: pertama, sangkaan yang baik, yaitu menyangka bahwa Allah mempunyai rahmat, keutamaan, dan kebaikan yang akan dilimpahkan-Nya kepada manusia, sebagaimana tersebut dalam hadis Qudsi:\n\nAllah berfirman, \"Aku menuruti sangkaan hamba-Ku kepada-Ku.\"(Riwayat Muslim dari Anas)\n\nKedua, sangkaan yang jelek, yaitu menyangka bahwa Allah tidak mengetahui segala perbuatan hamba-hamba-Nya. \n\nMenurut Qatadah, sangkaan itu ada dua macam, yaitu: pertama, sangkaan yang menyelamatkan seperti yang diterangkan firman Allah:\n\nSesungguhnya aku yakin, bahwa (suatu saat) aku akan menerima perhitungan terhadap diriku. (al-haqqah/69: 20)\n\nDan firman Allah:\n\n(Yaitu) mereka yang yakin, bahwa mereka akan menemui Tuhannya, dan bahwa mereka akan kembali kepada-Nya. (al-Baqarah/2: 46)\n\nKedua, sangkaan yang merusak, seperti yang diterangkan firman Allah ini.\n\nUmar bin Khaththab berkata tentang ayat ini, \"Mereka adalah orang-orang yang terus-menerus berbuat maksiat, tidak bertobat dari perbuatan itu, dan mereka berdebat tentang ampunan Tuhan, sehingga mereka meninggalkan dunia tidak membawa apa-apa.\" Kemudian Umar membaca ayat ini.\n\nAl-hasan al-Bashri berkata, \"Sesungguhnya satu kaum yang diperdaya oleh angan-angannya yang kosong sehingga mereka meninggal dunia, dan tiadalah mereka mempunyai suatu kebaikan pun. Salah seorang dari mereka berkata, 'Sesungguhnya aku berbaik sangka terhadap Tuhanku. Sesungguhnya ia telah berdusta. Jika baik sangkaannya, tentu baik pula amalnya.\" Kemudian Al-hasan al-Bashrimembaca ayat ini.",
          "24": "Pada ayat ini, Allah menerangkan keadaan orang-orang yang berburuk sangka terhadap Allah, yaitu mereka akan dimasukkan ke dalam neraka. Semuanya dimasukkan ke dalam neraka tidak ada kecualinya dan neraka inilah tempat kembali mereka.\n\nSeandainya di antara mereka ada yang minta ditangguhkan azab atau minta ampun kepada Allah dan bersedia kembali ke dunia seandainya Allah memberi mereka kesempatan, maka semuanya tidak akan dikabulkan. Permohonan mereka tidak mungkin dikabulkan karena mereka telah meninggalkan dunia. Tempat beramal dan dunia itu pun telah hancur, sedang akhirat bukanlah tempat beramal, tetapi tempat menerima hasil amal seseorang semasa hidup di dunia.",
          "25": "Allah menerangkan bahwa Dia telah menyediakan bagi orang kafir itu teman dan penolong berupa setan-setan dari golongan jin dan manusia. Mereka menganggap perbuatan-perbuatan duniawi yang membawa kepada kesesatan dan kekafiran itu baik, seperti memperturutkan hawa nafsu, suka mengumpulkan harta semata-mata untuk kepentingan diri sendiri, gila kekuasaan, mengerjakan perbuatan-perbuatan maksiat dan terlarang dan sebagainya. Demikian halnya dengan urusan-urusan akhirat, setan-setan itu telah menanamkan kepercayaan kepada hati manusia bahwa tidak ada surga atau neraka, tidak ada hidup sesudah mati, tidak ada kebangkitan dan hisab, tidak ada Tuhan yang wajib disembah, dan sebagainya. Oleh karena itu, mudah bagi mereka melakukan perbuatan-perbuatan yang mereka inginkan dan melakukan perbuatan-perbuatan terlarang. Firman Allah:\n\nDan barangsiapa berpaling dari pengajaran Allah Yang Maha Pengasih (Al-Qur'an), Kami biarkan setan (menyesatkannya) dan menjadi teman karibnya. Dan sungguh, mereka (setan-setan itu) benar-benar menghalang-halangi mereka dari jalan yang benar, sedang mereka menyangka bahwa mereka mendapat petunjuk. (az-Zukhruf/43: 36-37)\n\nKarena sikap dan perbuatan mereka itu, maka ditetapkanlah azab bagi mereka, seperti azab yang pernah ditimpakan kepada umat-umat dahulu, yang telah mengikuti tipu daya setan. Semua mereka itu, yaitu setan-setan beserta pengikut-pengikutnya, sama-sama menderita kerugian dan kehancuran. Mereka sama-sama mendapat azab yang pedih di akhirat nanti karena mereka sama-sama orang yang merugikan diri sendiri.",
          "26": "Orang-orang yang kafir dan ingkar kepada Allah dan rasul-Nya berkata kepada kaum mereka, \"Jangan sekali-kali kamu mendengar ayat-ayat Al-Qur'an yang dibacakan oleh Muhammad, jangan kamu memperhatikan dan merenungkan isinya. Hendaklah kamu berusaha mengganggu pendengaran orang-orang yang mendengarnya, seperti dengan bernyanyi-nyanyi, bersorak-sorai. Dengan sikap kamu yang demikian, mudah-mudahan orang-orang yang mendengarnya, tidak mengetahui dengan jelas bacaan Al-Qur'an yang didengarnya itu.\"\n\nDahulu waktu Rasulullah masih di Mekah, sebelum hijrah ke Medinah, apabila beliau membaca ayat-ayat Al-Qur'an, beliau mengeraskan suaranya agar didengar orang-orang banyak. Apabila pemuda-pemuda musyrik Mekah mendengar beliau membaca Al-Qur'an, mereka mengusir orang-orang yang mendengar bacaan Nabi saw itu dengan mengatakan, \"Ganggulah suara Muhammad itu dengan menangis, bersiul, bernyanyi, atau dengan bertepuk tangan.\"\n\nIbnu 'Abbas berkata bahwa Abu Jahal berkata kepada kaumnya, \"Apabila Muhammad membaca ayat-ayat Al-Qur'an, berteriaklah dengan keras di mukanya, sehingga tidak terdengar apa yang diucapkannya.\" Padahal, Allah memerintahkan untuk mendengarkan jika Al-Qur'an dibacakan. Firman-Nya:\n\nDan apabila dibacakan Al-Qur'an, maka dengarkanlah dan diamlah, agar kamu mendapat rahmat. (al-A 'raf/7: 204)",
          "27": "Pada ayat ini, Allah mengancam orang-orang kafir dengan azab yang pedih dengan mengatakan, \"Kami benar-benar akan merasakan kepada orang-orang kafir itu azab yang tidak dapat digambarkan kedahsyatnnya dan Kami akan membalas semua perbuatan dosa dan larangan yang telah mereka lakukan. Kami tidak akan memberi pahala semua perbuatan baik yang telah mereka kerjakan, karena semua perbuatan baik seperti menghubungkan silaturrahim, menolong orang sengsara, mengerjakan perbuatan baik dan sebagainya, telah dihapus oleh kekafiran mereka. Tidak ada satu pun yang dapat mereka harapkan dari perbuatan baik itu selain dari amal yang buruk.\"",
          "28": "Balasan bagi orang-orang yang memperolok-olokkan ayat-ayat Allah dan bagi musuh-musuhnya ialah api neraka. Mereka kekal di dalamnya dan azab itu mereka rasakan terus-menerus. Mereka tidak dapat menghindarinya lagi.\n\nKemudian Allah menerangkan bahwa mereka berada di neraka Jahanam kekal selama-lamanya, sebagai balasan terhadap perbuatan mereka mengingkari ayat-ayat Allah sewaktu di dunia",
          "29": "Pada ayat ini diterangkan bahwa tatkala orang-orang kafir itu merasakan azab neraka, mereka minta kepada Allah agar setan-setan yang menyesatkan mereka dihadapkan kepada mereka. Permintaan itu diajukan agar mereka dapat melampiaskan dendam mereka. Mereka berkata, \"Wahai Tuhan kami, hadapkanlah kepada kami setan-setan yang menyesatkan kami itu, agar kami dapat melampiaskan sakit hati kami kepada mereka dengan menginjak-injak tubuh mereka.\"\n\nPada ayat-ayat yang lain diterangkan bahwa setan-setan itu ada yang jenis jin dan ada yang dari jenis manusia, seperti firman Allah:\n\nDan demikianlah untuk setiap nabi Kami menjadikan musuh yang terdiri dari setan-setan manusia dan jin¦ (al-An'am/6: 112)\n\nDan firman Allah:\n\nYang membisikkan (kejahatan) ke dalam dada manusia, dari (golongan) jin dan manusia. (an-Nas/114: 5-6)",
          "30": "Ayat ini menerangkan bahwa orang-orang yang mengatakan dan mengakui bahwa Tuhan Yang Menciptakan, Memelihara, dan Menjaga kelangsungan hidup, Memberi rezeki, dan yang berhak disembah, hanyalah Tuhan Yang Maha Esa, kemudian mereka tetap teguh dalam pendiriannya itu, maka para malaikat akan turun untuk mendampingi mereka pada saat-saat diperlukan. Di antaranya pada saat mereka meninggal dunia, di dalam kubur, dan dihisab di akhirat nanti, sehingga segala kesulitan yang mereka hadapi terasa menjadi ringan.\n\nDalam hadis Nabi saw diterangkan bahwa teguh dalam pendirian itu merupakan hal yang sangat diperlukan oleh seorang mukmin:\n\nSufyan bin 'Abdullah ats-saqaf meriwayatkan bahwa seseorang berkata, \"Ya Rasulullah,perintahkan kepadaku tentang Islam suatu pererintah yang, aku tidak menanyakan lagi kepada orang selain engkau.\" Rasulullah menjawab, \"Katakanlah: Aku beriman kepada Allah, kemudian teguhkanlah pendirianmu.\" Aku berkata, \"Apa yang harus aku jaga?\" Maka Rasulullah mengisyaratkan kepada lidahnya sendiri. (Riwayat Muslim)\n\nMenurut Abu Bakar, yang dimaksud dengan perkataan \"istiqamah\" ialah tidak mempersekutukan Allah dengan sesuatu apa pun.\n\nKepada orang yang beriman dan berpendirian teguh dengan tidak mempersekutukan-Nya, Allah menurunkan malaikat yang menyampaikan kabar menggembirakan, memberikan segala yang bermanfaat, menolak kemudaratan, dan menghilangkan duka cita yang mungkin ada padanya dalam seluruh urusan duniawi maupun urusan ukhrawi. Dengan demikian, dadanya menjadi lapang dan tenteram, tidak ada kekhawatiran pada diri mereka. Sedangkan kepada orang-orang kafir, datang setan yang selalu menggoda mereka, sehingga menjadikan perbuatan buruk indah menurut pandangan mereka.\n\nWaki' dan Ibnu Zaid berpendapat bahwa para malaikat memberikan berita gembira kepada orang-orang yang beriman pada tiga keadaan yaitu, ketika mati, di dalam kubur, dan di waktu kebangkitan.\n\nKepada orang-orang yang beriman itu para malaikat mengatakan agar mereka tidak usah khawatir menghadapi hari kebangkitan dan hari perhitungan nanti. Mereka juga tidak usah bersedih hati terhadap urusan dunia yang luput dari mereka seperti yang berhubungan dengan keluarga, anak, harta, dan sebagainya.\n\nMenurut 'Atha', yang dimaksud dengan \"alla takhafu wa la tahzanu\" ialah: janganlah kamu khawatir bahwa Allah tidak memberi pahala amalmu, sesungguhnya kamu itu diterima Allah, dan janganlah kamu bersedih hati atas perbuatan dosa yang telah kamu perbuat, maka sesungguhnya Allah mengampuninya.\n\nAyat ini selanjutnya menjelaskan bahwa para malaikat mengatakan kepada orang-orang beriman agar bergembira dengan surga yang telah dijanjikan para rasul. Mereka pasti masuk surga, dan kekal di dalamnya.",
          "31": "Selanjutnya para malaikat itu menyatakan kepada orang-orang yang beriman bahwa mereka selalu mendampingi dan menolong orang-orang tersebut dalam segala urusan dunia. Para malaikat selalu memberi petunjuk yang menuju kepada kebaikan, kebenaran, dan kemaslahatan. Demikian pula para malaikat akan bersama-sama orang-orang beriman di akhirat nanti, menemani mereka di dalam kubur, pada waktu hari Kiamat, dan hari perhitungan sampai mereka masuk ke dalam surga.\n\nSebagian ahli tafsir berpendapat bahwa yang menyatakan kepada orang-orang beriman dalam ayat ini ialah Allah sendiri, sehingga maksud ayat ini adalah: \"Dan Allah wali bagi orang-orang yang beriman yang kuat pendiriannya . . .\"\n\nMalaikat mengatakan bahwa di dalam surga itu orang-orang yang beriman akan memperoleh berbagai macam kesenangan, kebahagiaan, dan kenikmatan yang selalu diidam-idamkan, serta segala yang diinginkan dan diminta.",
          "32": "Pada ayat ini diterangkan bahwa Allah menganugerahkan yang demikian itu sebagai suatu kemuliaan bagi mereka. Dia mengampuni segala dosa-dosa dan mencurahkan rahmat kepada mereka.",
          "33": "Ayat ini mencela orang-orang yang mengatakan yang bukan-bukan tentang Al-Qur'an. Al-Qur'an mempertanyakan: perkataan manakah yang lebih baik daripada Al-Qur'an, siapakah yang lebih baik perkataannya dari orang yang menyeru manusia agar taat kepada Allah.\n\nIbnu Sirin, as-Suddi, Ibnu Zaid, dan al-hasan berpendapat bahwa orang yang paling baik perkataannya itu ialah Rasulullah saw. Apabila membaca ayat ini, al-hasan berkata bahwa yang dimaksud adalah Rasulullah, ia adalah kecintaan dan wali Allah. Ia adalah yang disucikan Allah dan merupakan pilihan-Nya. Ia adalah penduduk bumi yang paling cinta kepada Allah. Allah memperkenankan seruannya dan ia menyeru manusia agar mengikuti seruan itu. Sebagian ulama lain berpendapat bahwa ayat ini maksudnya umum, yaitu semua orang yang menyeru orang lain untuk menaati Allah. Rasulullah termasuk orang yang paling baik perkataannya, karena beliau menyeru manusia kepada agama Allah.\n\nAyat ini menerangkan bahwa seseorang dikatakan paling baik apabila perkataannya mengandung tiga perkara, yaitu:\n\n1. Seruan pada orang lain untuk mengikuti agama tauhid, mengesakan Allah dan taat kepada-Nya.\n\n2. Ajakan untuk beramal saleh, taat melaksanakan perintah-perintah Allah dan menghentikan larangan-Nya.\n\n3. Menjadikan Islam sebagai agama dan memurnikan ketaatan hanya kepada Allah saja.\n\nDengan menerangkan perkataan yang paling baik itu, seakan-akan Allah menegaskan kepada Rasulullah bahwa tugas yang diberikan kepada beliau itu adalah tugas yang paling mulia. Oleh karena itu, beliau diminta untuk tetap melaksanakan dakwah, dan sabar dalam menghadapi kesukaran-kesukaran dan rintangan-rintangan yang dilakukan orang-orang kafir.\n\nDari ayat ini dipahami bahwa sesuatu yang paling utama dikerjakan oleh seorang muslim ialah memperbaiki diri lebih dahulu, dengan memperkuat iman di dada, menaati segala perintah Allah, dan menghentikan segala larangan-Nya. Setelah diri diperbaiki, serulah orang lain mengikuti agama Allah. Orang yang bersih jiwanya, kuat imannya, dan selalu mengerjakan amal yang saleh, ajakannya lebih diperhatikan orang, karena ia menyeru orang lain dengan keyakinan yang kuat dan dengan suara yang mantap, tidak ragu-ragu.",
          "34": "Ayat ini menerangkan bahwa kebaikan yang diridai Allah dan diberi pahala itu tidak sama dengan keburukan yang dibenci-Nya dan orang yang melakukannya pasti diazab.\n\nAyat ini dapat ditafsirkan dengan pernyataan bahwa tidak sama dakwah orang yang menyeru kepada Allah dan mengikuti Islam, dengan perbuatan mencela orang-orang yang melaksanakan dakwah itu.\n\nSikap orang kafir yang mencela para dai diterangkan dalam firman Allah:\n\n¦ Hati kami sudah tertutup dari apa yang engkau seru kami kepadanya¦ (Fushshilat/41: 5)\n\nDan firman Allah:\n\nDan orang-orang yang kafir berkata, \"Janganlah kamu mendengarkan (bacaan) Al-Qur'an ini dan buatlah kegaduhan terhadapnya, agar kamu dapat mengalahkan (mereka).\" (Fushshilat/41: 26)\n\nDengan ayat ini, seakan-akan Allah menyatakan kepada Rasulullah saw bahwa jika ia mengerjakan kebaikan, maka akan memperoleh ganjaran kebaikan berupa penghargaan selama hidup di dunia dan pahala yang besar di akhirat nanti. Sedang orang-orang kafir yang mengerjakan kejahatan itu akan memperoleh penghinaan di dunia, dan di akhirat mereka akan memperoleh azab yang pedih. Rasulullah juga dilarang untuk membalas kejahatan mereka dengan kejahatan. Jika ia membalas kejahatan dengan kejahatan tentu mereka akan memperoleh kerugian yang berlipat ganda. Oleh karena itu, Rasulullah diperintahkan untuk membalas kejahatan mereka dengan kebaikan.\n\nKemudian Allah menerangkan cara membalas kejahatan orang-orang kafir itu dengan kebaikan dengan memerintahkan kepada Rasulullah agar membalas kebodohan dan kejahatan orang-orang kafir dengan cara yang paling baik, membalas perbuatan buruk mereka dengan perbuatan baik, memaafkan kesalahan mereka, dan menghadapi kemarahan mereka dengan kesabaran. Jika Nabi berbuat demikian, lambat laun mereka akan menilai sendiri perbuatan mereka, dan menimbulkan malu kepada mereka karena tindakan-tindakan mereka itu.\n\nAllah menerangkan hasil yang akan diperoleh orang-orang yang beriman jika membalas perbuatan buruk orang-orang kafir dengan perbuatan baik. Allah mengatakan jika orang-orang beriman berhasil berbuat demikian, tentu permusuhan orang-orang kafir kepada mereka akan berubah menjadi persahabatan, kebencian akan berubah menjadi kecintaan.\n\nIbnu 'Abbas berkata bahwa pada ayat ini, Allah memerintahkan kepada manusia agar berlaku sabar ketika marah, penyantun terhadap orang yang bodoh, dan memaafkan kesalahan orang. Jika seseorang mengerjakan yang demikian, Allah akan memelihara mereka dari setan, dan musuh-musuh mereka akan tunduk dan patuh kepada mereka.\n\nDiriwayatkan bahwa seorang laki-laki mencela Qunbur, budak 'Ali bin Abi thalib, yang telah dimerdekakannya. 'Ali lalu memanggilnya dan berkata, Wahai Qunbur, tinggalkanlah orang yang mencelamu itu, biarkanlah ia, semoga Tuhan Yang Maha Penyayang meridai, dan setan menjadi marah.\"\n\nMenurut Muqatil., ayat ini turun berhubungan dengan Abu Sufyan. Dia adalah salah seorang musuh Rasulullah yang paling besar. Akan tetapi karena kesabaran dan sikap Nabi yang baik kepadanya, Abu Sufyan menjadi sahabat Nabi yang akrab, dengan mengadakan hubungan perbesanan (mushaharah).",
          "35": "Pada ayat ini, Allah menerangkan cara yang paling baik menghadapi orang-orang kafir, yaitu orang yang sabar ketika menderita kesulitan dan kesengsaraan, dapat menahan marah, tidak pendendam, dan suka memaafkan.\n\nAnas r.a. dalam menafsirkan ayat ini mengatakan bahwa yang dimaksud dengan sabar dalam ayat ini ialah apabila seseorang dimaki oleh orang lain, ia berkata, \"Jika engkau memakiku dengan alasan yang benar, mudah-mudahan Allah akan mengampuni dosamu. Jika engkau memakiku dengan alasan yang tidak benar, mudah-mudahan Allah mengampuni dosa-dosaku.\"\n\nNasihat agar berlaku sabar, menahan marah, dan suka memaafkan kesalahan orang lain itu adalah suatu nasihat yang paling utama dan tinggi nilainya. Yang dapat menerima nasihat itu hanyalah orang-orang yang beriman dan beramal saleh, yang akan memperoleh kebahagiaan di dunia dan di akhirat nanti.\n\nQatadah mengatakan bahwa arti dari \"keuntungan yang besar\" ialah surga. Maksud ayat ini ialah kesabaran itu hanyalah dianugerahkan kepada orang-orang yang akan masuk surga.",
          "36": "Ayat ini menerangkan bahwa jika setan menggoda agar engkau membalas kejahatan dengan kejahatan pula, maka berlindunglah kepada Allah dari segala tipu daya setan yang terkutuk itu. Allah Maha Mendengar permohonanmu dan Maha Mengetahui segala yang dibisikkan setan ke dalam dadamu itu.",
          "37": "Ayat ini menerangkan bahwa di antara tanda-tanda kebesaran dan kekuasaan Allah ialah adanya malam sebagai waktu istirahat, siang waktu bekerja dan berusaha, matahari yang memancarkan sinarnya, dan bulan yang bercahaya. Dia yang mengatur perjalanan planet-planet pada garis edarnya di cakrawala sehingga dengan demikian diketahui perhitungan tahun, bulan, hari, dan waktu sebagaimana firman Allah:\n\nDialah yang menjadikan matahari bersinar dan bulan bercahaya, dan Dialah yang menetapkan tempat-tempat orbitnya, agar kamu mengetahui bilangan tahun, dan perhitungan (waktu). (Yunus/10: 5)\n\nSetelah Allah menerangkan tanda-tanda kebesaran dan kekuasaan-Nya, Dia memperingatkan hamba-hamba-Nya agar jangan sekali-kali bersujud kepada tanda-tanda kebesaran dan kekuasaan-Nya itu, seperti matahari, bulan, bintang, dan sebagainya. Jangan sekali-kali memuliakan, menyembah, dan menganggapnya mempunyai kekuatan gaib, karena semuanya itu hanya Dialah yang menciptakan, menguasai, mengatur, dan menentukan ada dan tidaknya.\n\nSeakan-akan ayat ini menerangkan dan mengingatkan bahwa manusia adalah makhluk Tuhan yang paling mulia di antara makhluk-makhluk yang diciptakan-Nya. Karena itu tidak pantas manusia memuliakan, menganggap keramat, dan menghormati makhluk Tuhan yang lebih rendah daripadanya. Yang patut disembah, dimuliakan, dan dihormati adalah sesuatu yang paling berkuasa dan paling mulia yaitu Allah. Seandainya ada manusia yang menyembah dan memuliakan makhluk selain Allah, berarti manusia telah merendahkan martabat dirinya sendiri.\n\nAyat ini juga memperingatkan manusia yang menyekutukan Allah, penyembah-penyembah patung, penyembah-penyembah matahari, bulan, dan bintang-bintang agar menyadari kedudukannya di antara makhluk-makhluk yang lain itu.",
          "38": "Kemudian Allah memperingatkan Nabi Muhammad bahwa jika orang-orang musyrik yang menyembah bintang-bintang itu bersikap angkuh dan tidak mengindahkan seruannya, biarkan saja mereka dengan kesesatan yang mereka lakukan itu. Allah tidak memerlukan mereka sedikit pun. Mereka beriman atau tidak beriman tidak ada artinya bagi Allah sedikit pun.\n\nAllah melanjutkan peringatan-Nya bahwa para makhluk yang berada di sisi-Nya lebih baik dari orang-orang musyrik itu, tidak ada yang bersikap angkuh dan menyombongkan diri kepada-Nya. Mereka senantiasa bertasbih, salat siang dan malam, dan sedikit pun mereka tidak pernah merasa jemu.\n\nAllah berfirman:\n\nDan engkau (Muhammad) akan melihat malaikat-malaikat melingkar di sekeliling 'Arasy, bertasbih sambil memuji Tuhannya; lalu diberikan keputusan di antara mereka (hamba-hamba Allah) secara adil dan dikatakan, \"Segala puji bagi Allah, Tuhan seluruh alam.\" (az-Zumar/39: 75)",
          "39": "Ayat ini menerangkan bahwa di antara bukti-bukti kekuasaan Allah membangkitkan manusia di hari Kiamat nanti ialah bumi yang tandus dan mati, tidak ditumbuhi tumbuh-tumbuhan sedikit pun. Akan tetapi, apabila Dia menyirami tanah itu dengan air hujan dengan mengalirkan air kepadanya, maka bumi itu berubah menjadi hijau, karena tanahnya menjadi subur dan ditumbuhi tanam-tanaman.\n\nAllah berfirman:\n\nDan kamu lihat bumi ini kering, kemudian apabila telah Kami turunkan air (hujan) di atasnya, hiduplah bumi itu dan menjadi subur dan menumbuhkan berbagai jenis pasangan tetumbuhan yang indah. (al-hajj/22: 5)\n\nAyat ini berkaitan dengan tumbuhnya tumbuh-tumbuhan dengan adanya anugerah berupa air yang diturunkan dalam bentuk hujan. Pesan yang mirip, juga dapat ditemui pada Surah al-hajj/22 ayat 5, yang pada akhir ayatnya berbunyi: \"...Dan engkau melihat bumi kering kerontang, maka apabila Kami turunkan air di atasnya dia bergerak dan mengembang dan menumbuhkan berbagai jenis tanaman yang indah.\" Kata \"bergerak dan mengembang\" dikaitkan dengan gerakan butiran tanah saat biji tumbuhan berkecambah dan akarnya berkembang dan tumbuh hingga menjadi pohon dewasa.\n\nAllah yang telah menghidupkan bumi yang mati itu dengan menyiramkan air, dan menghidupkan tumbuh-tumbuhan, sehingga bumi itu menghijau, kuasa pula menghidupkan manusia yang telah mati, dan kuasa membangkitkannya dari kubur. Semuanya itu tidak ada yang sukar bagi-Nya. Semuanya mudah bagi-Nya. Dia Mahakuasa atas segala sesuatu.",
          "40": "Ayat ini menerangkan bahwa Allah Maha Mengetahui semua yang dilakukan dan tipu daya yang dibuat oleh orang-orang yang menentang Al-Qur'an menurut keinginan hawa nafsu mereka sendiri, mengingkari, dan mencelanya. Tidak ada sesuatu pun yang tersembunyi dan tidak diketahui Allah. Oleh karena itu, Dia akan membalas segala perbuatan mereka itu dengan ganjaran yang setimpal.\n\nKemudian Allah menerangkan perbedaan dan bentuk pembalasan yang akan diterima oleh orang-orang mukmin dan orang-orang kafir di akhirat nanti dengan mengatakan bahwa orang-orang yang dimasukkan ke dalam neraka karena mengingkari Allah, rasul, dan ayat-ayat-Nya tidak sama dengan orang-orang beriman yang memercayai ayat-ayat Al-Qur'an, mengikuti rasul-Nya, dan mendapat surga. Allah akan menetapkan keputusan dengan adil antara mereka dan balasan yang akan mereka peroleh tentu pula tidak sama.\n\nAyat ini ditujukan kepada seluruh manusia yang kafir dan mukmin. Akan tetapi, sebagian ulama berpendapat bahwa ayat ini berarti umum dan khusus. Umum meliputi seluruh manusia yang kafir dan beriman, khusus berhubungan dengan Abu Jahal yang mengingkari Rasulullah saw dan orang-orang yang beriman kepadanya.\n\nDiriwayatkan oleh 'Abd ar-Razzaq, Ibnu al-Mundzir, Ibnu Asakir dari Busyair bin Tamim, ia berkata, \"Ayat ini diturunkan berkenaan dengan Abu Jahal dan 'Ammar bin Yasir.\"\n\nPada akhir ayat ini, Allah menegaskan bahwa Nabi Muhammad telah mengetahui akibat yang diperoleh orang-orang yang berbuat dosa di akhirat nanti, dan akibat yang akan diperoleh orang-orang yang beriman kelak. Oleh karena itu, manusia dipersilakan untuk melakukan apa saja yang dikehendaki, ia telah mengetahui akibatnya. Allah melihat segala perbuatan manusia dan memberi balasan sesuai dengan yang telah diperbuatnya.",
          "41": "Pada ayat ini diterangkan tanda-tanda orang-orang yang ingkar itu ialah mengingkari ayat-ayat Allah, dan mengingkari Al-Qur'an ketika disampaikan kepada mereka. Mereka akan memperoleh ganjaran yang setimpal dengan kekafiran mereka itu.\n\nKemudian Allah menerangkan bahwa Al-Qur'an itu adalah sebuah kitab yang mulia, yang tidak dapat dibatalkan isinya, dan tidak dapat diubah-ubah sedikit pun.",
          "42": "Ayat ini menegaskan bahwa tidak ada sesuatu pun yang membatalkan ayat-ayat Al-Qur'an, walaupun itu kitab-kitab Allah yang terdahulu, seperti Taurat, Zabur, dan Injil, dan tidak satu pun kitab Allah yang datang setelah Al-Qur'an. Arti ini sesuai dengan pendapat Sa'id bin Jubair dan al-Kalbi.\n\nPada akhir ayat ini diterangkan bahwa seluruh Al-Qur'an itu benar, tidak ada yang salah sedikit pun, karena Al-Qur'an berasal dari Allah, Tuhan semesta alam. Semua yang berasal dari Allah adalah benar belaka, tidak ada satu pun yang kurang, yang salah, atau tidak sempurna. Dia Mahabijaksana dan Maha Terpuji.",
          "43": "Ayat ini merupakan hiburan Allah bagi Nabi saw yang sedih karena sikap dan perbuatan orang-orang musyrik terhadap Al-Qur'an yang disampaikannya. Allah mengatakan bahwa sikap, tindakan, dan ucapan-ucapan yang dilakukan orang-orang musyrik yang mendustakan ayat-ayat Allah itu, sama dengan tindakan dan ucapan-ucapan yang disampaikan oleh umat-umat terdahulu kepada rasul-rasul mereka. Walaupun demikian, mereka tetap bersabar dan tabah dalam menyampaikan risalahnya. Oleh karena itu, Nabi Muhammad juga diperintahkan untuk sabar dan tabah, sebagaimana rasul-rasul sebelumnya. Beliau juga diminta untuk tetap pada seruannya.\n\nAyat yang lain yang sama isinya dengan ayat ini ialah firman-Nya:\n\nDemikianlah setiap kali seorang Rasul yang datang kepada orang-orang yang sebelum mereka, mereka (kaumnya) pasti mengatakan, \"Dia itu pesihir atau orang gila.\" (adz-dzariyat/51: 52)\n\nSebagian ahli tafsir ada yang berpendapat bahwa maksud ayat ini adalah sesungguhnya yang disampaikan kepada Nabi Muhammad, seperti ajaran keesaan Allah, dan memurnikan ketaatan dan ketundukan hanya kepada-Nya, sama dengan yang pernah disampaikan kepada para rasul yang diutus sebelumnya. Hal ini adalah wajar karena agama Allah itu mempunyai azas dan prinsip yang sama. Semuanya sama-sama menentukan dan memerintahkan untuk menghambakan diri hanya kepada Allah, sama-sama percaya kepada adanya hari kebangkitan, dan sebagainya. Seandainya ada perbedaan, maka perbedaan itu bukanlah berhubungan dengan azas atau prinsip, tetapi hanyalah yang berhubungan dengan furu' atau yang bukan prinsip. Hal ini perlu karena perbedaan keadaan, masa, dan tempat.\n\nPenafsiran ini sesuai dengan firman Allah:\n\nSesungguhnya Kami mewahyukan kepadamu (Muhammad) sebagaimana Kami telah mewahyukan kepada Nuh dan nabi-nabi setelahnya¦ (an-Nisa'/4: 163)\n\nJika ayat ini dihubungkan dengan ayat-ayat yang sesudahnya, maka pendapat yang pertamalah yang lebih sesuai, karena pembicaraan ayat-ayat yang sesudahnya berhubungan dengan sikap orang-orang musyrik terhadap Al-Qur'an. Tetapi jika dihubungkan dengan ayat-ayat sebelumnya, maka pendapat yang kedualah yang sesuai, karena pembicaraan berhubungan dengan Al-Qur'an, sebagai wahyu yang di dalamnya tidak terdapat kesalahan dan kekurangan. Dalam penafsiran, ayat ini dimasukkan ke dalam kelompok ayat-ayat sesudahnya.\n\nPada akhir ayat ini diterangkan kepada Nabi Muhammad bahwa Tuhannya adalah Tuhan Yang Maha Esa. Yang berhak disembah itu adalah juga Tuhan Yang Maha Pengampun kepada hamba-hamba-Nya yang mau bertobat, dan juga memberi siksaan yang sangat pedih kepada orang-orang kafir lagi sombong dan tidak mau bertobat.",
          "44": "Ayat ini merupakan jawaban dari sikap dan ucapan orang-orang musyrik yang terdapat pada ayat-ayat yang sebelumnya. Kepada mereka disampaikan bahwa seandainya Allah menurunkan Al-Qur'an kepada Nabi Muhammad dengan salah satu bahasa selain dari bahasa Arab, tentu orang-orang Quraisy Mekah akan berkata, \"Mengapa Al-Qur'an tidak diturunkan dalam bahasa Arab? Sehingga kami mudah memahami hukum-hukum dan ketentuan-ketentuan yang terdapat di dalamnya.\" Padahal dulunya mereka berkata, \"Apakah Al-Qur'an yang diturunkan itu berbahasa selain Arab, sedang rasul yang diutus itu berbahasa Arab.\"\n\nAllah memerintahkan agar Rasulullah menjawab pertanyaan orang-orang musyrik yang tidak mau percaya kepada Al-Qur'an itu dengan berkata kepada mereka, \"Al-Qur'an ini bagi orang-orang yang percaya kepadanya, meyakini bahwa ia berasal dari Allah Yang Mahakuasa, dan percaya kepada rasul yang menyampaikannya, merupakan petunjuk ke jalan kebahagiaan, penawar hati, dan menghilangkan keragu-raguan. Ayat ini sejalan dengan firman Allah:\n\nWahai manusia! Sungguh, telah datang kepadamu pelajaran (Al-Qur'an) dari Tuhanmu, penyembuh bagi penyakit yang ada dalam dada dan petunjuk serta rahmat bagi orang yang beriman. (Yunus/10: 57)\n\nOrang-orang yang tidak beriman kepada Allah, rasul-Nya, dan Al-Qur'an, pada telinga mereka ada sumbatan yang menutup pendengaran mereka dari mendengar ayat-ayat Al-Qur'an. Mereka buta sehingga tidak dapat melihat bukti-bukti kebesaran dan kekuasaan Allah dan tidak dapat menerima pelajaran yang disampaikan rasul.\n\nOrang-orang yang tidak mendengar ayat-ayat Allah dan tidak dapat melihat bukti-bukti kebesaran dan kekuasaan-Nya diserupakan dengan orang yang diseru dari suatu tempat yang jauh, ia hanya dapat mendengar suara yang tidak jelas, sehingga ia tidak mengerti maksud suara itu.",
          "45": "Selanjutnya Allah menyampaikan kepada Nabi Muhammad agar tidak menyusahkan diri karena orang-orang Mekah itu berselisih pendapat tentang Al-Qur'an. Hal yang seperti itu telah dilakukan pula oleh umat-umat yang dahulu terhadap rasul-rasul yang diutus kepada mereka. Allah mengatakan bahwa Dia telah menurunkan Taurat kepada Musa, untuk disampaikan kepada Bani Israil. Mereka pun telah berselisih pendapat pula tentang Taurat itu. Ada yang membenarkan dan ada pula yang mendustakan. Ada yang beriman kepada Musa dan ada pula yang kafir kepadanya. Oleh karena itu, Nabi Muhammad diperintahkan untuk tidak berputus asa dalam menyampaikan agama Allah, dan bersabar menghadapi tindakan orang-orang kafir itu. Nabi saw juga diperintahkan untuk mengikuti jejak para rasul yang menyampaikan agama-Nya.\n\nKemudian Allah menyampaikan bahwa orang-orang kafir itu tidak segera menerima azab karena perbuatannya itu, karena azab itu ditangguhkan pelaksanaannya sampai kepada waktu yang ditentukan. Hal itu adalah sesuai dengan ketetapan-Nya bahwa Dia menangguhkan azab bagi orang-orang kafir sampai hari Kiamat. Seandainya tidak ada ketetapan yang demikian itu, tentu telah diputuskan Allah perselisihan mereka dengan orang-orang yang beriman.\n\nAllah berfirman:\n\nBahkan hari Kiamat itulah hari yang dijanjikan kepada mereka dan hari Kiamat itu lebih dahsyat dan lebih pahit. (al-Qamar/54: 46)\n\nDan firman Allah:\n\nDan janganlah engkau mengira, bahwa Allah lengah dari apa yang diperbuat oleh orang yang zalim. Sesungguhnya Allah menangguhkan mereka sampai hari yang pada waktu itu mata (mereka) terbelalak. (Ibrahim/14: 42)\n\nAllah menerangkan bahwa sebab-sebab kehancuran dan azab yang menimpa orang-orang musyrik adalah karena mereka sangat ragu-ragu dan bingung tentang Al-Qur'an. Karena bingung dan ragu, mereka mengingkarinya dan tidak mengindahkan dakwah Rasulullah.",
          "46": "Pada akhir ayat surah ini, Allah menerangkan balasan yang akan diberikan terhadap perbuatan-perbuatan yang dilakukan manusia. Barang siapa yang taat kepada Allah dan rasul-Nya dalam kehidupan dunia ini, melaksanakan perintah-perintah-Nya, dan menghentikan larangan-larangan-Nya, berarti ia telah berusaha berbuat kebaikan untuk dirinya sendiri dengan memperoleh pahala yang besar. Barang siapa yang ingkar kepada Allah berarti ia telah berusaha berbuat keburukan untuk dirinya dengan memperoleh siksa yang sangat pedih di akhirat nanti. Seseorang dihukum sesuai dengan perbuatan yang telah dilakukannya, mustahil Allah mengazab seseorang karena perbuatan orang lain.\n\nAllah berfirman:\n\nDan seseorang tidak akan memikul beban dosa orang lain. Kemudian kepada Tuhanmulah kamu kembali, dan akan diberitahukan-Nya kepadamu apa yang dahulu kamu perselisihkan. (al-An'am/6: 164)",
          "47": "Pada ayat ini Allah menerangkan bahwa ilmu tentang hari Kiamat, waktu dan bagaimana peristiwanya hanya diketahui Allah. Demikian pula peristiwa-peristiwa gaib yang lain seperti keluarnya dengan baik atau rusaknya buah-buahan dari kelopaknya, dan janin yang dikandung oleh para ibu, apakah akan lahir dengan normal atau cacat anggota tubuhnya, semua itu hanya diketahui oleh Allah secara pasti. Beberapa hal memang ada yang diketahui oleh manusia seperti bulan apa buah-buahan akan masak, kapan kira-kira bayi akan lahir, tetapi pengetahuan itu masih sangat sederhana tidak serinci pengetahuan Allah dan tidak selengkap pernyataan-Nya.\n\nPada ayat lain Allah menegaskan bahwa hanya Dialah yang mengetahui dengan tepat hari Kiamat itu. Allah berfirman:\n\nMereka menanyakan kepadamu (Muhammad) tentang Kiamat, \"Kapan terjadi?\" Katakanlah, \"Sesungguhnya pengetahuan tentang Kiamat itu ada pada Tuhanku; tidak ada (seorang pun) yang dapat menjelaskan waktu terjadinya selain Dia.\" (al-A'raf/7: 187)\n\nNabi Muhammad saw sendiri dalam hadis yang diriwayatkan 'Umar bin al-Khaththab ketika ditanya Malaikat Jibril tentang kapan hari Kiamat, beliau menjawab:\n\nSesungguhnya Jibril bertanya kepada Rasulullah tentang hari Kiamat, Rasulullah menjawab: orang yang ditanya tidak lebih tahu daripada yang bertanya (Riwayat Muslim dari 'Umar bin al-Khaththab)\n\nDalam perkembangan ilmu pengetahuan sekarang ini memang banyak hal-hal baru yang diketahui manusia seperti waktu musim berbuahnya beberapa macam buah-buahan, kondisi tentang janin dalam kandungan seperti jenis kelamin, kesehatan, dan kapan waktu janin akan lahir. Tetapi pengetahuan manusia ini masih sedikit sekali dibanding pengetahuan Allah dan masih bersifat perkiraan sehingga tidak pasti. Berbeda dengan pengetahuan Allah yang rinci dan pasti. Firman Allah swt:\n\nAllah mengetahui apa yang dikandung oleh setiap perempuan, apa yang kurang sempurna dan apa yang bertambah dalam rahim. Dan segala sesuatu ada ukuran di sisi-Nya.(Allah) Yang mengetahui semua yang gaib dan yang nyata; Yang Mahabesar, Mahatinggi. (ar-Ra'd/13: 8-9)\n\nDi atas telah diterangkan bahwa hanya Allah yang mengetahui tentang hari Kiamat dan kapan terjadinya. Dia mengetahui semua wanita yang hamil dan yang melahirkan anak. Dari keterangan ini dapat dipahami bahwa pengetahuan Allah itu ada yang mustahil diketahui oleh manusia dan ada yang mungkin diketahuinya bila Dia memberikan izin-Nya kepada manusia. Tentu saja hal ini ada hikmah dan tujuannya, tetapi hanyalah Allah yang mengetahui dengan pasti hakikat dari hikmah dan tujuannya itu. Sekalipun manusia diberikan sebagian pengetahuan Allah, namun sifat dan bentuk pengetahuan itu tidak sama dan berbeda pada setiap orang.\n\nAllah mengetahui kandungan semua wanita yang sedang hamil dan yang melahirkan. Pengetahuan Allah tentang wanita yang mengandung dan yang melahirkan adalah pengetahuan yang lengkap dan pasti, menyeluruh sampai kepada yang sekecil-kecilnya. Pengetahuan itu ada hubungannya dengan proses kejadian alam seluruhnya, dari dahulu sampai sekarang dan sampai kepada masa yang akan datang.\n\nLain halnya dengan pengetahuan seorang dokter ahli kandungan terhadap kandungan seorang wanita. Ia hanya mengetahui secara umum saja, tidak secara rinci. Bahkan pengetahuannya itu terbatas dan bersifat dugaan semata, bukan pengetahuan yang pasti karena pengetahuan yang pasti dan menyeluruh itu hanya pada Allah.\n\nSelanjutnya Allah menerangkan peristiwa yang akan dialami oleh orang-orang musyrik pada hari Kiamat. Pada hari itu Allah akan menanyakan kepada mereka secara tegas dan jelas serta meminta pertanggungjawaban mereka tentang sekutu-sekutu-Nya yang mereka sembah di dunia; di mana mereka berada sekarang, mengapa mereka tidak bersama-sama dengan berhala-berhala itu. Akhirnya orang-orang musyrik itu menjawab dengan jawaban yang tegas, \"Wahai Tuhan kami, kami nyatakan kepada-Mu pada hari ini tidak seorang pun di antara kami yang mengakui bahwa Engkau mempunyai sekutu; hanya Engkau sajalah yang kami sembah, tidak ada yang lain.\"\n\nFirman Allah yang lain yang sama artinya dengan ayat ini:\n\nKemudian tidaklah ada jawaban bohong mereka, kecuali mengatakan, \"Demi Allah, ya Tuhan kami, tidaklah kami mempersekutukan Allah.\" (al-An'am/6: 23)",
          "48": "Ayat ini menerangkan bahwa pada hari Kiamat orang-orang musyrik yang sesat itu tidak melihat adanya manfaat dari sembahan-sembahan yang mereka sembah di dunia dahulu, yaitu pada hari mereka merasakan tidak ada faedahnya semua yang telah mereka lakukan di dunia dahulu. Tidak ada seorang pun yang dapat menghindarkan mereka dari azab Allah. Ketika itu barulah mereka yakin akan keesaan dan kekuasaan Allah dan mereka juga yakin bahwa tidak ada satu jalan keluar pun untuk menghindarkan diri dari azab Allah itu.",
          "49": "Ayat ini menerangkan keinginan-keinginan manusia untuk mencapai hal-hal yang menyangkut kepentingan dirinya. Sebagian besar manusia adalah orang-orang yang tamak, suka mencari harta dan mencari kesenangan untuk dirinya sendiri.\n\nMereka menginginkan harta dan kekuasaan, karena menurut mereka dengan harta dan kekuasaan itu semua cita-cita dan keinginannya akan tercapai. Mereka ingin keturunan, karena dengan keturunan itu mereka dapat mewariskan semua harta yang mereka peroleh dan akan selalu ada orang yang mengenang jasa dan keberhasilan mereka selama hidup di dunia. Mereka ingin memperoleh harta benda dunia sebanyak-banyaknya, karena itu mereka berlomba-lomba mencapainya, seakan-akan hidup dan kehidupan mereka dihabiskan untuk itu.\n\nDalam ayat ini, yang selalu diinginkan dan dicari manusia itu disebut \"khair\" (kebaikan). Disebut \"khair\" karena yang diinginkan manusia itu adalah kebaikan yang merupakan rahmat dan karunia Allah. Rahmat dan karunia Allah itu mereka jadikan tujuan yang harus dicapai dalam hidup dan kehidupan mereka di dunia ini, bukan sebagai alat atau jalan yang dapat mereka pergunakan untuk mencapai sesuatu yang lebih mulia dan lebih tinggi nilainya, sehingga rahmat dan karunia Allah yang semula adalah baik, mereka jadikan sumber bencana dan malapetaka karena hawa nafsu mereka yang dapat menimpa diri mereka sendiri atau orang lain.\n\nYang dimaksud dengan \"mencari kebaikan\" dalam ayat ini ialah menginginkan, berusaha, mencari, menuntut dan menjadikan kebaikan itu sebagai alat dan jalan mencapai tujuan hidup di dunia dan akhirat, bukan untuk mencari kebaikan agar kebaikan itu dapat dijadikan alat dan jalan mencapai tujuan yang diinginkan hawa nafsu. Mencari kebaikan untuk memenuhi keinginan hawa nafsu dapat menimbulkan malapetaka bagi yang mencarinya. Tetapi, jika mencari kebaikan itu tujuannya agar kebaikan itu dapat dijadikan alat dan jalan untuk mencari keridaan Allah, maka mencari kebaikan yang demikian dianjurkan oleh agama Islam.\n\nMisalnya, seseorang berusaha mencari harta yang halal agar dengan harta itu ia dapat melaksanakan tugas dan kewajibannya sebagai hamba Allah, seperti memberi nafkah keluarganya, berinfak di jalan Allah, menolong fakir miskin, dan sebagainya. Demikian pula, orang yang ingin mencari pangkat dan kekuasaan, ia boleh mencarinya dengan maksud menegakkan keadilan, menegakkan hukum-hukum Allah, dan menolong orang-orang yang sengsara. Usaha yang demikian adalah usaha yang terpuji dan diridai Allah.\n\nJadi, mencari kebaikan itu pada hakikatnya baik jika kebaikan yang diperoleh itu dijadikan alat dan jalan untuk mencari keridaan Allah. Tetapi, mencari kebaikan itu akan merusak dirinya jika kebaikan itu digunakan untuk memenuhi hawa nafsusnya. \n\nSifat manusia yang lain ialah jika kebaikan yang dicarinya itu tidak diperolehnya atau mereka ditimpa suatu musibah, maka mereka menjadi putus asa, seakan-akan tidak ada harapan lagi bagi mereka, tidak ada lagi bumi tempat berpijak dan tidak ada lagi langit tempat berteduh, semua yang mereka inginkan itu seakan-akan sirna. Dalam keadaan yang demikian, mereka menjadi berputus asa dari rahmat Allah dan berprasangka buruk terhadap Allah seakan-akan Allah tidak mempunyai sifat kasih sayang dan bukan Maha Pemberi rahmat kepada hamba-hamba-Nya.\n\nSifat-sifat yang diterangkan oleh ayat ini adalah sifat-sifat orang yang tidak beriman dan tidak memurnikan ketaatan dan kepatuhannya kepada Allah. Mereka masih percaya kepada adanya kekuatan-kekuatan lain yang dapat menolong mereka selain dari kekuatan Allah. Seakan-akan mereka tidak percaya akan adanya rahmat dan karunia-Nya dan tidak percaya adanya kehidupan yang sebenarnya yaitu kehidupan akhirat nanti.\n\nAda pun orang-orang yang beriman kepada Allah, adalah orang-orang yang tunduk dan patuh kepada-Nya, merasakan keagungan dan kebesaran-Nya dan merasa dirinya bergantung kepada rahmat dan karunia-Nya. Mereka percaya akan adanya kehidupan yang hakiki yaitu kehidupan di akhirat, dan mereka percaya bahwa kehidupan dunia hanya bersifat sementara. Karenanya mereka berusaha dan bekerja semata-mata untuk mencari keridaan-Nya. Mereka juga percaya bahwa Allah selain menguji hamba-hamba-Nya yang beriman dan ujian itu selalu diberikan dalam bermacam-macam bentuk, ada yang berupa kesengsaraan dan penderitaan, dan ada pula yang berbentuk kesenangan dan kekayaan. Apa pun wujud ujian dan cobaan itu, dihadapinya dengan sabar dan tawakal. Jika mereka memperoleh kebaikan dan harta, ia bergembira dan bersyukur kepada-Nya dan jika ditimpa musibah, mereka tetap sabar dan tabah, bahkan semakin mendekatkan diri kepada-Nya. Mereka tetap mengharapkan rahmat dan karunia Allah karena benar-benar yakin akan sifat kasih sayang Allah yang melimpahkan rahmat dan karunia-Nya kepada setiap hamba yang beriman kepada-Nya. Allah swt berfirman:\n\nWahai anak-anakku! Pergilah kamu, carilah (berita) tentang Yusuf dan saudaranya dan jangan kamu berputus asa dari rahmat Allah. Sesungguhnya yang berputus asa dari rahmat Allah, hanyalah orang-orang yang kafir.\" (Yusuf/12: 87)",
          "50": "Pada ayat ini Allah menerangkan sifat-sifat kebanyakan manusia, yaitu jika mereka mendapat nikmat dan kesenangan mereka menjadi lupa dan sombong sehingga menyatakan, \"Ini adalah hasil kerjaku sendiri, sehingga aku tidak perlu memberikan sebagian hartaku ini kepada orang lain, dan tidak perlu bersyukur kepada siapapun. Aku juga tidak yakin apakah hari Kiamat itu akan datang?\"\n\nSelanjutnya orang-orang kafir itu juga menyatakan jika aku akan dikembalikan kepada Allah maka aku pasti akan memperoleh kebaikan pula pada sisinya. Demikian cara berfikir mereka yang tidak jelas dan hanya berdasarkan perkiraan-perkiraan saja. Maka ayat ini diakhiri dengan ketegasan bahwa Allah benar-benar akan memberitakan kepada orang-orang kafir apa yang mereka lakukan di dunia dan akan menimpakan azab yang pedih kepada mereka di akhirat.\n\nAdapun sifat-sifat orang yang putus asa dari rahmat Allah yaitu sebagai berikut:\n\n1. Jika kesengsaraan dan kesulitan yang sedang mereka derita tiba-tiba dihilangkan dari mereka, kemudian mereka dianugerahi rahmat dan karunia, mereka lupa kepada kesengsaraan dan penderitaan yang pernah mereka alami, mereka lupa kepada sumber rahmat dan karunia yang mereka terima itu, bahkan mereka mengatakan bahwa semua yang mereka peroleh itu semata-mata karena hasil usaha dan kepandaian mereka sendiri, bukan karena anugerah Allah. Yang dimaksud dengan perkataan hadha li dalam ayat ini ialah: Ini aku peroleh karena hasil usaha dan kepandaianku sendiri, karena itu semua yang aku peroleh benar-benar milikku dan tidak seorang pun yang bersamaku dalam kepemilikan ini. Karena itu, aku tidak perlu membagikannya kepada orang lain dan tidak perlu memanjatkan puja dan puji kepada Allah dan mengingat akan karunia dan kebaikan-Nya.\n\n2. Mereka tidak percaya adanya hari Kiamat. Ketidakpercayaan ini timbul karena sifat angkuh dan takabur yang ada pada diri mereka dan karena kesenangan hidup di dunia yang sedang mereka nikmati.\n\n3. Mereka mengatakan tidak ada hisab, tidak ada hari pembalasan. Menurut mereka jika mereka dikembalikan kepada Allah nanti, tentu mereka akan memperoleh kebaikan dan kesenangan yang banyak pula.\n\nPada akhir ayat ini Allah mengancam orang-orang kafir yang tidak percaya akan hari Kiamat, hari pembalasan, dan adanya surga dan neraka. Allah menegaskan bahwa orang-orang kafir itu benar-benar akan mengalami hari Kiamat. Mereka akan menyaksikan sendiri perbuatan-perbuatan jahat yang pernah mereka kerjakan. Kemudian Allah menimbang semua yang pernah mereka perbuat dan memberikan balasan yang setimpal bagi perbuatan jahat yang telah mereka kerjakan itu dengan azab yang berat di dalam neraka.",
          "51": "Ayat ini menerangkan bahwa sifat tidak baik manusia yang lain ialah, jika mereka diberi rahmat dan karunia, mereka asyik dengan rahmat dan karunia itu, mereka terlalu senang dan bahagia sehingga mereka lupa akan sumber rahmat dan karunia itu. Bahkan kadang-kadang mereka bertindak lebih jauh dari itu. Mereka menggunakan rahmat dan karunia itu untuk menantang dan menghancurkan agama Allah: mereka membuat kerusakan di bumi, memutuskan silaturrahim dengan manusia yang lain yang diperintahkan Allah untuk menghubungkannya. Mereka merasa telah menjadi orang yang berkuasa sehingga orang lain yang berada di bawah kekuasaannya wajib hormat dan mengabdi kepadanya. Mereka telah lupa bahwa mereka adalah manusia yang harus bertindak sesuai dengan kodratnya, yaitu hanya dapat hidup dengan pertolongan manusia yang lain serta pertolongan Yang Maha Menolong yaitu Allah.\n\nSebaliknya, jika mereka ditimpa musibah atau malapetaka, mereka kembali mengingat Allah. Mereka berdoa kepada Allah dalam keadaan berbaring, duduk, berdiri, berjalan, dan dalam keadaan bagaimana pun. Bahkan mereka berjanji dan bersumpah dengan menyebut nama-Nya jika mereka dihindarkan dari musibah dan malapetaka itu, mereka menjadi orang-orang yang beriman. Sejalan dengan ayat ini, firman Allah:\n\nDan apabila manusia ditimpa bahaya dia berdoa kepada Kami dalam keadaan berbaring, duduk atau berdiri, tetapi setelah Kami hilangkan bahaya itu darinya, dia kembali (ke jalan yang sesat), seolah-olah dia tidak pernah berdoa kepada Kami untuk (menghilangkan) bahaya yang telah menimpanya. Demikianlah dijadikan terasa indah bagi orang-orang yang melampaui batas apa yang mereka kerjakan. (Yunus/10: 12)",
          "52": "Ayat ini menerangkan bahwa sebenarnya orang-orang musyrik itu dalam keadaan ragu-ragu terhadap kebenaran Al-Qur'an dan terhadap Muhammad saw sebagai utusan Allah. Keadaan mereka antara membenarkan dan mengingkari. Mereka mengakui Muhammad saw sebagai seorang terpercaya serta disegani dan pemimpin yang dapat menyelesaikan persoalan-persoalan yang timbul di kalangan suku Quraisy. Demikian pula, mereka mengagumi isi dan ketinggian gaya bahasa Al-Qur'an yang menurut mereka mustahil bagi seorang manusia dapat membuatnya. Tetapi, mereka masih dipengaruhi oleh kepercayaan nenek moyang mereka di samping khawatir akan timbulnya sikap antipati dari kaum mereka sendiri. Jika mereka menyatakan apa yang terkandung dalam hati mereka, tentu mereka tidak lagi dijadikan pemimpin oleh kaumnya; mereka akan kehilangan pengaruh. Sikap ragu-ragu inilah yang selalu berkecamuk dalam pikiran mereka.\n\nDalam keadaan yang demikian itulah, Allah memerintahkan Rasul-Nya menanyakan kepada orang-orang musyrik yang sesat itu. \"Wahai orang-orang musyrik, bagaimana pendapatmu seandainya Al-Qur'an itu benar-benar dari Allah, sedangkan kamu mengingkari kebenarannya? Jika demikian halnya, tentulah kamu semua termasuk orang-orang yang sesat dan menjauhkan diri dari kebenaran?\" Seakan-akan dengan pertanyaan itu Allah menyatakan dengan tegas bahwa sikap ragu-ragu itulah nanti yang akan membawa mereka ke dalam lembah kesesatan dan penyesalan yang tidak habis-habisnya di akhirat nanti.",
          "53": "Ayat ini menerangkan bahwa orang-orang musyrik yang ragu-ragu kepada Al-Qur'an dan Rasulullah itu akan melihat dengan mata kepala mereka bukti-bukti kebenaran ayat-ayat Allah di segenap penjuru dunia dan pada diri mereka sendiri. Mereka melihat dan menyaksikan sendiri kaum Muslimin dalam keadaan lemah dan tertindas selama berada di Mekah kemudian Rasulullah dan para sahabatnya hijrah ke Medinah meninggalkan kampung halaman yang mereka cintai. Rasulullah saw selama di Medinah bersama kaum Muhajirin dan Ansar membentuk dan membina masyarakat Islam. Masyarakat baru itu semakin lama semakin kuat dan berkembang. Hal ini dirasakan oleh orang-orang musyrik di Mekah, karena itu mereka pun selalu berusaha agar kekuatan baru itu dapat segera dipatahkan. Kekuatan Islam dan kaum Muslimin pertama kali dirasakan oleh orang musyrik Mekah adalah ketika Perang Badar dan kemudian ketika mereka dicerai-beraikan dalam Perang Khandak. Yang terakhir ialah di waktu Rasulullah saw dan kaum Muslimin menaklukkan kota Mekah tanpa perlawanan dari orang-orang musyrik. Akhirnya mereka menyaksikan manusia berbondong-bondong masuk Islam, termasuk orang-orang musyrik, keluarga, dan teman mereka sendiri. Semuanya itu merupakan bukti-bukti kebenaran ayat-ayat Allah. Allah berfirman:\n\nApabila telah datang pertolongan Allah dan kemenangan,dan engkau melihat manusia berbondong-bondong masuk agama Allah, maka bertasbihlah dengan memuji Tuhanmu dan mohonlah ampunan kepada-Nya. Sungguh, Dia Maha Penerima tobat. (an-Nasr/110: 1-3)\n\nPada akhir ayat ini, Allah menegaskan lagi bahwa Dia menyaksikan segala perilaku hamba-hamba-Nya, baik berupa perkataan, perbuatan atau tingkah laku, dan Dia Maha Mengetahui segala isi hati manusia. Dia menyatakan bahwa Muhammad saw adalah seorang yang benar, tidak pernah berbohong, semua yang disampaikannya sungguh benar, Allah berfirman:\n\nTetapi Allah menjadi saksi atas (Al-Qur'an) yang diturunkan-Nya kepadamu (Muhammad). Dia menurunkannya dengan ilmu-Nya. (an-Nisa'/4: 166)\n\nBanyak orang mengatakan bahwa dengan mempelajari alam, termasuk diri kita sendiri, dapat membawa kepada pemahaman tentang adanya Tuhan. Alam adalah buku yang menanti untuk dipelajari. Akan tetapi, harapan Tuhan dalam menurunkan ayat di atas tidak selalu dipahami manusia. Surah Yunus/10: 101 adalah salah satu di antara banyak ayat yang memberitahu kita bahwa hanya ilmuwan yang memiliki keimananlah yang dapat memahami Tuhan dengan mempelajari alam.\n\nKatakanlah, \"Perhatikanlah apa yang ada di langit dan di bumi!\" Tidaklah bermanfaat tanda-tanda (kebesaran Allah) dan rasul-rasul yang memberi peringatan bagi orang yang tidak beriman. (Yunus/10: 101)",
          "54": "Ayat ini menerangkan keragu-raguan mereka tentang adanya hari kebangkitan dan hari pembalasan, karena menurut mereka, mustahil orang yang telah mati dapat hidup kembali dan mustahil pula tubuh-tubuh yang telah hancur-luluh bersama tanah itu dapat dikumpulkan, dikembalikan seperti semula dan dapat hidup kembali. Karena keragu-raguan itulah mereka menjadi tidak mampu memperhatikan kebenaran Al-Qur'an dan kerasulan Muhammad saw.\n\nPada akhir ayat ini Allah memperingatkan orang-orang musyrik dengan peringatan yang keras bahwa Dia Maha Mengetahui segala sesautu. Tidak ada satu pun yang luput dari pengetahuan-Nya. Karena itu Dia akan memberikan balasan dengan seadil-adilnya kepada hamba-hamba-Nya."
        }
      }
    }
  }
}