{
  "name": "Al-Ahqaf",
  "name_translations": {
    "ar": "الأحقاف",
    "en": "The Dunes",
    "id": "Bukit Pasir"
  },
  "number_of_ayah": 35,
  "number_of_surah": 46,
  "place": "Mecca",
  "recitations": [{
    "name": "Mishari Rashid al-`Afasy",
    "audio_url": "https://download.quranicaudio.com/quran/mishaari_raashid_al_3afaasee/046.mp3"
  }, {
    "name": "Abdur-Rahman as-Sudais",
    "audio_url": "https://download.quranicaudio.com/quran/abdurrahmaan_as-sudays/046.mp3"
  }, {
    "name": "Saad al-Ghamdi",
    "audio_url": "https://download.quranicaudio.com/quran/sa3d_al-ghaamidi/complete/046.mp3"
  }],
  "type": "Makkiyah",
  "verses": [{
    "number": 1,
    "text": "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ حمٓ",
    "translation_en": "Ha, Meem.",
    "translation_id": "Haa Miim."
  }, {
    "number": 2,
    "text": "تَنزِيلُ ٱلْكِتَٰبِ مِنَ ٱللَّهِ ٱلْعَزِيزِ ٱلْحَكِيمِ",
    "translation_en": "The revelation of the Book is from Allah, the Exalted in Might, the Wise.",
    "translation_id": "Diturunkan Kitab ini dari Allah Yang Maha Perkasa lagi Maha Bijaksana."
  }, {
    "number": 3,
    "text": "مَا خَلَقْنَا ٱلسَّمَٰوَٰتِ وَٱلْأَرْضَ وَمَا بَيْنَهُمَآ إِلَّا بِٱلْحَقِّ وَأَجَلٍ مُّسَمًّى وَٱلَّذِينَ كَفَرُوا۟ عَمَّآ أُنذِرُوا۟ مُعْرِضُونَ",
    "translation_en": "We did not create the heavens and earth and what is between them except in truth and [for] a specified term. But those who disbelieve, from that of which they are warned, are turning away.",
    "translation_id": "Kami tiada menciptakan langit dan bumi dan apa yang ada antara keduanya melainkan dengan (tujuan) yang benar dan dalam waktu yang ditentukan. Dan orang-orang yang kafir berpaling dari apa yang diperingatkan kepada mereka."
  }, {
    "number": 4,
    "text": "قُلْ أَرَءَيْتُم مَّا تَدْعُونَ مِن دُونِ ٱللَّهِ أَرُونِى مَاذَا خَلَقُوا۟ مِنَ ٱلْأَرْضِ أَمْ لَهُمْ شِرْكٌ فِى ٱلسَّمَٰوَٰتِ ٱئْتُونِى بِكِتَٰبٍ مِّن قَبْلِ هَٰذَآ أَوْ أَثَٰرَةٍ مِّنْ عِلْمٍ إِن كُنتُمْ صَٰدِقِينَ",
    "translation_en": "Say, [O Muhammad], \"Have you considered that which you invoke besides Allah? Show me what they have created of the earth; or did they have partnership in [creation of] the heavens? Bring me a scripture [revealed] before this or a [remaining] trace of knowledge, if you should be truthful.\"",
    "translation_id": "Katakanlah: \"Terangkanlah kepadaku tentang apa yang kamu sembah selain Allah; perlihatkan kepada-Ku apakah yang telah mereka ciptakan dari bumi ini atau adakah mereka berserikat (dengan Allah) dalam (penciptaan) langit? Bawalah kepada-Ku Kitab yang sebelum (Al Quran) ini atau peninggalan dari pengetahuan (orang-orang dahulu), jika kamu adalah orang-orang yang benar\""
  }, {
    "number": 5,
    "text": "وَمَنْ أَضَلُّ مِمَّن يَدْعُوا۟ مِن دُونِ ٱللَّهِ مَن لَّا يَسْتَجِيبُ لَهُۥٓ إِلَىٰ يَوْمِ ٱلْقِيَٰمَةِ وَهُمْ عَن دُعَآئِهِمْ غَٰفِلُونَ",
    "translation_en": "And who is more astray than he who invokes besides Allah those who will not respond to him until the Day of Resurrection, and they, of their invocation, are unaware.",
    "translation_id": "Dan siapakah yang lebih sesat daripada orang yang menyembah sembahan-sembahan selain Allah yang tiada dapat memperkenankan (doa)nya sampai hari kiamat dan mereka lalai dari (memperhatikan) doa mereka?"
  }, {
    "number": 6,
    "text": "وَإِذَا حُشِرَ ٱلنَّاسُ كَانُوا۟ لَهُمْ أَعْدَآءً وَكَانُوا۟ بِعِبَادَتِهِمْ كَٰفِرِينَ",
    "translation_en": "And when the people are gathered [that Day], they [who were invoked] will be enemies to them, and they will be deniers of their worship.",
    "translation_id": "Dan apabila manusia dikumpulkan (pada hari kiamat) niscaya sembahan-sembahan itu menjadi musuh mereka dan mengingkari pemujaan-pemujaan mereka."
  }, {
    "number": 7,
    "text": "وَإِذَا تُتْلَىٰ عَلَيْهِمْ ءَايَٰتُنَا بَيِّنَٰتٍ قَالَ ٱلَّذِينَ كَفَرُوا۟ لِلْحَقِّ لَمَّا جَآءَهُمْ هَٰذَا سِحْرٌ مُّبِينٌ",
    "translation_en": "And when Our verses are recited to them as clear evidences, those who disbelieve say of the truth when it has come to them, \"This is obvious magic.\"",
    "translation_id": "Dan apabila dibacakan kepada mereka ayat-ayat Kami yang menjelaskan, berkatalah orang-orang yang mengingkari kebenaran ketika kebenaran itu datang kepada mereka: \"Ini adalah sihir yang nyata\"."
  }, {
    "number": 8,
    "text": "أَمْ يَقُولُونَ ٱفْتَرَىٰهُ قُلْ إِنِ ٱفْتَرَيْتُهُۥ فَلَا تَمْلِكُونَ لِى مِنَ ٱللَّهِ شَيْـًٔا هُوَ أَعْلَمُ بِمَا تُفِيضُونَ فِيهِ كَفَىٰ بِهِۦ شَهِيدًۢا بَيْنِى وَبَيْنَكُمْ وَهُوَ ٱلْغَفُورُ ٱلرَّحِيمُ",
    "translation_en": "Or do they say, \"He has invented it?\" Say, \"If I have invented it, you will not possess for me [the power of protection] from Allah at all. He is most knowing of that in which you are involved. Sufficient is He as Witness between me and you, and He is the Forgiving the Merciful.\"",
    "translation_id": "Bahkan mereka mengatakan: \"Dia (Muhammad) telah mengada-adakannya (Al Quran)\". Katakanlah: \"Jika aku mengada-adakannya, maka kamu tiada mempunyai kuasa sedikitpun mempertahankan aku dari (azab) Allah itu. Dia lebih mengetahui apa-apa yang kamu percakapkan tentang Al Quran itu. Cukuplah Dia menjadi saksi antaraku dan antaramu dan Dialah Yang Maha Pengampun lagi Maha Penyayang\"."
  }, {
    "number": 9,
    "text": "قُلْ مَا كُنتُ بِدْعًا مِّنَ ٱلرُّسُلِ وَمَآ أَدْرِى مَا يُفْعَلُ بِى وَلَا بِكُمْ إِنْ أَتَّبِعُ إِلَّا مَا يُوحَىٰٓ إِلَىَّ وَمَآ أَنَا۠ إِلَّا نَذِيرٌ مُّبِينٌ",
    "translation_en": "Say, \"I am not something original among the messengers, nor do I know what will be done with me or with you. I only follow that which is revealed to me, and I am not but a clear warner.\"",
    "translation_id": "Katakanlah: \"Aku bukanlah rasul yang pertama di antara rasul-rasul dan aku tidak mengetahui apa yang akan diperbuat terhadapku dan tidak (pula) terhadapmu. Aku tidak lain hanyalah mengikuti apa yang diwahyukan kepadaku dan aku tidak lain hanyalah seorang pemberi peringatan yang menjelaskan\"."
  }, {
    "number": 10,
    "text": "قُلْ أَرَءَيْتُمْ إِن كَانَ مِنْ عِندِ ٱللَّهِ وَكَفَرْتُم بِهِۦ وَشَهِدَ شَاهِدٌ مِّنۢ بَنِىٓ إِسْرَٰٓءِيلَ عَلَىٰ مِثْلِهِۦ فَـَٔامَنَ وَٱسْتَكْبَرْتُمْ إِنَّ ٱللَّهَ لَا يَهْدِى ٱلْقَوْمَ ٱلظَّٰلِمِينَ",
    "translation_en": "Say, \"Have you considered: if the Qur'an was from Allah, and you disbelieved in it while a witness from the Children of Israel has testified to something similar and believed while you were arrogant...?\" Indeed, Allah does not guide the wrongdoing people.",
    "translation_id": "Katakanlah: \"Terangkanlah kepadaku, bagaimanakah pendapatmu jika Al Quran itu datang dari sisi Allah, padahal kamu mengingkarinya dan seorang saksi dari Bani Israil mengakui (kebenaran) yang serupa dengan (yang tersebut dalam) Al Quran lalu dia beriman, sedang kamu menyombongkan diri. Sesungguhnya Allah tiada memberi petunjuk kepada orang-orang yang zalim\"."
  }, {
    "number": 11,
    "text": "وَقَالَ ٱلَّذِينَ كَفَرُوا۟ لِلَّذِينَ ءَامَنُوا۟ لَوْ كَانَ خَيْرًا مَّا سَبَقُونَآ إِلَيْهِ وَإِذْ لَمْ يَهْتَدُوا۟ بِهِۦ فَسَيَقُولُونَ هَٰذَآ إِفْكٌ قَدِيمٌ",
    "translation_en": "And those who disbelieve say of those who believe, \"If it had [truly] been good, they would not have preceded us to it.\" And when they are not guided by it, they will say, \"This is an ancient falsehood.\"",
    "translation_id": "Dan orang-orang kafir berkata kepada orang-orang yang beriman: \"Kalau sekiranya di (Al Quran) adalah suatu yang baik, tentulah mereka tiada mendahului kami (beriman) kepadanya. Dan karena mereka tidak mendapat petunjuk dengannya maka mereka akan berkata: \"Ini adalah dusta yang lama\"."
  }, {
    "number": 12,
    "text": "وَمِن قَبْلِهِۦ كِتَٰبُ مُوسَىٰٓ إِمَامًا وَرَحْمَةً وَهَٰذَا كِتَٰبٌ مُّصَدِّقٌ لِّسَانًا عَرَبِيًّا لِّيُنذِرَ ٱلَّذِينَ ظَلَمُوا۟ وَبُشْرَىٰ لِلْمُحْسِنِينَ",
    "translation_en": "And before it was the scripture of Moses to lead and as a mercy. And this is a confirming Book in an Arabic tongue to warn those who have wronged and as good tidings to the doers of good.",
    "translation_id": "Dan sebelum Al Quran itu telah ada kitab Musa sebagai petunjuk dan rahmat. Dan ini (Al Quran) adalah kitab yang membenarkannya dalam bahasa Arab untuk memberi peringatan kepada orang-orang yang zalim dan memberi kabar gembira kepada orang-orang yang berbuat baik."
  }, {
    "number": 13,
    "text": "إِنَّ ٱلَّذِينَ قَالُوا۟ رَبُّنَا ٱللَّهُ ثُمَّ ٱسْتَقَٰمُوا۟ فَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
    "translation_en": "Indeed, those who have said, \"Our Lord is Allah,\" and then remained on a right course - there will be no fear concerning them, nor will they grieve.",
    "translation_id": "Sesungguhnya orang-orang yang mengatakan: \"Tuhan kami ialah Allah\", kemudian mereka tetap istiqamah maka tidak ada kekhawatiran terhadap mereka dan mereka tiada (pula) berduka cita."
  }, {
    "number": 14,
    "text": "أُو۟لَٰٓئِكَ أَصْحَٰبُ ٱلْجَنَّةِ خَٰلِدِينَ فِيهَا جَزَآءًۢ بِمَا كَانُوا۟ يَعْمَلُونَ",
    "translation_en": "Those are the companions of Paradise, abiding eternally therein as reward for what they used to do.",
    "translation_id": "Mereka itulah penghuni-penghuni surga, mereka kekal di dalamnya; sebagai balasan atas apa yang telah mereka kerjakan."
  }, {
    "number": 15,
    "text": "وَوَصَّيْنَا ٱلْإِنسَٰنَ بِوَٰلِدَيْهِ إِحْسَٰنًا حَمَلَتْهُ أُمُّهُۥ كُرْهًا وَوَضَعَتْهُ كُرْهًا وَحَمْلُهُۥ وَفِصَٰلُهُۥ ثَلَٰثُونَ شَهْرًا حَتَّىٰٓ إِذَا بَلَغَ أَشُدَّهُۥ وَبَلَغَ أَرْبَعِينَ سَنَةً قَالَ رَبِّ أَوْزِعْنِىٓ أَنْ أَشْكُرَ نِعْمَتَكَ ٱلَّتِىٓ أَنْعَمْتَ عَلَىَّ وَعَلَىٰ وَٰلِدَىَّ وَأَنْ أَعْمَلَ صَٰلِحًا تَرْضَىٰهُ وَأَصْلِحْ لِى فِى ذُرِّيَّتِىٓ إِنِّى تُبْتُ إِلَيْكَ وَإِنِّى مِنَ ٱلْمُسْلِمِينَ",
    "translation_en": "And We have enjoined upon man, to his parents, good treatment. His mother carried him with hardship and gave birth to him with hardship, and his gestation and weaning [period] is thirty months. [He grows] until, when he reaches maturity and reaches [the age of] forty years, he says, \"My Lord, enable me to be grateful for Your favor which You have bestowed upon me and upon my parents and to work righteousness of which You will approve and make righteous for me my offspring. Indeed, I have repented to You, and indeed, I am of the Muslims.\"",
    "translation_id": "Kami perintahkan kepada manusia supaya berbuat baik kepada dua orang ibu bapaknya, ibunya mengandungnya dengan susah payah, dan melahirkannya dengan susah payah (pula). Mengandungnya sampai menyapihnya adalah tiga puluh bulan, sehingga apabila dia telah dewasa dan umurnya sampai empat puluh tahun ia berdoa: \"Ya Tuhanku, tunjukilah aku untuk mensyukuri nikmat Engkau yang telah Engkau berikan kepadaku dan kepada ibu bapakku dan supaya aku dapat berbuat amal yang saleh yang Engkau ridhai; berilah kebaikan kepadaku dengan (memberi kebaikan) kepada anak cucuku. Sesungguhnya aku bertaubat kepada Engkau dan sesungguhnya aku termasuk orang-orang yang berserah diri\"."
  }, {
    "number": 16,
    "text": "أُو۟لَٰٓئِكَ ٱلَّذِينَ نَتَقَبَّلُ عَنْهُمْ أَحْسَنَ مَا عَمِلُوا۟ وَنَتَجَاوَزُ عَن سَيِّـَٔاتِهِمْ فِىٓ أَصْحَٰبِ ٱلْجَنَّةِ وَعْدَ ٱلصِّدْقِ ٱلَّذِى كَانُوا۟ يُوعَدُونَ",
    "translation_en": "Those are the ones from whom We will accept the best of what they did and overlook their misdeeds, [their being] among the companions of Paradise. [That is] the promise of truth which they had been promised.",
    "translation_id": "Mereka itulah orang-orang yang Kami terima dari mereka amal yang baik yang telah mereka kerjakan dan Kami ampuni kesalahan-kesalahan mereka, bersama penghuni-penghuni surga, sebagai janji yang benar yang telah dijanjikan kepada mereka."
  }, {
    "number": 17,
    "text": "وَٱلَّذِى قَالَ لِوَٰلِدَيْهِ أُفٍّ لَّكُمَآ أَتَعِدَانِنِىٓ أَنْ أُخْرَجَ وَقَدْ خَلَتِ ٱلْقُرُونُ مِن قَبْلِى وَهُمَا يَسْتَغِيثَانِ ٱللَّهَ وَيْلَكَ ءَامِنْ إِنَّ وَعْدَ ٱللَّهِ حَقٌّ فَيَقُولُ مَا هَٰذَآ إِلَّآ أَسَٰطِيرُ ٱلْأَوَّلِينَ",
    "translation_en": "But one who says to his parents, \"Uff to you; do you promise me that I will be brought forth [from the earth] when generations before me have already passed on [into oblivion]?\" while they call to Allah for help [and to their son], \"Woe to you! Believe! Indeed, the promise of Allah is truth.\" But he says, \"This is not but legends of the former people\" -",
    "translation_id": "Dan orang yang berkata kepada dua orang ibu bapaknya: \"Cis bagi kamu keduanya, apakah kamu keduanya memperingatkan kepadaku bahwa aku akan dibangkitkan, padahal sungguh telah berlalu beberapa umat sebelumku? lalu kedua ibu bapaknya itu memohon pertolongan kepada Allah seraya mengatakan: \"Celaka kamu, berimanlah! Sesungguhnya janji Allah adalah benar\". Lalu dia berkata: \"Ini tidak lain hanyalah dongengan orang-orang dahulu belaka\"."
  }, {
    "number": 18,
    "text": "أُو۟لَٰٓئِكَ ٱلَّذِينَ حَقَّ عَلَيْهِمُ ٱلْقَوْلُ فِىٓ أُمَمٍ قَدْ خَلَتْ مِن قَبْلِهِم مِّنَ ٱلْجِنِّ وَٱلْإِنسِ إِنَّهُمْ كَانُوا۟ خَٰسِرِينَ",
    "translation_en": "Those are the ones upon whom the word has come into effect, [who will be] among nations which had passed on before them of jinn and men. Indeed, they [all] were losers.",
    "translation_id": "Mereka itulah orang-orang yang telah pasti ketetapan (azab) atas mereka bersama umat-umat yang telah berlalu sebelum mereka dari jin dan manusia. Sesungguhnya mereka adalah orang-orang yang merugi."
  }, {
    "number": 19,
    "text": "وَلِكُلٍّ دَرَجَٰتٌ مِّمَّا عَمِلُوا۟ وَلِيُوَفِّيَهُمْ أَعْمَٰلَهُمْ وَهُمْ لَا يُظْلَمُونَ",
    "translation_en": "And for all there are degrees [of reward and punishment] for what they have done, and [it is] so that He may fully compensate them for their deeds, and they will not be wronged.",
    "translation_id": "Dan bagi masing-masing mereka derajat menurut apa yang telah mereka kerjakan dan agar Allah mencukupkan bagi mereka (balasan) pekerjaan-pekerjaan mereka sedang mereka tiada dirugikan."
  }, {
    "number": 20,
    "text": "وَيَوْمَ يُعْرَضُ ٱلَّذِينَ كَفَرُوا۟ عَلَى ٱلنَّارِ أَذْهَبْتُمْ طَيِّبَٰتِكُمْ فِى حَيَاتِكُمُ ٱلدُّنْيَا وَٱسْتَمْتَعْتُم بِهَا فَٱلْيَوْمَ تُجْزَوْنَ عَذَابَ ٱلْهُونِ بِمَا كُنتُمْ تَسْتَكْبِرُونَ فِى ٱلْأَرْضِ بِغَيْرِ ٱلْحَقِّ وَبِمَا كُنتُمْ تَفْسُقُونَ",
    "translation_en": "And the Day those who disbelieved are exposed to the Fire [it will be said], \"You exhausted your pleasures during your worldly life and enjoyed them, so this Day you will be awarded the punishment of [extreme] humiliation because you were arrogant upon the earth without right and because you were defiantly disobedient.\"",
    "translation_id": "Dan (ingatlah) hari (ketika) orang-orang kafir dihadapkan ke neraka (kepada mereka dikatakan): \"Kamu telah menghabiskan rezekimu yang baik dalam kehidupan duniawimu (saja) dan kamu telah bersenang-senang dengannya; maka pada hari ini kamu dibalasi dengan azab yang menghinakan karena kamu telah menyombongkan diri di muka bumi tanpa hak dan karena kamu telah fasik\"."
  }, {
    "number": 21,
    "text": "وَٱذْكُرْ أَخَا عَادٍ إِذْ أَنذَرَ قَوْمَهُۥ بِٱلْأَحْقَافِ وَقَدْ خَلَتِ ٱلنُّذُرُ مِنۢ بَيْنِ يَدَيْهِ وَمِنْ خَلْفِهِۦٓ أَلَّا تَعْبُدُوٓا۟ إِلَّا ٱللَّهَ إِنِّىٓ أَخَافُ عَلَيْكُمْ عَذَابَ يَوْمٍ عَظِيمٍ",
    "translation_en": "And mention, [O Muhammad], the brother of 'Aad, when he warned his people in the [region of] al-Ahqaf - and warners had already passed on before him and after him - [saying], \"Do not worship except Allah. Indeed, I fear for you the punishment of a terrible day.\"",
    "translation_id": "Dan ingatlah (Hud) saudara kaum 'Aad yaitu ketika dia memberi peringatan kepada kaumnya di Al Ahqaaf dan sesungguhnya telah terdahulu beberapa orang pemberi peringatan sebelumnya dan sesudahnya (dengan mengatakan): \"Janganlah kamu menyembah selain Allah, sesungguhnya aku khawatir kamu akan ditimpa azab hari yang besar\"."
  }, {
    "number": 22,
    "text": "قَالُوٓا۟ أَجِئْتَنَا لِتَأْفِكَنَا عَنْ ءَالِهَتِنَا فَأْتِنَا بِمَا تَعِدُنَآ إِن كُنتَ مِنَ ٱلصَّٰدِقِينَ",
    "translation_en": "They said, \"Have you come to delude us away from our gods? Then bring us what you promise us, if you should be of the truthful.\"",
    "translation_id": "Mereka menjawab: \"Apakah kamu datang kepada kami untuk memalingkan kami dari (menyembah) tuhan-tuhan kami? Maka datangkanlah kepada kami azab yang telah kamu ancamkan kepada kami jika kamu termasuk orang-orang yang benar\"."
  }, {
    "number": 23,
    "text": "قَالَ إِنَّمَا ٱلْعِلْمُ عِندَ ٱللَّهِ وَأُبَلِّغُكُم مَّآ أُرْسِلْتُ بِهِۦ وَلَٰكِنِّىٓ أَرَىٰكُمْ قَوْمًا تَجْهَلُونَ",
    "translation_en": "He said, \"Knowledge [of its time] is only with Allah, and I convey to you that with which I was sent; but I see you [to be] a people behaving ignorantly.\"",
    "translation_id": "Ia berkata: \"Sesungguhnya pengetahuan (tentang itu) hanya pada sisi Allah dan aku (hanya) menyampaikan kepadamu apa yang aku diutus dengan membawanya tetapi aku lihat kamu adalah kaum yang bodoh\"."
  }, {
    "number": 24,
    "text": "فَلَمَّا رَأَوْهُ عَارِضًا مُّسْتَقْبِلَ أَوْدِيَتِهِمْ قَالُوا۟ هَٰذَا عَارِضٌ مُّمْطِرُنَا بَلْ هُوَ مَا ٱسْتَعْجَلْتُم بِهِۦ رِيحٌ فِيهَا عَذَابٌ أَلِيمٌ",
    "translation_en": "And when they saw it as a cloud approaching their valleys, they said, \"This is a cloud bringing us rain!\" Rather, it is that for which you were impatient: a wind, within it a painful punishment,",
    "translation_id": "Maka tatkala mereka melihat azab itu berupa awan yang menuju ke lembah-lembah mereka, berkatalah mereka: \"Inilah awan yang akan menurunkan hujan kepada kami\". (Bukan!) bahkan itulah azab yang kamu minta supaya datang dengan segera (yaitu) angin yang mengandung azab yang pedih,"
  }, {
    "number": 25,
    "text": "تُدَمِّرُ كُلَّ شَىْءٍۭ بِأَمْرِ رَبِّهَا فَأَصْبَحُوا۟ لَا يُرَىٰٓ إِلَّا مَسَٰكِنُهُمْ كَذَٰلِكَ نَجْزِى ٱلْقَوْمَ ٱلْمُجْرِمِينَ",
    "translation_en": "Destroying everything by command of its Lord. And they became so that nothing was seen [of them] except their dwellings. Thus do We recompense the criminal people.",
    "translation_id": "yang menghancurkan segala sesuatu dengan perintah Tuhannya, maka jadilah mereka tidak ada yang kelihatan lagi kecuali (bekas-bekas) tempat tinggal mereka. Demikianlah Kami memberi balasan kepada kaum yang berdosa."
  }, {
    "number": 26,
    "text": "وَلَقَدْ مَكَّنَّٰهُمْ فِيمَآ إِن مَّكَّنَّٰكُمْ فِيهِ وَجَعَلْنَا لَهُمْ سَمْعًا وَأَبْصَٰرًا وَأَفْـِٔدَةً فَمَآ أَغْنَىٰ عَنْهُمْ سَمْعُهُمْ وَلَآ أَبْصَٰرُهُمْ وَلَآ أَفْـِٔدَتُهُم مِّن شَىْءٍ إِذْ كَانُوا۟ يَجْحَدُونَ بِـَٔايَٰتِ ٱللَّهِ وَحَاقَ بِهِم مَّا كَانُوا۟ بِهِۦ يَسْتَهْزِءُونَ",
    "translation_en": "And We had certainly established them in such as We have not established you, and We made for them hearing and vision and hearts. But their hearing and vision and hearts availed them not from anything [of the punishment] when they were [continually] rejecting the signs of Allah; and they were enveloped by what they used to ridicule.",
    "translation_id": "Dan sesungguhnya Kami telah meneguhkan kedudukan mereka dalam hal-hal yang Kami belum pernah meneguhkan kedudukanmu dalam hal itu dan Kami telah memberikan kepada mereka pendengaran, penglihatan dan hati; tetapi pendengaran, penglihatan dan hati mereka itu tidak berguna sedikit juapun bagi mereka, karena mereka selalu mengingkari ayat-ayat Allah dan mereka telah diliputi oleh siksa yang dahulu selalu mereka memperolok-olokkannya."
  }, {
    "number": 27,
    "text": "وَلَقَدْ أَهْلَكْنَا مَا حَوْلَكُم مِّنَ ٱلْقُرَىٰ وَصَرَّفْنَا ٱلْءَايَٰتِ لَعَلَّهُمْ يَرْجِعُونَ",
    "translation_en": "And We have already destroyed what surrounds you of [those] cities, and We have diversified the signs [or verses] that perhaps they might return [from disbelief].",
    "translation_id": "Dan sesungguhnya Kami telah membinasakan negeri-negeri di sekitarmu dan Kami telah mendatangkan tanda-tanda kebesaran Kami berulang-ulang supaya mereka kembali (bertaubat)."
  }, {
    "number": 28,
    "text": "فَلَوْلَا نَصَرَهُمُ ٱلَّذِينَ ٱتَّخَذُوا۟ مِن دُونِ ٱللَّهِ قُرْبَانًا ءَالِهَةًۢ بَلْ ضَلُّوا۟ عَنْهُمْ وَذَٰلِكَ إِفْكُهُمْ وَمَا كَانُوا۟ يَفْتَرُونَ",
    "translation_en": "Then why did those they took besides Allah as deities by which to approach [Him] not aid them? But they had strayed from them. And that was their falsehood and what they were inventing.",
    "translation_id": "Maka mengapa yang mereka sembah selain Allah sebagai Tuhan untuk mendekatkan diri (kepada Allah) tidak dapat menolong mereka. Bahkan tuhan-tuhan itu telah lenyap dari mereka? Itulah akibat kebohongan mereka dan apa yang dahulu mereka ada-adakan."
  }, {
    "number": 29,
    "text": "وَإِذْ صَرَفْنَآ إِلَيْكَ نَفَرًا مِّنَ ٱلْجِنِّ يَسْتَمِعُونَ ٱلْقُرْءَانَ فَلَمَّا حَضَرُوهُ قَالُوٓا۟ أَنصِتُوا۟ فَلَمَّا قُضِىَ وَلَّوْا۟ إِلَىٰ قَوْمِهِم مُّنذِرِينَ",
    "translation_en": "And [mention, O Muhammad], when We directed to you a few of the jinn, listening to the Qur'an. And when they attended it, they said, \"Listen quietly.\" And when it was concluded, they went back to their people as warners.",
    "translation_id": "Dan (ingatlah) ketika Kami hadapkan serombongan jin kepadamu yang mendengarkan Al Quran, maka tatkala mereka menghadiri pembacaan(nya) lalu mereka berkata: \"Diamlah kamu (untuk mendengarkannya)\". Ketika pembacaan telah selesai mereka kembali kepada kaumnya (untuk) memberi peringatan."
  }, {
    "number": 30,
    "text": "قَالُوا۟ يَٰقَوْمَنَآ إِنَّا سَمِعْنَا كِتَٰبًا أُنزِلَ مِنۢ بَعْدِ مُوسَىٰ مُصَدِّقًا لِّمَا بَيْنَ يَدَيْهِ يَهْدِىٓ إِلَى ٱلْحَقِّ وَإِلَىٰ طَرِيقٍ مُّسْتَقِيمٍ",
    "translation_en": "They said, \"O our people, indeed we have heard a [recited] Book revealed after Moses confirming what was before it which guides to the truth and to a straight path.",
    "translation_id": "Mereka berkata: \"Hai kaum kami, sesungguhnya kami telah mendengarkan kitab (Al Quran) yang telah diturunkan sesudah Musa yang membenarkan kitab-kitab yang sebelumnya lagi memimpin kepada kebenaran dan kepada jalan yang lurus."
  }, {
    "number": 31,
    "text": "يَٰقَوْمَنَآ أَجِيبُوا۟ دَاعِىَ ٱللَّهِ وَءَامِنُوا۟ بِهِۦ يَغْفِرْ لَكُم مِّن ذُنُوبِكُمْ وَيُجِرْكُم مِّنْ عَذَابٍ أَلِيمٍ",
    "translation_en": "O our people, respond to the Messenger of Allah and believe in him; Allah will forgive for you your sins and protect you from a painful punishment.",
    "translation_id": "Hai kaum kami, terimalah (seruan) orang yang menyeru kepada Allah dan berimanlah kepada-Nya, niscaya Allah akan mengampuni dosa-dosa kamu dan melepaskan kamu dari azab yang pedih."
  }, {
    "number": 32,
    "text": "وَمَن لَّا يُجِبْ دَاعِىَ ٱللَّهِ فَلَيْسَ بِمُعْجِزٍ فِى ٱلْأَرْضِ وَلَيْسَ لَهُۥ مِن دُونِهِۦٓ أَوْلِيَآءُ أُو۟لَٰٓئِكَ فِى ضَلَٰلٍ مُّبِينٍ",
    "translation_en": "But he who does not respond to the Caller of Allah will not cause failure [to Him] upon earth, and he will not have besides Him any protectors. Those are in manifest error.\"",
    "translation_id": "Dan orang yang tidak menerima (seruan) orang yang menyeru kepada Allah maka dia tidak akan melepaskan diri dari azab Allah di muka bumi dan tidak ada baginya pelindung selain Allah. Mereka itu dalam kesesatan yang nyata\"."
  }, {
    "number": 33,
    "text": "أَوَلَمْ يَرَوْا۟ أَنَّ ٱللَّهَ ٱلَّذِى خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضَ وَلَمْ يَعْىَ بِخَلْقِهِنَّ بِقَٰدِرٍ عَلَىٰٓ أَن يُحْۦِىَ ٱلْمَوْتَىٰ بَلَىٰٓ إِنَّهُۥ عَلَىٰ كُلِّ شَىْءٍ قَدِيرٌ",
    "translation_en": "Do they not see that Allah, who created the heavens and earth and did not fail in their creation, is able to give life to the dead? Yes. Indeed, He is over all things competent.",
    "translation_id": "Dan apakah mereka tidak memperhatikan bahwa sesungguhnya Allah yang menciptakan langit dan bumi dan Dia tidak merasa payah karena menciptakannya, kuasa menghidupkan orang-orang mati? Ya (bahkan) sesungguhnya Dia Maha Kuasa atas segala sesuatu."
  }, {
    "number": 34,
    "text": "وَيَوْمَ يُعْرَضُ ٱلَّذِينَ كَفَرُوا۟ عَلَى ٱلنَّارِ أَلَيْسَ هَٰذَا بِٱلْحَقِّ قَالُوا۟ بَلَىٰ وَرَبِّنَا قَالَ فَذُوقُوا۟ ٱلْعَذَابَ بِمَا كُنتُمْ تَكْفُرُونَ",
    "translation_en": "And the Day those who disbelieved are exposed to the Fire [it will be said], \"Is this not the truth?\" They will say, \"Yes, by our Lord.\" He will say, \"Then taste the punishment because you used to disbelieve.\"",
    "translation_id": "Dan (ingatlah) hari (ketika) orang-orang kafir dihadapkan kepada neraka, (dikatakan kepada mereka): \"Bukankah (azab) ini benar?\" Mereka menjawab: \"Ya benar, demi Tuhan kami\". Allah berfirman \"Maka rasakanlah azab ini disebabkan kamu selalu ingkar\"."
  }, {
    "number": 35,
    "text": "فَٱصْبِرْ كَمَا صَبَرَ أُو۟لُوا۟ ٱلْعَزْمِ مِنَ ٱلرُّسُلِ وَلَا تَسْتَعْجِل لَّهُمْ كَأَنَّهُمْ يَوْمَ يَرَوْنَ مَا يُوعَدُونَ لَمْ يَلْبَثُوٓا۟ إِلَّا سَاعَةً مِّن نَّهَارٍۭ بَلَٰغٌ فَهَلْ يُهْلَكُ إِلَّا ٱلْقَوْمُ ٱلْفَٰسِقُونَ",
    "translation_en": "So be patient, [O Muhammad], as were those of determination among the messengers and do not be impatient for them. It will be - on the Day they see that which they are promised - as though they had not remained [in the world] except an hour of a day. [This is] notification. And will [any] be destroyed except the defiantly disobedient people?",
    "translation_id": "Maka bersabarlah kamu seperti orang-orang yang mempunyai keteguhan hati dari rasul-rasul telah bersabar dan janganlah kamu meminta disegerakan (azab) bagi mereka. Pada hari mereka melihat azab yang diancamkan kepada mereka (merasa) seolah-olah tidak tinggal (di dunia) melainkan sesaat pada siang hari. (Inilah) suatu pelajaran yang cukup, maka tidak dibinasakan melainkan kaum yang fasik."
  }],
  "tafsir": {
    "id": {
      "kemenag": {
        "name": "Kemenag",
        "source": "Aplikasi Quran Kementrian Agama Republik Indonesia",
        "text": {
          "1": "ha mim termasuk huruf-huruf hijaiah yang terletak pada permulaan beberapa surah Al-Qur'an. Para mufasir berbeda pendapat tentang maksud huruf-huruf itu. Untuk jelasnya dipersilakan menelaah kembali uraian yang ada pada permulaan Surah al-Baqarah jilid I \"Al-Qur'an dan Tafsirnya\" dengan judul \"Fawatihus-suwar\".",
          "2": "Allah menegaskan bahwa Al-Qur'an ini benar-benar bersumber dari-Nya, tidak ada keraguan sedikit pun tentang itu, diturunkan kepada Nabi Muhammad, berisi ketentuan-ketentuan, bimbingan, dan pedoman hidup bagi manusia untuk mencapai kebahagiaan hidup di dunia dan di akhirat. Allah yang menurunkan Al-Qur'an kepada Muhammad saw, adalah Tuhan yang Mahaperkasa, tidak ada sesuatu pun yang dapat menandingi-Nya. Dia Maha Bijaksana. Semua perintah, larangan, dan tindakan Allah adalah sesuai dengan sifat, kegunaan, dan faedah dari yang diciptakan-Nya dan hal itu tidak lepas dari hikmah penciptaan alam seluruhnya.\n\nKarena Al-Qur'an itu bersumber dari Allah yang diturunkan kepada Nabi Muhammad, maka hendaklah setiap manusia beriman kepadanya, mengakui kebenaran dan mengamalkan semua isinya. Beriman kepada Al-Qur'an berarti keharusan beriman pula kepada Nabi Muhammad sebagai rasul Allah, yaitu dengan mengikuti semua sunahnya.",
          "3": "Setelah menegaskan bahwa Al-Qur'an adalah wahyu-Nya, bukan karangan Muhammad saw, Allah menerangkan bahwa Dia-lah yang menciptakan langit dan bumi serta semua yang ada di antara keduanya. Penciptaan ini mengandung hikmah, meskipun manusia belum mampu mengetahui semua hikmah tersebut. Manusia harus selalu berusaha menggali hikmah tersebut agar bisa memanfaatkan pesan-pesan Al-Qur'an.\n\nDalam ayat lain diterangkan bahwa di antara tujuan Allah menciptakan bumi dan semua yang ada padanya ialah untuk kepentingan manusia. Allah berfirman:\n\nYa Tuhan kami, tidaklah Engkau menciptakan semua ini sia-sia; Mahasuci Engkau, lindungilah kami dari azab neraka. (Ali 'Imran/3: 191)\n\nDalam ayat yang lain diterangkan bahwa Allah menjadikan langit dan bumi bukanlah untuk menimbulkan kezaliman dan kebinasaan, tetapi untuk melahirkan dan membuktikan kebenaran serta keadilan. Dalam menyatakan keadilan itu, Allah membedakan antara orang yang berbuat baik dan orang yang berbuat buruk atau jahat, baik dalam sikap-Nya terhadap mereka, maupun dalam memberi balasan terhadap perbuatan mereka. Allah berfirman:\n\nDan Allah menciptakan langit dan bumi dengan tujuan yang benar dan agar setiap jiwa diberi balasan sesuai dengan apa yang dikerjakannya, dan mereka tidak akan dirugikan. (al-Jatsiyah/45: 22)\n\nAllah menciptakan langit dan bumi untuk waktu yang ditentukan-Nya sehingga dalam masa itu ada kesempatan bagi manusia melakukan segala sesuatu yang baik baginya, sesuai dengan ketentuan- ketentuan Allah agar ia dapat menikmati kebahagiaan hidup yang hakiki. Hal ini tentu sesuai pula dengan potensi dan hak ikhtiar yang diberikan Allah kepadanya.\n\nKarena Allah telah menciptakan langit dan bumi dengan segala hikmah dan manfaatnya, maka untuk menunjukkan keadilan-Nya dan membuktikan hikmah penciptaan keduanya, Allah menciptakan hari pembalasan. Dengan adanya hari pembalasan itu, segala perbuatan manusia dapat dibalas dengan adil. Hari pembalasan akan datang setelah berakhirnya masa yang ditentukan bagi langit dan bumi. Pada hari pembalasan itu, ditetapkan pahala bagi orang-orang yang melaksanakan perintah Allah dan menjauhi larangan-Nya berupa kebahagiaan abadi di dalam surga. Adapun orang-orang yang mengingkari perintah Allah dan melanggar larangan-Nya memperoleh kesengsaraan yang dialaminya di dalam neraka.\n\nPernyataan mengenai penciptaan langit dan bumi dilakukan dengan suatu tujuan yang benar banyak ditemui dalam Al-Qur'an (antara lain Surah Ibrahim/14: 19). Pada ayat 3 Surah al-Ahqaf/46 ini, ditambahkan kata \"dalam waktu yang ditentukan.\" Kata-kata ini dapat diartikan bahwa Tuhan memberi tahu kita mengenai waktu yang diperlukan hingga bumi terbentuk dan layak dihuni. Uraian yang lebih lugas mengenai waktu atau masa dari penciptaan terdapat pada Surah al-A'raf/7: 54 (lihat penjelasan pada juz 8).\n\nPada akhir ayat ini diterangkan keingkaran orang-orang musyrik terhadap peringatan yang telah disampaikan kepada mereka. Diterangkan bahwa sekalipun kepada mereka telah disampaikan bukti-bukti yang kuat tentang kebenaran Al-Qur'an sebagai firman Allah, pengangkatan Muhammad saw sebagai rasul-Nya, dan agama yang dibawa Muhammad saw, namun mereka tetap dalam kemusyrikan. Mereka tetap berpaling dari peringatan itu dengan mengingkari perintah Allah dan melanggar larangan-Nya, bahkan mereka menolak dalil-dalil dan bukti-bukti itu tanpa alasan yang benar. Mereka seakan-akan orang yang tuli, bisu, buta dan tidak berakal sehingga tidak dapat mendengar dan memahami seruan dan peringatan itu. Mereka tidak mau percaya bahwa kelalaian dan keingkaran mereka akan menimbulkan penyesalan yang terus-menerus di akhirat kelak, di samping mengalami siksaan yang amat berat.",
          "4": "Setelah menegaskan bahwa Dialah yang berhak disembah, Dialah Tuhan yang Maha Pengasih, Maha Penyayang lagi Mahaadil, dan setelah menegaskan tentang adanya hari pembalasan, Allah menunjukkan kesalahan akidah orang-orang musyrik yang menyembah sembahan selain Allah. Dia memerintahkan kepada Nabi Muhammad agar mengatakan kepada orang-orang yang menyembah sembahan selain Allah sebagai berikut, \"Hai orang-orang musyrik, terangkanlah kepadaku tentang berhala-berhala yang kamu sembah, setelah kamu memperhatikan kejadian langit dan bumi serta yang ada di dalamnya, setelah memperhatikan hukum-hukum yang berlaku pada benda-benda angkasa, alam semesta sejak dari yang sekecil-kecilnya sampai kepada yang paling besar, sejak dari yang tampak sampai kepada yang tidak tampak, sejak dari yang halus sampai kepada yang kasar, juga setelah kamu memperhatikan kejadian hewan, tumbuh-tumbuhan, sampai kepada kejadian diri kamu sendiri, yang semuanya itu diciptakan dengan rapi, indah, berfaedah dan penuh hikmah. Apakah ada di bumi ini benda yang telah diciptakan oleh berhala sehingga ia layak dan berhak disembah? Atau apakah ia telah menciptakan sesuatu yang ada di langit bersama-sama dengan Allah?\"\n\nDari ayat ini dapat dipahami bahwa orang-orang musyrik tidak sanggup membuktikan dengan dalil-dalil yang masuk akal bahwa berhala itu berhak disembah di samping Allah karena mereka tidak dapat menunjukkan walaupun hanya satu benda kecil di antara benda-benda yang ada di bumi ini sebagai ciptaan berhala itu. Bahkan yang terbukti ialah berhala itu sendiri adalah hasil buatan mereka sendiri.\n\nAkhir ayat ini menegaskan bahwa di dalam kitab-kitab suci yang pernah diturunkan Allah kepada para rasul-Nya tidak terdapat satu keterangan pun yang menerangkan bahwa berhala itu harus disembah di samping Allah. Begitu juga dalam ilmu yang diwariskan oleh orang-orang dahulu pun tidak terdapat keterangan yang dijadikan dasar bagi penyembahan terhadap berhala. Hal ini diperintahkan Allah untuk disampaikan kepada orang-orang musyrik, \"Hai kaum musyrik, seandainya kepercayaan menyembah berhala itu benar, cobalah kemukakan satu ayat saja dari ayat-ayat yang terdapat dalam kitab-kitab suci yang diturunkan sebelum Al-Qur'an yang membenarkan kepercayaanmu itu, atau pengetahuan-pengetahuan orang-orang terdahulu yang ada pada kamu yang membenarkan kepercayaan syirik itu.\"",
          "5": "Dalam ayat ini, Allah menerangkan bahwa orang-orang musyrik yang menyembah berhala tanpa alasan yang benar itu adalah orang yang sesat karena mereka menyembah sesuatu yang tidak dapat berbuat, melihat, mendengar, apalagi memperkenankan doa orang-orang yang berdoa kepadanya. Hal itu tidak dapat dilakukannya di dunia, dan di akhirat tentu lebih tidak dapat dilakukannya. Berhala-berhala itu sebenarnya adalah batu-batu mati atau kayu yang dipahat oleh manusia sendiri. Oleh karena itu, mereka tidak dapat mendengar, memahami, dan memperhatikan orang-orang yang berdoa kepadanya. Orang yang benar adalah orang yang menganut akidah yang benar, yaitu akidah tauhid yang membawa manusia menyembah hanya kepada Allah, Tuhan Yang Maha Esa, Maha Pencipta, Maha Menentukan segala sesuatu, yang membimbing manusia ke jalan kebahagiaan di dunia dan di akhirat.",
          "6": "Ayat ini menerangkan keadaan orang-orang musyrik di akhirat nanti dan berhala-berhala yang mereka sembah. Pada saat semua manusia telah dibangkitkan dari kubur dan berkumpul untuk dihisab, maka berhala-berhala, dewa, dan sembahan yang lain yang mereka sembah selain Allah itu mengingkari perbuatan orang-orang musyrik yang menyembah mereka dengan mengatakan, \"Kami tidak pernah memerintahkan agar mereka menyembah kami. Kami tidak mengetahui apa yang mereka lakukan terhadap kami, bahkan kami tidak mengetahui sedikit pun bahwa mereka telah menyembah kami karena kami ini adalah benda-benda mati, tidak dapat melihat, mendengar, berkata, apalagi mengabulkan doa-doa orang-orang yang berdoa kepada kami. Allah berfirman:\n\nDan dia (Ibrahim) berkata, \"Sesungguhnya berhala-berhala yang kamu sembah selain Allah, hanya untuk menciptakan perasaan kasih sayang di antara kamu dalam kehidupan di dunia, kemudian pada hari Kiamat sebagian kamu akan saling mengingkari dan saling mengutuk; dan tempat kembalimu ialah neraka, dan sama sekali tidak ada penolong bagimu\". (al-'Ankabut/29: 25)\n\nPada ayat lain, Allah berfirman:\n\nDan mereka telah memilih tuhan-tuhan selain Allah, agar tuhan-tuhan itu menjadi pelindung bagi mereka. Sama sekali tidak! Kelak mereka (sesembahan) itu akan mengingkari penyembahan mereka terhadapnya, dan akan menjadi musuh bagi mereka. (Maryam/19: 81-82)",
          "7": "Ayat ini menerangkan sikap orang-orang musyrik ketika Rasulullah saw membacakan ayat-ayat Al-Qur'an kepada mereka. Mereka mengatakan bahwa ayat-ayat Al-Qur'an itu adalah sihir yang dibacakan oleh tukang sihir, yaitu Muhammad saw. Menurut mereka, tukang sihir memang biasa mengada-adakan kebohongan dan menyihir orang lain untuk mencapai maksudnya.\n\nDalam ayat yang lain diterangkan tuduhan orang-orang musyrik terhadap Al-Qur'an bahwa Al-Qur'an adalah mimpi yang kacau yang diada-adakan, dan Muhammad saw adalah seorang penyair. Allah berfirman:\n\nBahkan mereka mengatakan, \"(Al-Qur'an itu buah) mimpi-mimpi yang kacau, atau hasil rekayasanya (Muhammad), atau bahkan dia hanya seorang penyair, cobalah dia datangkan kepada kita suatu tanda (bukti), seperti halnya rasul-rasul yang diutus terdahulu.\" (al-Anbiya'/21: 5)\n\nOrang-orang musyrik menuduh Muhammad sebagai tukang sihir karena menurut mereka, Abu al-Walid bin al-Mugirah pernah disihirnya. Karena pengaruh sihir itu, ia menyatakan kekagumannya terhadap ayat-ayat Al-Qur'an yang dibacakan Rasulullah saw kepadanya. Kisah ini bermula ketika pada suatu waktu, sebelum Rasulullah saw hijrah ke Medinah, para pemimpin Quraisy berkumpul untuk merundingkan cara menundukkan Rasulullah. Setelah bermusyawarah, akhirnya mereka sepakat mengutus Abu al-Walid, seorang sastrawan Arab yang tak ada bandingannya waktu itu untuk datang kepada Rasulullah, meminta kepada beliau agar berhenti menyampaikan risalahnya. Sebagai jawaban, Rasulullah membaca Surah 41 (Fussilat) dari awal sampai akhir. Abu al-Walid terpesona mendengar bacaan ayat itu; ia termenung memikirkan ketinggian isi dan keindahan gaya bahasanya. Kemudian ia langsung kembali kepada kaumnya, tanpa mengucapkan sepatah kata pun kepada Rasulullah.\n\nSetelah Abu al-Walid kembali, ia ditanya oleh kaumnya tentang hasil usahanya. Mereka heran, mengapa Abu al-Walid bermuram durja. Abu al-Walid menjawab, \"Aku telah datang kepada Muhammad dan ia menjawab dengan membacakan ayat-ayat Al-Qur'an kepadaku. Aku belum pernah mendengar kata-kata yang seindah itu. Tetapi perkataan itu bukanlah syair, bukan sihir, dan bukan pula kata-kata ahli tenung. Sesungguhnya Al-Qur'an itu ibarat pohon yang daunnya rindang, akarnya terhujam ke dalam tanah, susunan kata-katanya runtun dan enak didengar. Al-Qur'an itu bukanlah kata-kata manusia. Ia sangat tinggi dan tidak ada yang dapat menandingi keindahan susunannya.\"\n\nMendengar jawaban Abu al-Walid itu, kaum Quraisy menuduhnya telah berkhianat dan cenderung tertarik kepada agama Islam karena telah terkena pengaruh sihir Nabi Muhammad. Dari sikap Abu al-Walid setelah mendengar ayat-ayat Al-Qur'an dan sikap orang-orang musyrik Mekah itu kepada Abu al-Walid, dapat diambil kesimpulan bahwa sebenarnya hati mereka telah mengakui kebenaran Al-Qur'an, telah mengagumi isi dan gaya bahasanya, namun ada sesuatu yang menghalangi mereka untuk mengucapkan dan menyatakan kebenaran itu. Abu al-Walid seorang yang mereka banggakan keahliannya dalam sastra dan bahasa Arab selama ini, tidak berkutik sedikit pun dan terpesona mendengarkan ayat-ayat Al-Qur'an. Bagaimana halnya dengan mereka yang jauh lebih rendah pengetahuannya dari Abu al-Walid? Karena tidak ada satu alasan pun yang dapat mereka kemukakan, dan untuk menutupi kelemahan mereka, maka mereka langsung menuduh bahwa Al-Qur'an adalah sihir yang berbentuk syair, dan Muhammad itu adalah tukang sihir yang menyihir orang dengan ucapan-ucapan yang berbentuk syair.\n\nDalam ayat yang lain, diterangkan bahwa sebab-sebab yang mendorong orang musyrikin tidak mau mengakui kebenaran Al-Qur'an sekalipun hati mereka sendiri telah mengakuinya, ialah kefanatikan mereka terhadap kepercayaan nenek moyang mereka. Allah berfirman:\n\nBahkan mereka berkata, \"Sesungguhnya kami mendapati nenek moyang kami menganut suatu agama, dan kami mendapat petunjuk untuk mengikuti jejak mereka.\" (az-Zukhruf/43: 22).\n\nDi samping kefanatikan kepada ajaran nenek moyang, mereka juga khawatir akan kehilangan kedudukan sebagai pemimpin suku atau kabilah, jika mereka menyatakan isi hati mereka yang sebenarnya terhadap kebenaran risalah Nabi Muhammad.",
          "8": "Di samping menuduh Muhammad saw sebagai tukang sihir, orang-orang musyrik itu juga menuduh beliau sebagai orang yang suka mengada-ada dan mengatakan yang bukan-bukan tentang Allah. Karena itu, Allah memerintahkan kepada Muhammad saw untuk membantah tuduhan itu dengan mengatakan, \"Seandainya aku berdusta dengan mengada-ada atau mengatakan yang bukan-bukan tentang Allah, seperti jika aku bukanlah seorang rasul, tetapi aku mengatakan bahwa aku adalah seorang rasul Allah yang diutus-Nya kepadamu untuk menyampaikan agama-Nya, tentulah Allah menimpakan azab yang sangat berat kepadaku, dan tidak seorang pun di bumi ini yang sanggup menghindarkan aku dari azab itu. Mungkinkah aku mengada-adakan sesuatu dan mengatakan yang bukan-bukan tentang Allah dan Al-Qur'an, dan menjadikan diriku sebagai sasaran azab Allah, padahal tidak seorang pun yang dapat menolongku daripadanya?\" Allah berfirman:\n\nDan sekiranya dia (Muhammad) mengada-adakan sebagian perkataan atas (nama) Kami, pasti Kami pegang dia pada tangan kanannya. Kemudian Kami potong pembuluh jantungnya. Maka tidak seorang pun dari kamu yang dapat menghalangi (Kami untuk menghukumnya). (al-haqqah/69: 44-47).\n\nPada akhir ayat ini, Rasulullah saw menegaskan kepada orang-orang musyrik bahwa Allah Maha Mengetahui segala tindakan, perkataan, dan celaan mereka terhadap Al-Qur'an, misalnya mengatakan Al-Qur'an itu sihir, syair, suatu kebohongan, dan sebagainya; karena itu Dia akan memberi pembalasan yang setimpal. Nabi Muhammad mengatakan bahwa cukup Allah yang menjadi saksi tentang kebenaran dirinya menyampaikan agama Allah kepada mereka. Allah pula yang akan menjadi saksi tentang keingkaran serta sikap mereka yang menolak kebenaran.\n\nSelanjutnya Allah memerintahkan agar Nabi Muhammad mengatakan kepada orang-orang musyrik bahwa meskipun mereka ingkar kepada Allah dan Rasul-Nya, serta terhadap Al-Qur'an, namun pintu tobat tetap terbuka bagi mereka. Allah akan menerima tobat mereka asalkan mereka benar-benar bertobat kepada-Nya dengan tekad tidak akan durhaka lagi kepada-Nya, dan tidak akan melakukan perbuatan dosa yang lain. Allah mau menerima tobat mereka karena Ia Maha Pengampun dan tetap memberi rahmat kepada orang-orang yang bertobat dan kembali kepada-Nya.",
          "9": "Pada ayat ini, Allah memerintahkan kepada Nabi Muhammad untuk mengatakan bahwa ia bukanlah yang pertama di antara para rasul. Seperti telah disebutkan dalam keterangan kosakata, bid' artinya sesuatu yang baru, atau barang yang baru pertama kali adanya. Jika kaum musyrik mengingkari kerasulan Muhammad padahal sebelumnya telah banyak rasul Allah sejak Nabi Adam sampai Nabi Isa, maka sikap ingkar serupa itu sangat aneh dan perlu dipertanyakan karena diutusnya Muhammad sebagai rasul sesungguhnya bukan yang pertama di antara para rasul. Sebelum Nabi Muhammad, Allah telah mengutus banyak nabi dan rasul pada setiap zaman dan tempat yang berbeda. Pengutusan para nabi oleh Allah untuk memberi petunjuk kepada manusia adalah pengalaman universal umat manusia, bukan hanya untuk memperbaiki keadaan kaum musyrik Mekah. Jadi diutusnya Muhammad untuk mengemban misi risalah, bukanlah sesuatu yang baru sama sekali.\n\nSelanjutnya Allah memerintahkan agar Rasulullah menyampaikan kepada orang-orang musyrik bahwa ia tidak mengetahui sedikit pun apa yang akan dilakukan Allah terhadap dirinya dan mereka di dunia ini, apakah ia harus meninggalkan negeri ini dan hijrah ke negeri lain seperti yang telah dilakukan nabi-nabi terdahulu, ataukah ia akan mati terbunuh seperti nabi-nabi lain yang mati terbunuh. Ia juga tidak mengetahui apa yang akan ditimpakan kepada kaumnya. Semuanya itu hanya diketahui oleh Allah yang Maha Mengetahui. Rasulullah saw menegaskan kembali bahwa walaupun Allah telah berjanji akan memberikan kemenangan kepada kaum Muslimin dan akan mengalahkan orang-orang kafir, memasukkan kaum Muslimin ke dalam surga dan memasukkan orang-orang kafir ke dalam neraka, namun ia sedikit pun tidak mengetahui kapan hal itu akan terjadi.\n\nDari ayat ini dapat diambil kesimpulan bahwa hanya Allah saja yang mengetahui segala yang gaib. Para rasul dan para nabi tidak mengetahuinya, kecuali jika Allah memberitahukannya. Karena itu, ayat ini membantah dengan tegas kepercayaan yang menyatakan bahwa para wali mengetahui yang gaib, mengetahui apa yang akan terjadi. Rasulullah saw sendiri sebagai utusan Allah mengakui bahwa ia tidak mengetahui hal-hal yang gaib, apalagi para wali yang tingkatnya jauh di bawah tingkat para rasul.\n\nDalam hadis riwayat Imam al-Bukhari dan imam-imam yang lain: \n\nDari Ummul 'Ala', ketika 'Utsman bin Madz'un meninggal dunia aku berdoa semoga Allah merahmatimu hai Abu al Saib, sungguh Allah telah memuliakanmu. Maka Rasulullah menegur; Dari mana engkau mengetahui bahwa Allah telah memuliakannya? Adapun dia sendiri telah mendapat keyakinan dari Tuhannya dan aku benar-benar mengharapkan kebaikan baginya. Demi Allah, aku tidak mengetahui, padahal aku Rasul Allah, apakah yang akan diperbuat Allah terhadap diriku, begitu pula terhadap diri kamu semua\". Ummul 'Ala' berkata: \"Demi Allah semenjak itu aku tidak pernah lagi mensucikan (memuji) orang buat selama-lamanya. (Riwayat al-Bukhari)\n\nDari keterangan di atas jelas bahwa Rasulullah sendiri tidak mengetahui hal yang gaib. Beliau tidak mengetahui apakah sahabatnya 'Utsman bin Madz'un yang telah meninggal itu masuk surga atau masuk neraka. Namun, beliau berdoa agar sahabatnya itu diberi rahmat oleh Allah. Hal ini juga berarti bahwa tidak seorang pun yang dapat meramalkan sesuatu tentang seseorang yang baru meninggal. Rasulullah saw sendiri tidak mengetahui, apalagi seorang wali atau seorang ulama. Jika ada seorang wali menyatakan bahwa dia mengetahui yang gaib, maka pernyataan itu adalah bohong belaka. Rasulullah menjadi marah mendengar orang-orang yang menerka-nerka nasib seseorang yang meninggal dunia sebagaimana tersebut dalam hadis di atas.\n\nAyat ini memberikan petunjuk kepada kita tentang sikap yang baik dalam menghadapi atau melayat salah seorang teman yang meninggal dunia. Petunjuk itu adalah agar kita mendoakan dan jangan sekali-kali meramalkan nasibnya, karena yang mengetahui hal itu hanyalah Allah.\n\nPada akhir ayat ini, Allah memerintahkan agar Rasulullah menegaskan keadaan dirinya yang sebenarnya untuk menguatkan apa yang telah disampaikannya. Dia diperintahkan agar mengatakan kepada orang-orang musyrik Mekah bahwa tidak ada sesuatu pun yang diikutinya, selain Al-Qur'an yang diwahyukan Allah kepadanya, dan tidak ada suatu apa pun yang diada-adakannya. Semuanya berasal dari Allah Yang Mahakuasa. Ia hanyalah seorang pemberi peringatan yang diutus Allah untuk menyampaikan peringatan kepada mereka agar menjaga diri dari siksa dan murka Allah. Nabi saw juga menegaskan bahwa ia telah menyampaikan kepada mereka bukti-bukti kuat tentang kebenaran risalahnya. Ia bukan malaikat, sehingga ia tidak dapat melakukan sesuatu yang tidak dapat dilakukan manusia.",
          "10": "Allah memerintahkan kepada rasul-Nya agar menanyakan kepada orang-orang musyrik bagaimana pendapat mereka seandainya terbukti bahwa Al-Qur'an itu benar-benar dari Allah. Dengan kenyataan bahwa tidak seorang pun dapat menandinginya, terbukti bahwa Al-Qur'an itu bukan sihir dan bukan pula diada-adakan, sebagaimana yang mereka tuduhkan. Namun demikian, mereka tetap mendustakan dan mengingkarinya, sedangkan ada di antara Bani Israil yang lebih tahu dan berpengalaman serta lebih pintar daripada mereka, tetapi tetap mengakui kebenarannya. Apakah yang akan diperbuat Tuhan terhadap mereka? Bukankah Tuhan akan mengazab mereka karena keingkaran dan kesombongan itu. Dia tidak akan memberi petunjuk kepada mereka sehingga mereka semua menjadi orang yang paling sesat di dunia ini.\n\nYang dimaksud dengan seorang saksi yang berasal dari Bani Israil ialah 'Abdullah bin Salam, sesuai dengan hadis yang diriwayatkan oleh at-Tirmidhi, Ibnu Jarir, dan Ibnu Mardawaih dari 'Abdullah bin Salam sendiri. Ia menyatakan:\n\n\"Allah telah menurunkan ayat-ayat Al-Qur'an tentang diriku. Diturunkan tentang diriku ayat : wa syahida syahidun min Bani Israil 'ala mitslihi, dan ayat: Qul kafa billahi syahidan baini wa bainakum wa man 'indahu 'ilmul kitab.\" (Riwayat at-Tirmidhi)\n\nPernyataan 'Abdullah bin Salam ini dikuatkan oleh hadis Rasulullah saw: \n\nDari Sa'ad bin Abi Waqqas, ia berkata, \"Aku belum pernah mendengar Rasulullah saw mengatakan kepada seorang yang ada di muka bumi bahwa ia termasuk ahli surga, kecuali kepada 'Abdullah bin Salam; dan berhubungan dengan dirinya turun ayat: \"Wa syahida syahidun min bani Isra'ila 'ala mitslihi.\" (Riwayat al-Bukhari)\n\n'Abdullah bin Salam adalah seorang Yahudi penduduk kota Medinah. Ia mempelajari dan memahami dengan baik isi Taurat yang menyebutkan akan datang nanti nabi dan rasul terakhir yang berasal dari Nabi Ibrahim, dan dari jalur Nabi Ismail, di Jazirah Arab, yang membawa Al-Qur'an sebagai kitab yang diturunkan Allah kepadanya. Setelah Rasulullah saw hijrah ke Medinah, 'Abdullah memperhatikan sifat-sifat Rasulullah dan ajaran yang disampaikannya berupa ayat-ayat Al-Qur'an yang diturunkan Allah kepadanya.\n\nIa mengamati sikap Rasulullah terhadap sesama manusia dan sikap para pengikutnya yang telah mendalami agama baru itu. Akhirnya ia berkesimpulan bahwa Rasulullah dan ajaran agama yang dibawanya itu mempunyai ciri yang sama dengan yang diisyaratkan Taurat yang telah dipelajari dan diamalkannya. Demikian pula sifat-sifat para pengikut agama baru itu. Oleh karena itu, ia menyatakan diri masuk Islam dan menjadi pengikut Rasulullah saw.\n\nDengan demikian, dapat dipahami bahwa orang-orang Yahudi dan Nasrani yang benar-benar mengikuti dan meyakini Taurat dan Injil, pasti akan sampai kepada kesimpulan bahwa Al-Qur'an itu benar-benar dari Allah dan Muhammad saw itu benar-benar utusan-Nya sebagaimana yang telah dilakukan oleh 'Abdullah bin Salam.\n\nPada akhir ayat ini, Allah menegaskan bahwa orang-orang musyrik sebenarnya adalah orang-orang yang sombong dan mengingkari ayat-ayat Allah. Oleh karena itu, mereka telah menganiaya diri sendiri. Akibat sikap dan tindakan seperti itu, Allah tidak lagi memberikan petunjuk kepada mereka. Hal ini sesuai dengan sunatullah bahwa Allah tidak akan memberikan petunjuk kepada setiap orang zalim. Mereka mendapat kemurkaan Allah di dunia dan di akhirat.",
          "11": "Ayat ini menerangkan bahwa perkataan orang-orang musyrik Mekah tentang Al-Qur'an dan orang-orang yang beriman tidak benar. Perkataan itu mereka ucapkan karena beberapa orang yang mereka anggap miskin, bodoh, dan rendah derajatnya seperti 'Ammar, Suhaib, Ibnu Mas'ud, Bilal, Khabbab, dan lain-lain telah masuk Islam. Menurut mereka, sesuatu yang benar dan datang dari Tuhan itu harus diakui kebenarannya oleh para bangsawan, orang kaya, orang terpandang dan para pembesar. Itulah ukuran kebenaran menurut mereka. Apabila kebenaran itu hanya diakui oleh orang-orang yang rendah derajatnya, miskin, dan rakyat jelata saja, maka kebenaran itu palsu.\n\nPerkataan orang-orang musyrik Mekah itu ialah, \"Sekiranya Al-Qur'an yang diturunkan kepada Muhammad saw mengandung kebajikan, tentulah kita orang-orang terpandang, bangsawan, dan orang-orang terkemuka ini lebih dahulu beriman kepadanya karena lebih mengetahui dan lebih dahulu mengerjakan kebaikan daripada orang-orang yang rendah derajatnya itu. Sekarang, merekalah yang lebih dahulu beriman daripada kita. Hal ini dapat kita jadikan bukti bahwa Al-Qur'an itu tidak ada nilainya dan tidak mengandung kebajikan sedikit pun.\"\n\nQatadah berkata, \"Orang-orang musyrik menyatakan, kami lebih perkasa. Kalau ada suatu kebaikan, tentulah kami yang lebih mengetahuinya. Karena kami yang lebih mengetahui, tentulah kami yang menentukannya. Tidak seorang pun yang dapat mendahului kami dalam hal ini. Sehubungan dengan perkataan mereka itu, turunlah ayat ini.\"\n\nMenurut satu riwayat, ketika kabilah-kabilah Juhainah, Muzainah, Aslam, dan Gifar memeluk agama Islam, Banu 'Amir, Bani Gatafan, dan Banu Asad berkata, \"Seandainya agama Islam itu suatu kebenaran, tentulah kita tidak didahului oleh penggembala-penggembala hewan itu.\"\n\nKarena orang-orang musyrik itu telah terkunci hati, pendengaran, dan penglihatannya oleh kedengkian dan hawa nafsu, maka mereka tidak dapat lagi mengambil petunjuk Al-Qur'an, dan menuduh bahwa Al-Qur'an itu adalah kabar bohong, dongeng orang dahulu, sihir, diada-adakan oleh Muhammad, dan tidak ada artinya sama sekali. Tuduhan orang-orang musyrik itu diterangkan pula dalam firman Allah:\n\nDan orang-orang kafir berkata,\"(Al-Qur'an) ini tidak lain hanyalah kebohongan yang diada-adakan oleh dia (Muhammad), dibantu oleh orang- orang lain,\" Sungguh, mereka telah berbuat zalim dan dusta yang besar. Dan mereka berkata, \"(Itu hanya) dongeng-dongeng orang-orang terdahulu, yang diminta agar dituliskan, lalu dibacakanlah dongeng itu kepadanya setiap pagi dan petang.\" (al-Furqan/25: 4-5)\n\nMenurut ajaran Islam, beriman dan bertakwanya seseorang tidak berhubungan dengan status orang itu apakah ia kaya atau miskin, bangsawan atau budak, penguasa atau rakyat jelata, dan berilmu atau tidak berilmu. Setiap orang, apa pun jenis bangsa, warna kulit, dan tingkatannya dalam masyarakat dapat menjadi seorang muslim yang beriman dan bertakwa karena pokok iman dan takwa itu adalah kebersihan hati, keinginan mencari kebenaran yang hakiki, dan kemampuan mengendalikan hawa nafsu. Dalam sebuah hadis disebutkan: \n\nKetahuilah bahwa dalam tubuh manusia itu ada segumpal darah. Apabila baik, baik pula seluruh tubuh, dan apabila rusak, rusak pulalah seluruh tubuh. Ketahuilah bahwa segumpal darah itu adalah hati. (Riwayat al-Bukhari dan Muslim dari an-Nu'man bin Basyir)",
          "12": "Ayat ini menolak tuduhan orang-orang musyrik terhadap Al-Qur'an dan membuktikan kebenarannya dengan mengatakan, \"Hai orang-orang kafir, kamu semua telah menyaksikan bahwa Allah telah menurunkan Taurat yang mengandung pokok-pokok agama yang dibawa oleh Nabi Musa dan sebagai rahmat bagi Bani Israil. Taurat yang diturunkan kepada Nabi Musa mengisyaratkan kedatangan Muhammad sebagai nabi dan rasul terakhir yang membawa Al-Qur'an yang berbahasa Arab, membenarkan kitab-kitab terdahulu yang diturunkan Allah agar dengan kitab itu ia memperingatkan semua manusia, memberi kabar gembira kepada orang-orang yang mengamalkan isinya, dan memperingatkan bahwa azab serta ancaman Allah akan menimpa orang-orang yang ingkar kepadanya.\"\n\nSekalipun kitab Taurat yang ada sekarang telah banyak dinodai oleh tangan manusia, masih banyak terdapat ayat-ayat yang mengisyaratkan kedatangan Nabi Muhammad saw sebagai nabi dan rasul terakhir yang paling sempurna. Hal ini dapat dibaca dalam kitab Kejadian 13: 2, 3 ; 15; 16: 10, 12 dan masih banyak lagi. Dalam kitab Kejadian 21: 13, diterangkan kedatangan nabi yang paling besar dari keturunan Nabi Ismail, \"Maka anak sahayamu itu pun akan aku jadikan suatu bangsa karena ia pun dari benihmu.\"\n\nDemikian juga dalam Kejadian 21: 13, \"Bangunlah engkau, angkatlah budak itu, sokonglah dia karena aku hendak menjadikan dia suatu bangsa yang besar.\"\n\nJuga dalam kitab Kejadian 17: 20, \"Maka akan hal Ismail itupun telah kululuskan permintaanmu: bahwa sesungguhnya Aku telah memberkati akan dia dan membiarkan dia dan memperbanyak dia amat sangat dan dua belas orang raja akan berpencar daripadanya dan Aku akan menjadikan dia satu bangsa yang besar.\"\n\nSudah tentu yang dimaksud ayat-ayat Taurat di atas adalah Nabi Muhammad. Nabi Musa dalam kitab Ulangan 18: 17-22 juga telah menyatakan kedatangan Nabi Muhammad saw: \n\nMaka pada masa itu berfirmanlah Tuhan kepadaku (Musa). Benarlah kata mereka itu (Bani Israil). Bahwa Aku (Allah) akan menjadikan bagi mereka itu seorang Nabi dari antara segala saudaranya (yaitu dari Bani Ismail) yang seperti engkau (hai Musa), dan aku akan memberi segala firman-Ku dalam mulutnya dan dia akan mengatakan kepadanya segala yang Kusuruh akan dia.\n\nBahwa sesungguhnya barang siapa yang tiada mau mendengar akan segala firman-Ku yang akan dikatakan olehnya dengan nama-Ku, niscaya Aku menurut orang itu kelak.\n\nTetapi yang melakukan dirinya dengan sombong dan mengatakan firman dengan nama-Ku, yang tiada Kusuruh katakan, atau yang berkata dengan nama dewa-dewa. Nabi itu akan mati dibunuh hukumnya.\n\nMaka jikalau kamu kira berkata dalam hatimu demikian: Dengan apakah boleh kami ketahui akan perkataan itu bukannya firman Tuhan adanya.\n\nBahwa jikalau Nabi itu berkata demi nama Tuhan lalu orang dikatakannya tiada jadi atau tiada datang, yaitulah perkataan yang bukan firman Tuhan adanya, maka Nabi itu pun telah berkata dengan sombongnya, janganlah kamu takut akan dia.\n\nDalam ayat-ayat Taurat yang enam di atas terdapat beberapa isyarat yang dapat dijadikan dalil untuk menyatakan nubuat tentang Nabi Muhammad. Dari perkataan \"seorang nabi dari antara segala saudaranya\" menunjukkan bahwa orang yang dinubuatkan oleh Tuhan itu akan datang dari saudara-saudara Bani Israil, bukan dari Bani Israil sendiri. Adapun saudara-saudara Bani Israil itu ialah Bani Ismail (bangsa Arab) sebab Ismail adalah saudara tua dari Ishak, bapak dari Israil (Yakub). Dan Nabi Muhammad saw jelas berasal dari keturunan Ismail.\n\nKemudian kalimat \"Yang seperti engkau\" memberi pengertian bahwa nabi yang akan datang itu haruslah yang seperti Nabi Musa, maksudnya, nabi yang membawa agama baru seperti Musa. Seperti diketahui, Nabi Muhammad itulah yang membawa syariat baru (agama Islam) yang juga berlaku untuk Bani Israil.\n\nLalu diterangkan lagi bahwa Nabi itu tidak sombong dan tidak akan mati dibunuh. Muhammad saw, seperti dimaklumi, bukanlah orang yang sombong, baik sebelum menjadi nabi maupun setelah menjadi nabi. Sebelum menjadi nabi beliau sudah disenangi masyarakatnya terbukti dengan gelar al-Amin artinya \"orang terpercaya\". Kalau beliau sombong, tentulah beliau tidak akan diberi gelar yang amat terpuji itu. Sesudah menjadi nabi, beliau justru lebih ramah.\n\nUmat Nasrani mengakui nubuat itu kepada Nabi Isa di samping mereka mengakui pula bahwa Isa mati terbunuh. Hal ini jelas bertentangan dengan ayat nubuat itu sendiri, sebab nabi yang dimaksud itu haruslah tidak mati terbunuh (tersalib atau sebab lain).\n\nItulah penegasan-penegasan yang diberikan para nabi sebelum kedatangan Nabi Muhammad saw. Semuanya diketahui oleh orang-orang kafir Mekah yang mengingkari kenabian Muhammad saw.",
          "13": "Ayat ini menerangkan keadaan orang-orang yang benar-benar beriman kepada Allah, yaitu orang-orang yang mengakui dan mengatakan, \"Tuhan kami adalah Allah\", kemudian ia istikamah, yakni tetap dalam pengakuan itu, tidak dicampuri sedikit pun dengan perbuatan-perbuatan syirik. Orang tersebut konsisten mengikuti garis yang telah ditentukan agama, mengikuti perintah Allah dengan sebenar-benarnya, dan menjauhi larangan-Nya. Maka orang yang semacam itu tidak ada suatu kekhawatiran dalam diri mereka di hari Kiamat, karena Allah menjamin keselamatan mereka. Mereka tidak perlu bersedih terhadap apa yang mereka tinggalkan di dunia setelah wafat, begitu juga terhadap sesuatu yang luput dan hilang dari mereka selama hidup di dunia itu serta tidak ada penyesalan sedikit pun pada diri mereka.",
          "14": "Pada ayat ini, Allah menegaskan bahwa orang-orang yang beriman kepada Allah kemudian istikamah dalam keimanannya dengan melaksanakan ibadah dan perintah-perintah Allah, tetap bertawakal, dan menghindari larangan-larangan-Nya, akan memperoleh kebahagiaan abadi di akhirat, yaitu menjadi penghuni surga dan kekal di dalamnya. Bagi mereka disediakan berbagai kenikmatan di surga, sebagai balasan atas amal saleh mereka di dunia.\n\nSikap istikamah setelah beriman dan melaksanakan ibadah kepada Allah merupakan hal yang penting dan sangat terpuji, sebagaimana hadis Nabi saw yang memerintahkan kepada kita semua:\n\nKatakanlah, \"Aku beriman kepada Allah,\" lalu beristikamahlah. (Riwayat Muslim dari Sufyan bin 'Abdullah ats-saqafi)",
          "15": "Diriwayatkan bahwa ayat ini diturunkan berhubungan dengan Abu Bakar. Beliau termasuk orang yang beruntung karena beliau termasuk sahabat yang paling dekat dengan Nabi saw. Salah satu putri beliau, yaitu 'Aisyah, adalah istri Rasulullah saw, dan kedua orang tuanya yaitu Abu Quhafah dan Ummul Khair binti Shakhar bin Amir telah masuk Islam, demikian pula anak-anak beliau yang lain dan saudara-saudaranya. Beliau bertobat, bersyukur, dan berdoa kepada Allah karena memperoleh nikmat yang tiada tara.\n\nAllah memerintahkan agar semua manusia berbuat baik kepada ibu-bapaknya, baik ketika keduanya masih hidup maupun telah meninggal dunia. Berbuat baik ialah melakukan semua perbuatan yang baik sesuai dengan perintah agama. Berbuat baik kepada orang tua ialah menghormatinya, memelihara, dan memberi nafkah apabila ia sudah tidak mempunyai penghasilan lagi. Sedangkan berbuat baik kepada kedua orang tua setelah meninggal dunia ialah selalu mendoakannya kepada Allah agar diberi pahala dan diampuni segala dosanya. Berbuat baik kepada kedua orang tua termasuk amal yang tinggi nilainya di sisi Allah, sedangkan durhaka kepadanya termasuk perbuatan dosa besar.\n\nAnak merupakan penerus kehidupan bagi kedua orang tuanya, cita-cita atau perbuatan yang tidak dapat dilakukan semasa hidupnya diharapkan dapat dilanjutkan oleh anaknya. Oleh karena itu, anak juga merupakan harapan orang tuanya, bukan saja harapan sewaktu ia masih hidup, tetapi juga harapan setelah meninggal dunia. Dalam hadis Rasulullah saw, diterangkan bahwa di antara amal yang tidak akan putus pahalanya diterima oleh manusia sekalipun ia telah meninggal dunia ialah doa dari anak-anaknya yang saleh yang selalu ditujukan untuk orang tuanya.\n\nRasulullah saw bersabda:\n\nApabila manusia meninggal dunia terputuslah amalnya kecuali tiga perkara: sadaqah jariyah, ilmu yang bermanfaat, atau anak saleh yang mendoakannya. (Riwayat Muslim dari Abu Hurairah)\n\nDari hadis ini dapat dipahami bahwa orang tua hendaklah mendidik anaknya agar menjadi orang yang taat kepada Allah, suka beramal saleh, melaksanakan perintah Allah, dan menjauhi larangan-Nya. Pendidikan dapat dilakukan dengan berbagai macam cara, misalnya dengan pendidikan di sekolah, pendidikan di rumah, memberikan contoh yang baik, dan sebagainya. Hanya anak-anak yang saleh yang taat kepada Allah dan suka beramal saleh, yang dapat berbakti dan berdoa untuk orang tuanya.\n\nPada ayat ini, Allah menerangkan secara khusus mengapa orang harus berbuat baik kepada ibunya. Pengkhususan itu menunjukkan bahwa ketika anak akan berbuat baik kepada orang tuanya, ibu harus didahulukan daripada ayah. Sebab perhatian, pengorbanan, dan penderitaan ibu lebih besar dan lebih banyak dalam memelihara dan mendidik anak dibandingkan dengan perhatian, pengorbanan, dan penderitaan yang dialami oleh ayah. Di antara pengorbanan, perhatian, dan penderitaan ibu ialah:\n\n1. Ibu mengandung anak dalam keadaan penuh cobaan dan penderitaan. Semula dirasakan kandungan itu ringan, sekalipun telah mulai timbul perubahan-perubahan dalam dirinya, seperti makan tidak enak, perasaan gelisah, kadang-kadang mual, muntah, dan sebagainya. Semakin lama kandungan itu semakin berat. Bertambah berat kandungan itu bertambah berat pula cobaan yang ditanggung ibu, sampai saat-saat melahirkan. Hampir-hampir cobaan itu tidak tertanggungkan lagi, serasa nyawa akan putus.\n\n2. Setelah anak lahir, ibu memelihara dan menyusuinya. Masa mengandung dan menyusui ialah 30 bulan. Ayat Al-Qur'an menerangkan bahwa masa menyusui yang paling sempurna ialah dua tahun. Allah berfirman:\n\nDan ibu-ibu hendaklah menyusui anak-anaknya selama dua tahun penuh, bagi yang ingin menyusui secara sempurna. (al-Baqarah/2: 233)\n\nDalam ayat ini diterangkan bahwa masa menyusui dan hamil adalah 30 bulan. Hal ini berarti bahwa ibu harus menumpahkan perhatiannya selama masa hamil dan menyusui, yaitu 30 bulan. \n\nSehubungan dengan ayat ini, ada riwayat yang mengatakan bahwa seorang wanita melahirkan dalam masa kandungan enam bulan. Maka perkara itu diajukan kepada 'Utsman bin 'Affan, khalifah waktu itu. 'Utsman bermaksud melakukan hukum had (merajam) karena wanita itu disangka telah berbuat zina lebih dahulu sebelum melakukan akad nikah. Maka 'Ali bin Abi thalib mengemukakan pendapat kepada 'Utsman dengan berkata, \"Allah swt menyatakan bahwa masa menyusui itu dua tahun (24 bulan), dan dalam ayat ini dinyatakan bahwa masa mengandung dan masa menyusui 30 bulan. Hal ini berarti bahwa masa hamil itu paling kurang 6 bulan. Berarti wanita tidak dapat dihukum rajam karena ia melahirkan dalam masa hamil yang ditentukan ayat.\" Mendengar itu, 'Utsman bin 'Affan mengubah pendapatnya semula dan mengikuti pendapat 'Ali bin Abi thalib. \n\nIbnu 'Abbas berkata, \"Apabila seorang wanita mengandung selama sembilan bulan, ia cukup menyusui anaknya selama 21 bulan, apabila ia mengandung 7 bulan, cukup ia menyusui anaknya 23 bulan, dan apabila ia mengandung 6 bulan ia menyusui anaknya selama 24 bulan.\n\nOleh karena itu, maka amat bijaksana kalau seorang anak disusui dengan air susu ibu (ASI), sesuai dengan ajaran Al-Qur'an dan sesuai pula dengan tuntunan ilmu kedokteran, kecuali kalau karena keadaan terpaksa bisa diganti dengan susu produk lain.\n\n3. Ibulah yang paling banyak berhubungan dengan anak dalam memelihara dan mendidiknya, sampai anaknya sanggup mandiri. Kewajiban ibu memelihara dan mendidik anaknya itu tidak saja selama ibu terikat dengan perkawinan dengan bapak si anak, tetapi juga pada saat ia telah bercerai dengan bapak si anak. \n\nKecintaan dan rasa sayang ibu terhadap anaknya adalah ketentuan dari Allah, sebagaimana firman-Nya:\n\nDan Kami perintahkan kepada manusia (agar berbuat baik) kepada kedua orang tuanya. Ibunya telah mengandungnya dalam keadaan lemah yang bertambah-tambah, dan menyapihnya dalam usia dua tahun. (Luqman/31: 14)\n\nSehubungan dengan persoalan di atas, Rasulullah saw menjawab pertanyaan seorang sahabat dalam salah satu hadis:\n\nDari Bahz bin hakim dari bapaknya dari kakeknya, mudah-mudahan Allah meridainya, ia berkata, \"Aku berkata, 'Ya Rasulullah, kepada siapa aku berbakti? Rasulullah menjawab, 'Kepada ibumu. Aku berkata, 'Kemudian kepada siapa? Jawab Rasulullah, 'Kepada ibumu. Aku berkata, 'Kemudian kepada siapa? Jawab Rasulullah, 'Kepada ibumu. Aku berkata, 'Kemudian kepada siapa? Rasulullah berkata, 'Kepada ayahmu, kemudian kepada karibmu yang paling dekat, lalu yang paling dekat.\" (Riwayat Abu Dawud dan at-Tirmidhi) \n\nAdapun tanggung jawab ayah sebagai orang tua adalah sebagai kepala keluarga yang bertanggung jawab memelihara, memberi nafkah, dan menjaga ketenteraman dan keharmonisan keluarga. Ayah sebagai pemimpin keluarga dapat membagi tugas-tugas kepada istri, anak-anak yang lebih tua, maupun anggota-anggota keluarga lain yang tinggal dalam keluarga tersebut. Tanggung jawab spiritual sebagai ayah ialah membawa keluarga pada kedekatan kepada Allah, melaksanakan ibadah dengan benar dan melahirkan generasi baru, sebagaimana firman Allah:\n\nDan orang-orang yang berkata, \"Ya Tuhan kami, anugerahkanlah kepada kami pasangan kami dan keturunan kami sebagai penyenang hati (kami), dan jadikanlah kami pemimpin bagi orang-orang yang bertakwa.\" (al-Furqan/25: 74)\n\nAyat ini menerangkan sikap yang baik dari seorang anak kepada orang tuanya yang telah mengasuhnya sejak kecil sampai dewasa, pada saat-saat orang tuanya itu telah berusia lanjut, lemah, dan pikun. Waktu itu si anak telah berumur sekitar 40 tahun, ia berdoa, \"Wahai Tuhanku, berilah aku bimbingan dan petunjuk untuk mensyukuri nikmat-Mu yang tiada taranya yang telah engkau berikan kepadaku, baik yang berhubungan dengan petunjuk sehingga aku dapat melaksanakan perintah-Mu dan menghindari larangan-Mu, maupun petunjuk yang telah Engkau berikan kepada kedua orang tuaku sehingga mereka mencurahkan rasa kasih sayangnya kepadaku, sejak aku masih dalam kandungan, waktu aku masih kecil sampai aku dewasa. Wahai Tuhanku, terimalah semua amalku dan tanamkan dalam diriku semangat ingin beramal saleh yang sesuai dengan keridaan-Mu, dan bimbinglah pula keturunanku mengikuti jalan yang lurus; jadikanlah mereka orang yang bertakwa dan beramal saleh.\"\n\nSehubungan dengan ayat ini Ibnu 'Abbas berkata, \"Barang siapa telah mencapai umur 40 tahun, sedangkan perbuatan baiknya belum dapat mengalahkan perbuatan jahatnya, maka hendaklah ia bersiap-siap untuk masuk neraka.\"\n\nPada riwayat yang lain Ibnu 'Abbas berkata, \"Allah telah memperkenankan doa Abu Bakar. Beliau telah memerdekakan sembilan orang budak mukmin di antaranya Bilal dan Amir bin Fuhairah. Beliau tidak pernah bermaksud hendak melakukan suatu perbuatan baik, melainkan Allah menolongnya. Beliau berdoa, \"Wahai Tuhanku, berikanlah kebaikan pada diriku, dengan memberikan kebaikan kepada anak cucuku. Jadikanlah kebaikan dan ketakwaan itu menjadi darah daging bagi keturunanku.\" Allah telah memperkenankan doa beliau. Tidak seorang pun dari anak-anaknya yang tidak beriman kepada Allah; ibu-bapaknya dan anak-anaknya semua beriman. Oleh karena itu, tidak seorang pun di antara sahabat Rasulullah yang memperoleh keutamaan seperti ini.\n\nDiriwayatkan oleh Abu Dawud dari Ibnu Mas'ud dalam Sunan-nya bahwa Rasulullah saw pernah mengajarkan doa berikut ini:\n\nWahai Tuhanku, timbulkanlah rasa kasih sayang dalam hati kami; timbulkanlah perdamaian di antara kami, bimbinglah kami ke jalan keselamatan. Lepaskanlah kami dari kegelapan dan bimbinglah kami menuju cahaya yang terang. Jauhkanlah kami dari segala kekejian baik yang lahir maupun yang batin. Berkatilah kami pada pendengaran kami, pada penglihatan kami, pada hati kami, pada istri-istri kami, pada keturunan kami. Terimalah tobat kami, sesungguhnya Engkau Maha Penerima tobat lagi Maha Penyayang. Jadikanlah kami orang yang selalu mensyukuri nikmat Engkau serta memuji-Mu, karena pemberian nikmatmu itu dan sempurnakanlah nikmat-Mu itu atas kami. (Riwayat Abu Dawud)",
          "16": "Dalam ayat ini diterangkan balasan yang akan diterima oleh orang saleh yang memiliki sifat sebagai anak yang saleh sebagaimana disebutkan pada ayat sebelumnya. Orang-orang yang semacam itu adalah orang-orang yang mempunyai amalan yang paling baik selama ia hidup di dunia menurut pandangan Allah karena keikhlasan, kepatuhan, dan ketaatan mereka melaksanakan agama-Nya. Orang-orang yang seperti itu akan dimaafkan segala kesalahannya karena selalu bertobat kepada-Nya dengan tobat yang sebenarnya. Ia memperoleh surga yang penuh kenikmatan di akhirat.\n\nPada akhir ayat ini, Allah menegaskan bahwa balasan yang disebutkan itu adalah datang dari Allah, dan semua yang pernah dijanjikan-Nya, baik janji akan memberi pahala kepada orang-orang yang beriman maupun peringatan akan mengazab orang-orang kafir pasti ditepatinya; tidak satu pun yang akan dimungkiri-Nya.",
          "17": "Ayat ini menerangkan ancaman Allah kepada orang yang ketika diajak oleh kedua orang tuanya untuk beriman kepada Allah dan hari akhirat, ia berkata, \"Ah, apakah yang bapak-ibu katakan ini; aku tidak senang kepada bapak-ibu yang mengatakan bahwa aku akan dibangkitkan dari kubur dalam keadaan hidup, sesudah aku mati dan hancur luluh bersama tanah. Apakah mungkin daging-daging yang telah hancur luluh bersama tanah dan tulang-belulang yang telah berserakan itu akan dapat kembali dikumpulkan dan menjadi tubuh yang hidup seperti semula? Alangkah aneh dan lucunya kepercayaan itu, wahai kedua orang tuaku. Bukankah telah banyak umat dahulu, sebelum kita, yang telah melakukan semua hal sesuai dengan keinginan mereka? Ada di antara mereka yang mengikuti ajaran rasul-rasul yang telah diutus kepada mereka, dan banyak pula di antara mereka yang mengingkarinya, tetapi tidak seorang pun di antara mereka yang telah dibangkitkan seperti yang ibu dan ayah katakan itu. Seandainya benar yang dikatakan ayah dan ibu itu, tentu kita akan melihat bukti-buktinya sekarang, dan tentu kita akan bertemu dengan nenek moyang kita yang telah mati dahulu.\"\n\nMendengar jawaban anaknya itu, timbullah rasa sedih dan kasihan dalam hati orang tua itu. Mereka merasa sedih karena sikap anaknya yang seakan-akan tidak menghormatinya lagi. Mereka merasa kasihan karena yakin bahwa anaknya itu kelak akan mendapat azab Allah di akhirat. Sekalipun demikian, mereka tidak putus asa untuk menyeru anaknya itu dan memohon kepada Allah Yang Maha Pemurah. Mereka berkata, \"Percayalah wahai anakku, bahwa Allah pasti menepati janji-Nya, dan hendaklah engkau yakin bahwa engkau benar-benar akan dibangkitkan nanti, karena janji Allah adalah janji yang hak, yang pasti ditepati, semoga Allah memberi kamu petunjuk.\"\n\nAllah melarang anak berkata ah kepada ibu dan ayahnya, atau kata-kata lain yang menyakitkan hati orang tuanya, karena keduanya telah berjasa memelihara dan mendidiknya sejak kecil, bahkan sejak dalam kandungan sampai dewasa, sebagaimana firman Allah: \n\nDan Kami perintahkan kepada manusia (agar berbuat baik) kepada kedua orang tuanya. Ibunya telah mengandungnya dalam keadaan lemah yang bertambah-tambah, dan menyapihnya dalam usia dua tahun. Bersyukurlah kepada-Ku dan kepada kedua orang tuamu. Hanya kepada Aku kembalimu. (Luqman/31: 14)\n\nJika orang tua mendidik anaknya untuk beriman kepada Allah dan hari akhir, kemudian sang anak menolak dan mengatakan ah, yang demikian merupakan kedurhakaan yang besar dan kesesatan yang nyata. Pada ayat yang lain disebutkan: \n\nDan Tuhanmu telah memerintahkan agar kamu jangan menyembah selain Dia dan hendaklah berbuat baik kepada ibu bapak. Jika salah seorang di antara keduanya atau kedua-duanya sampai berusia lanjut dalam pemeliharaanmu, maka sekali-kali janganlah engkau mengatakan kepada keduanya perkataan \"ah\" dan janganlah engkau membentak keduanya, dan ucapkanlah kepada keduanya perkataan yang baik. (al-Isra'/17: 23)\n\nMenanggapi ajakan kedua orang tuanya, anak itu menjawab dengan sikap melecehkan keduanya dengan mengatakan bahwa ajakan orang tuanya untuk mempercayai Allah dan hari akhir itu hanya dongengan orang dahulu kala. Ia beranggapan kedua orang tuanya telah terpengaruh dongengan bohong sehingga mengakui kebenarannya. Menurutnya, adanya hari kebangkitan adalah suatu kepercayaan yang mustahil akan terjadi.",
          "18": "Allah mengancam setiap anak yang bersikap seperti yang diterangkan ayat di atas kepada orang tuanya. Mereka pasti akan ditimpa azab di akhirat nanti, mendapat murka dan kemarahan Allah, dan dimasukkan ke dalam neraka yang apinya menyala-nyala, bersama umat-umat dahulu yang mendurhakai Allah, mendustakan para rasul, dan melecehkan kedua orang tuanya, baik mereka dari golongan jin maupun manusia. Dengan demikian, neraka itu akan dipenuhi dengan mereka semua seperti yang dijanjikan oleh Allah.\n\nDari ayat ini dapat dipahami bahwa jin itu adalah makhluk Allah yang sama kewajibannya dengan manusia. Di antara mereka, ada yang menganut agama Islam seperti kaum Muslimin, dan ada pula yang kafir. Mereka hidup berketurunan dan mati seperti manusia.\n\nAbu hayyan berkata, \"Al-hasan al-Basri berkata dalam suatu halaqah (majlis) pelajaran, \"Jin itu tidak mati.\" Maka Qatadah membantahnya dengan mengemukakan ayat ini. Lalu al-hasan al-Basri terdiam.\n\nPada akhir ayat ini diterangkan sebab Allah mengazab mereka, jin dan manusia, adalah karena mereka adalah golongan yang merugi. Mereka merugi karena telah menyia-nyiakan fitrah yang telah diberikan Allah kepada mereka. Sejak dalam kandungan, manusia telah diberi Tuhan suatu naluri, yaitu potensi untuk menjadi orang yang beriman. Akan tetapi, potensi yang ada pada dirinya itu disia-siakannya, dengan menuruti hawa nafsu dan godaan setan, serta terpengaruh oleh kehidupan dunia dan lingkungan sehingga mereka menjadi orang-orang merugi di dunia apalagi di akhirat.\n\nBerbahagialah orang-orang yang dapat memanfaatkan fitrah yang telah ditanamkan Allah pada dirinya sehingga ia beriman kepada Allah dan rasul-Nya, dan senantiasa mendapat bimbingan, hidayah, dan taufik dalam kehidupannya. Firman Allah swt: \n\nMaka hadapkanlah wajahmu dengan lurus kepada agama (Islam); (sesuai) fitrah Allah disebabkan Dia telah menciptakan manusia menurut (fitrah) itu. Tidak ada perubahan pada ciptaan Allah. (Itulah) agama yang lurus, tetapi kebanyakan manusia tidak mengetahui. (ar-Rum/30: 30)",
          "19": "Allah menerangkan bahwa manusia dan jin mempunyai martabat tertentu di sisi-Nya pada hari Kiamat, sesuai dengan perbuatan dan amal yang telah mereka kerjakan semasa hidup di dunia. Golongan yang beriman dan beramal saleh terbagi dalam beberapa martabat yang berbeda-beda tingginya, sedangkan golongan yang kafir kepada Allah juga terbagi dalam beberapa martabat yang berbeda-beda rendahnya. Perbedaan tinggi atau rendahnya martabat disebabkan karena adanya perbedaan iman dan amal seseorang, di samping ada pula perbedaan kekafiran dan kedurhakaan. Dengan perkataan lain, Allah menentukan martabat yang berbeda itu karena perbedaan amal manusia dan jin itu sendiri. Ada di antara mereka yang teguh iman dan banyak amalnya, sedangkan yang lain lemah dan sedikit. Demikian pula tentang kekafiran, ada orang yang sangat kafir kepada Allah dan ada yang kurang kekafiran dan keingkarannya. Orang yang paling mulia di sisi Allah adalah orang yang paling takwa kepada-Nya.\n\nAllah menyediakan martabat-martabat yang berbeda untuk membuktikan keadilan-Nya kepada makhluk-Nya, dan agar dapat memberi balasan yang sempurna kepada setiap jin dan manusia itu. Perbuatan takwa diberi balasan sesuai dengan tingkat ketakwaannya, dan perbuatan kafir dibalas pula sesuai dengan tingkat kekafirannya.",
          "20": "Setelah menerangkan bahwa setiap jin dan manusia akan memperoleh balasan yang adil dari-Nya, Allah menerangkan keadaan orang-orang kafir pada saat mereka dihadapkan ke neraka. Allah memerintahkan kepada Rasulullah saw agar menyampaikan kepada orang- orang kafir keadaan mereka ketika dibawa ke dalam neraka. Kepada mereka dikatakan bahwa segala macam kebahagiaan dan kenikmatan yang diperuntukkan bagi mereka telah lengkap dan sempurna mereka terima semasa hidup di dunia. Tidak ada satu pun bagian yang akan mereka nikmati lagi di akhirat. Yang tinggal hanyalah kehinaan, kerendahan, azab pedih yang akan mereka alami sebagai pembalasan atas kesombongan, kefasikan, kezaliman, kemaksiatan, dan kekafiran yang mereka lakukan selama hidup di dunia.\n\nAyat ini memperingatkan manusia agar meninggalkan hidup mewah yang berlebih-lebihan, meninggalkan perbuatan mubazir, maksiat, dan menganjurkan agar kaum Muslimin hidup sederhana, tidak berlebih-lebihan menggunakan sesuatu sesuai dengan keperluan dan keadaan, dan disesuaikan dengan tujuan hidup seorang muslim. Seandainya ada kelebihan harta, hendaklah diberikan kepada orang-orang miskin, orang-orang terlantar, dan anak yatim yang tidak ada yang bertanggung jawab atasnya, dan gunakanlah harta itu untuk keperluan meninggikan kalimat Allah.\n\nDiriwayatkan oleh al-Baihaqi dan lain-lain dari Ibnu 'Umar bahwa 'Umar melihat uang dirham di tangan Jabir bin 'Abdullah, maka beliau berkata, \"Uang dirham apakah itu?\" Jabir menjawab, \"Aku bermaksud membeli sepotong daging yang sudah lama diidamkan oleh keluargaku.\" 'Umar berkata, \"Apakah setiap kamu menginginkan sesuatu, lalu kamu beli? Bagaimana pendapatmu tentang ayat ini? Kamu telah menghabiskan rezekimu yang baik dalam kehidupan duniamu saja, dan kamu telah bersenang-senang dengannya?\" \n\nDari riwayat di atas dapat kita tarik pelajaran bahwa 'Umar bin al-Khaththab menasihati Jabir bin 'Abdullah dengan ayat ini agar tidak terlalu menuruti keinginannya dan mengingatkan bahwa kesenangan dan kebahagiaan di dunia ini hanya bersifat sementara, sedangkan kebahagiaan yang abadi ada di akhirat. Oleh karena itu, kita harus menggunakan segala rezeki yang telah dianugerahkan Allah dengan sebaik-baiknya, sesuai dengan ketentuan yang digariskan agama.\n\nTentang hidup sederhana ini tergambar dalam kehidupan keluarga Rasulullah saw sebagaimana disebutkan dalam hadis: \n\nDiriwayatkan dari sauban, ia berkata, \"Rasulullah saw apabila akan bepergian, keluarga terakhir yang dikunjunginya adalah Fatimah. Dan keluarganya yang lebih dahulu didatanginya apabila ia kembali dari perjalanan ialah Fatimah. Beliau kembali dari Gazah (peperangan), lalu beliau datang ke rumah Fatimah, dan beliau mengusap pintu rumah dan melihat gelang perak di tangan Hasan dan Husein, beliau kembali dan tidak masuk. Tatkala Fatimah melihat yang demikian, ia berpendapat bahwa Rasulullah saw tidak masuk ke rumahnya itu karena beliau melihat barang-barang itu. Maka Fatimah menyobek-nyobek kain pintu itu dan mencabut gelang-gelang dari tangan kedua anaknya dan memotong-motongnya, lalu kedua anaknya menangis, maka ia membagi-bagikannya kepada kedua anak itu. Maka keduanya pergi menemui Rasulullah saw dalam keadaan menangis, lalu Rasulullah saw mengambil barang-barang itu dari keduanya seraya berkata, 'Hai sauban, pergilah membawa barang-barang itu kepada Bani Fulan dan belikanlah untuk Fatimah kalung dari kulit lokan dan dua gelang dari gading, maka sesungguhnya mereka adalah keluargaku, dan aku tidak ingin mereka menghabiskan rezeki mereka yang baik sewaktu hidup di dunia ini.\" (Riwayat Ahmad dan al-Baihaqi)\n\nHadis ini maksudnya bukan melarang kaum Muslimin memakai perhiasan, suka kepada keindahan, menikmati rezeki yang telah dianugerahkan Allah, melainkan untuk menganjurkan agar orang hidup sesuai dengan kemampuan diri sendiri, tidak berlebih-lebihan, selalu menenggang rasa dalam hidup bertetangga dan dalam berteman. Jangan sampai harta yang dimiliki dengan halal itu menjadi sumber iri hati dan rasa dengki tetangga dan sahabat. Jangan pula hidup boros, dan berbelanja melebihi kemampuan. Ingatlah selalu bahwa banyak orang-orang lain yang memerlukan bantuan, masih banyak biaya yang diperlukan untuk meninggikan kalimat Allah. Rasulullah saw selalu merasa cukup bila memperoleh sesuatu dan bersabar bila sedang tak punya; makan kue jika ada kesanggupan membelinya, minum madu bila kebetulan ada, makan daging bila mungkin mendapatkannya. Hal yang demikian itu menjadi pegangan dan kebiasaan hidup beliau. Beliau selalu bersyukur kepada Allah setiap menerima nikmat-Nya.\n\nYang dilarang ialah memakai perhiasan secara berlebih-lebihan, bersenang-senang tanpa mengingat adanya kehidupan abadi di akhirat nanti. Memakai perhiasan dengan tidak berlebih-lebihan dan tidak menimbulkan iri hati orang lain itu dibolehkan. Allah berfirman:\n\nKatakanlah (Muhammad), \"Siapakah yang mengharamkan perhiasan dari Allah yang telah disediakan untuk hamba-hamba-Nya dan rezeki yang baik- baik? Katakanlah, \"Semua itu untuk orang-orang yang beriman dalam kehidupan dunia, dan khusus (untuk mereka saja) pada hari Kiamat. Demikianlah Kami menjelaskan ayat-ayat itu untuk orang-orang yang mengetahui. (al-A'raf/7: 32)",
          "21": "Allah memerintahkan kepada Rasulullah saw agar menyampaikan kepada orang-orang musyrik Mekah kisah Nabi Hud yang berasal dari kaum 'Ad, ketika ia memperingatkan kepada kaumnya yang berdomisili di Ahqaf itu akan azab Tuhan. Allah menjelaskan bahwa mengutus para rasul dan nabi kepada kaumnya masing-masing adalah suatu hal yang biasa, dan sudah menjadi sunatullah.\n\nSebelum Nabi Hud, Allah telah mengutus rasul-rasul dan nabi-nabi yang memberi peringatan kepada kaum mereka masing-masing, begitu pula sesudahnya. Nabi Hud menyeru kaum agar tidak menyembah kecuali hanya kepada Allah, Tuhan Yang Maha Esa, yang telah menciptakan mereka, yang memberi rezeki sehingga mereka dapat hidup dengan rezeki itu dan menjaga kelangsungan hidup. Hendaklah mereka takut akan malapetaka yang akan menimpa nanti akibat kedurhakaan itu. Di akhirat nanti mereka akan mendapat azab yang pedih.\n\nKeadaan pada hari Kiamat itu diterangkan pada firman Allah:\n\nSungguh, pada hari keputusan (hari Kiamat) itu adalah waktu yang dijanjikan bagi mereka semuanya, (yaitu) pada hari (ketika) seorang teman sama sekali tidak dapat memberi manfaat kepada teman lainnya dan mereka tidak akan mendapat pertolongan. (ad-Dukhan/44: 40-41)\n\nAl-Ahqaf berarti \"bukit-bukit pasir\". Kemudian nama itu dijadikan nama sebuah daerah yang terletak antara negeri Oman dan Mahrah. Daerah itu dinamai demikian oleh kaum 'Ad. Sekarang daerah itu terkenal dengan nama \"Sahara al-Ahqaf\", dan termasuk salah satu daerah yang menjadi wilayah Kerajaan Saudi Arabia bagian selatan. Daerah itu terletak di sebelah utara Hadramaut, sebelah timur dibatasi oleh laut Yaman, dan sebelah selatan berbatasan dengan Nejed.\n\nSemula kaum 'Ad menganut agama yang berdasarkan tauhid. Setelah berlalu beberapa generasi, kepercayaan tauhid itu dimasuki unsur-unsur syirik, dimulai dengan penghormatan kepada pembesar-pembesar dan pahlawan mereka yang telah meninggal dunia, dengan membuatkan patung-patungnya. Lama-kelamaan, pemberian penghormatan ini berubah menjadi pemberian penghormatan kepada patung, yang akhirnya berubah menjadi penyembahan kepada dewa, dengan arti bahwa pembesar dan pahlawan yang telah meninggal mereka anggap sebagai dewa. Untuk mengembalikan mereka kepada agama yang benar yaitu agama tauhid, Allah mengutus seorang rasul yang diangkat dari keluarga mereka sendiri, yaitu Nabi Hud. Hud menyeru mereka agar kembali kepada kepercayaan yang benar, yaitu kepercayaan tauhid, dengan hanya menyembah Allah semata, tidak lagi mempersekutukan-Nya dengan tuhan-tuhan yang lain.",
          "22": "Ketika Nabi Hud menyeru kaumnya untuk beriman, kaum 'Ad menjawab seruan itu dengan mengatakan, \"Apakah kamu diutus kepada kami untuk memalingkan kami dari agama nenek moyang kami sehingga kami tidak lagi menyembah tuhan-tuhan kami dan hanya menyembah Tuhanmu?\" Mereka meminta kepada Hud membuktikan kerasulannya dengan segera mendatangkan azab yang pernah dijanjikan kepada mereka, seandainya mereka tidak beriman. Bahkan pada ayat yang lain, mereka menuduh Hud sebagai orang gila. Allah berfirman:\n\nKami hanya mengatakan bahwa sebagian sesembahan kami telah menimpakan penyakit gila atas dirimu. (Hud/11: 54)",
          "23": "Pada ayat ini dijelaskan jawaban Nabi Hud atas tantangan orang kafir supaya segera didatangkan azab yang pernah dijanjikan kepada mereka jika mereka tidak beriman. Nabi Hud menjawab bahwa yang mengetahui kapan azab yang diancamkan itu datang hanyalah Allah. Nabi Hud sendiri juga tidak tahu kapan azab itu akan datang. Tugas nabi hanya menyampaikan risalah dari Allah.\n\nSeharusnya kaum 'Ad bersyukur dengan diutusnya salah seorang dari kaum mereka menjadi nabi yang memberi peringatan, informasi tentang hukum, pokok-pokok akidah, dan cara-cara beribadah yang benar. Semua itu disampaikan karena perintah Allah, Tuhan Maha Pencipta segala sesuatu.\n\nTanpa adanya petunjuk dari Allah tak ada yang mengetahui hakikat agama yang benar. Manusia tidak tahu manakah Tuhan yang benar-benar berhak disembah dan siapa yang berhak menentukan bagaimana cara beribadah yang benar. Oleh karena itu, wajar jika ada manusia yang tidak memahami semua hal, karena pikiran manusia memang terbatas. Di sinilah perlunya Allah mengutus para nabi dan rasul, dan manusia harus berusaha untuk memahami dan meyakininya.",
          "24": "Segala macam usaha telah dilakukan Nabi Hud untuk mengajak kaumnya menganut agama yang benar. Bahkan dalam ayat-ayat yang lain diterangkan bahwa Nabi Hud menantang kaumnya agar mereka semua dan dewa-dewa mereka itu bersama-sama melawan dan membunuh dirinya. Namun tantangan itu tidak mereka hiraukan, sehingga Allah memutuskan untuk menimpakan azab kepada mereka.\n\nAzab itu dimulai dengan datangnya musim kemarau panjang yang menimpa negeri mereka. Dalam keadaan demikian, mereka melihat awan hitam berarakan di atas langit dan bergerak menuju negeri mereka. Mereka semua bergembira menyambut kedatangan awan itu. Menurut mereka, awan itu adalah tanda akan hujan dalam waktu dekat, yang selama ini sangat mereka harapkan. Mereka mengatakan, \"Ini adalah awan yang membawa hujan.\" Lalu Nabi Hud menatap awan itu dan memperhatikannya dengan seksama, kemudian beliau berkata, \"Awan yang datang bergumpal-gumpal itu bukanlah sebagai tanda akan datangnya hujan sebagaimana yang kamu sangka, tetapi awan itu sebagai tanda datangnya azab yang kamu inginkan dan kamu tunggu-tunggu. Azab yang akan datang untuk menghancurkan kamu berupa angin kencang yang akan membinasakan kamu dan semua yang dilandanya. Dia akan membinasakan kamu dan semua hartamu dan akan menghancurkan seluruh kekuatan dewa-dewa yang selalu kamu bangga-banggakan, sesuai dengan tugas yang diperintahkan Tuhan kepadanya.\"\n\nDalam ayat yang lain diterangkan bentuk azab yang ditimpakan kepada kaum 'Ad itu. Allah berfirman:\n\nSedangkan kaum 'Ad, mereka telah dibinasakan dengan angin topan yang sangat dingin, Allah menimpakan angin itu kepada mereka selama tujuh malam delapan hari terus-menerus; maka kamu melihat kaum 'Ad pada waktu itu mati bergelimpangan seperti batang-batang pohon kurma yang telah kosong (lapuk). Maka adakah kamu melihat seorang pun yang masih tersisa di antara mereka. (al-haqqah/69: 6-8).\n\nDan firman Allah:\n\nDan (juga) pada (kisah kaum) 'Ad, ketika Kami kirimkan kepada mereka angin yang membinasakan. (Angin itu) tidak membiarkan suatu apa pun yang dilandanya, bahkan dijadikannya seperti serbuk. (adh-dzariyat/51: 41-42)\n\nBagaimana kedahsyatan azab yang telah ditimpakan kepada kaum 'Ad itu tergambar pada sikap Rasulullah saw sewaktu angin kencang bertiup. Di dalam suatu hadis diterangkan sebagai berikut: \n\n'Aisyah berkata, \"Rasulullah saw apabila ada angin kencang bertiup, beliau berdoa, 'Wahai Tuhan, aku mohon kepada Engkau angin yang paling baik; baik isinya dan paling baik pula yang dibawanya, dan aku berlindung kepada Engkau dari angin yang buruk; buruk isinya dan buruk pula yang dibawanya. Apabila langit memperlihatkan gejala-gejala akan turunnya hujan berubahlah muka Rasulullah saw. Beliau mondar-mandir keluar masuk rumah, ke muka dan ke belakang. Maka apabila hujan telah turun legalah hati beliau, lalu aku bertanya kepada beliau, beliau menjawab, 'Aku tidak mengetahui, mudah-mudahan saja seperti yang dikatakan kaum 'Ad, 'Awan yang datang ini menurunkan hujan kepada kita.\" (Riwayat Muslim, at-Tirmidhi, dan an-Nasa'i) \n\nRasulullah juga bersabda sebagai berikut:\n\n'Aisyah berkata, \"Aku tidak pernah melihat Rasulullah saw tertawa lebar hingga kelihatan anak lidahnya. Beliau hanya tersenyum, sedang apabila beliau melihat awan dan angin, berubah raut mukanya. Aku bertanya kepada beliau, 'Ya Rasulullah aku lihat orang apabila melihat awan mereka bergembira karena mengharapkan semoga awan itu membuat hujan, sedangkan engkau aku lihat bila melihat awan kelihatan perasaan kurang senang di mukamu. Rasulullah saw menjawab, 'Ya 'Aisyah, siapa yang dapat menjamin bahwa awan itu tidak membawa azab? Pernah suatu kaum diazab dengan angin itu. Sesungguhnya kaum itu melihat azab, tetapi mereka menyangkanya awan yang membawa hujan, maka berkatalah mereka, 'Awan itu datang membawa hujan kepada kita.\" (Riwayat al-Bukhari dan Muslim) \n\nPada hadis lain yang diriwayatkan Muslim diterangkan:\n\nIbnu 'Abbas menerangkan bahwa Nabi saw pernah bersabda, \"Saya ditolong oleh angin timur, dan kaum 'Ad dihancurkan dengan angin barat.\" (Riwayat Muslim)",
          "25": "Dalam ayat ini, Allah memperingatkan orang-orang musyrik Mekah bahwa Dia telah menimpakan azab yang amat dahsyat kepada kaum 'Ad. Demikian dahsyatnya azab itu sehingga apa saja yang dilanda oleh azab berupa angin amat dingin yang bertiup dengan keras itu, pasti hancur. Mereka mati bergelimpangan. Rumah-rumah dan bangunan-bangunan runtuh, barang-barang beterbangan, pohon-pohon kayu tumbang. Tidak ada yang kelihatan lagi, kecuali puing-puing dan tempat tinggal mereka yang telah berserakan. Azab yang seperti itu juga telah menimpa kaum-kaum yang lain, seperti kaum Samud, kaum Lut, dan kaum Syuaib. Semua mereka itu adalah orang-orang yang ingkar dan durhaka kepada Allah. Seandainya kaum Quraisy tetap ingkar, mereka akan ditimpa azab seperti itu pula.",
          "26": "Dengan ayat ini, Allah membandingkan antara keadaan kaum 'Ad yang dihancurkan dengan orang-orang musyrik Mekah yang semakin bertambah keingkarannya kepada Nabi saw dengan mengatakan, \"Kami telah meneguhkan kedudukan kaum 'Ad pada beberapa segi kehidupan duniawi. Belum pernah Kami meneguhkan satu kaum seperti Kami meneguhkan mereka. Kami telah memberikan kepada mereka harta yang banyak, tubuh yang kuat dan perkasa, dan kemampuan untuk membentuk suatu negara sehingga mereka dapat menguasai negeri-negeri di sekitarnya, tetapi semuanya itu tidak dapat menghindarkan mereka dari azab Allah yang ditimpakan kepada mereka.\" Allah berfirman:\n\nMaka apakah mereka tidak mengadakan perjalanan di bumi, lalu mereka memperhatikan bagaimana kesudahan orang-orang yang sebelum mereka. Mereka itu lebih banyak dan lebih hebat kekuatannya serta (lebih banyak) peninggalan-peninggalan peradabannya di bumi, maka apa yang mereka usahakan itu tidak dapat menolong mereka. (Gafir/40: 82)\n\nSelanjutnya ayat 26 ini menjelaskan bahwa Allah telah memberikan banyak kenikmatan kepada kaum 'Ad. Allah telah memberikan tempat yang baik kepada mereka, menganugerahkan penglihatan yang baik, dan pendengaran yang tajam agar mereka dapat memperhatikan ayat-ayat dan tanda-tanda kebesaran Allah. Akan tetapi, mereka tidak mempergunakannya, bahkan semuanya itu tidak mereka manfaatkan dengan baik dan benar.\n\nSejarah telah membuktikan bahwa kaum 'Ad pernah mempunyai kebudayaan yang tinggi. Mereka telah sanggup menyusun pemerintahan dan membangun negara. Mereka telah membangun istana, benteng, menggali barang tambang dari perut bumi, dan membuat kanal untuk menciptakan irigasi yang teratur. Dengan adanya irigasi yang teratur itu, tanah negeri mereka menjadi subur. Mereka dapat pula mengolah tanah dengan baik sehingga mereka hidup makmur. Di samping itu, mereka juga mampu membentuk tentara yang kuat sehingga negara mereka menjadi negara yang terkemuka di Jazirah Arab pada masa itu. Firman Allah: \n\nApakah kamu mendirikan istana-istana pada setiap tanah yang tinggi untuk kemegahan tanpa ditempati, dan kamu membuat benteng-benteng dengan harapan kamu hidup kekal? (asy-Syu'ara'/26: 128-129)\n\nSeharusnya kenikmatan dan kebesaran yang telah dianugerahkan Allah menjadi bahan pemikiran bagi mereka tentang siapa yang telah menolongnya mencapai semua yang mereka cita-citakan. Tetapi semuanya itu menambah kesombongan dan ketakaburan mereka. Mereka mengira bahwa keadaan yang demikian itu mereka peroleh semata-mata atas kesanggupan dan kemauan mereka, dan keadaan itu akan mereka punyai selama-lamanya. Allah berfirman:\n\nMaka adapun kaum 'Ad, mereka menyombongkan diri di bumi tanpa (mengindahkan) kebenaran dan mereka berkata, \"Siapakah yang lebih hebat kekuatannya dari kami?\" Tidakkah mereka memperhatikan bahwa sesungguhnya Allah yang menciptakan mereka. Dia lebih hebat kekuatan-Nya daripada mereka? Dan mereka telah mengingkari tanda-tanda (kebesaran) Kami. (Fussilat/41: 15)\n\nSelanjutnya Allah menerangkan bahwa kaum 'Ad tidak dapat mengambil manfaat dari semua yang telah dianugerahkan kepada mereka, karena mereka mendustakan seruan rasul yang diutus kepada mereka serta mengingkari mukjizat-mukjizat rasul. Akibatnya, mereka ditimpa azab yang selalu mereka minta untuk disegerakan, karena menurut mereka azab itu mustahil akan terjadi.",
          "27": "Allah mengingatkan kaum musyrik Mekah agar mereka mengambil pelajaran dari pengalaman pahit yang telah dialami oleh orang-orang dahulu, yang telah mendustakan rasul yang diutus kepada mereka. Orang-orang dahulu itu bertempat tinggal tidak jauh dari Mekah seperti kaum 'Ad di Ahqaf, dan kaum Samud yang berdiam di daerah antara Mekah dan Syam. Kepada mereka telah diterangkan pula tanda-tanda keesaan, kekuasaan, dan kebesaran Allah dan telah disampaikan pula agama-Nya. Akan tetapi, mereka tidak mengacuhkannya, bahkan mengingkari dan memperolok-olokkan para rasul. Pada waktu azab menimpa mereka, tidak ada satu pun dari sembahan-sembahan itu yang dapat menolong mereka, bahkan sembahan-sembahan berupa patung yang tak bernyawa itu ikut hancur-lebur bersama mereka.\n\nItulah kebohongan dan pengingkaran umat-umat dahulu dan itu pula balasan dan azab yang mereka terima. Dari ayat ini, terkandung suatu ancaman Allah kepada orang-orang musyrik Mekah bahwa mereka pasti ditimpa azab, seperti yang dialami kaum 'Ad, Samud, dan umat yang lain apabila mereka tetap tidak mengindahkan seruan Muhammad saw sebagai rasul Allah yang diutus kepada mereka.",
          "28": "Allah mengingatkan kaum musyrik Mekah agar mereka mengambil pelajaran dari pengalaman pahit yang telah dialami oleh orang-orang dahulu, yang telah mendustakan rasul yang diutus kepada mereka. Orang-orang dahulu itu bertempat tinggal tidak jauh dari Mekah seperti kaum 'Ad di Ahqaf, dan kaum Samud yang berdiam di daerah antara Mekah dan Syam. Kepada mereka telah diterangkan pula tanda-tanda keesaan, kekuasaan, dan kebesaran Allah dan telah disampaikan pula agama-Nya. Akan tetapi, mereka tidak mengacuhkannya, bahkan mengingkari dan memperolok-olokkan para rasul. Pada waktu azab menimpa mereka, tidak ada satu pun dari sembahan-sembahan itu yang dapat menolong mereka, bahkan sembahan-sembahan berupa patung yang tak bernyawa itu ikut hancur-lebur bersama mereka.\n\nItulah kebohongan dan pengingkaran umat-umat dahulu dan itu pula balasan dan azab yang mereka terima. Dari ayat ini, terkandung suatu ancaman Allah kepada orang-orang musyrik Mekah bahwa mereka pasti ditimpa azab, seperti yang dialami kaum 'Ad, Samud, dan umat yang lain apabila mereka tetap tidak mengindahkan seruan Muhammad saw sebagai rasul Allah yang diutus kepada mereka.",
          "29": "Dalam ayat ini, Allah memerintahkan kepada Rasulullah saw agar menyampaikan kepada orang-orang musyrik Mekah peristiwa tentang pertemuannya dengan sekelompok jin yang telah datang kepadanya untuk mendengarkan dan memperhatikan pembacaan ayat-ayat Al-Qur'an. Pada waktu mereka mendengarkan bacaannya, di antara mereka ada yang berkata kepada yang lain, \"Dengarlah baik-baik bacaan Al-Qur'an ini agar dengan demikian kita dapat memusatkan perhatian kepada bacaan yang belum pernah kita dengar selama ini dan untuk menunjukkan sikap dan budi pekerti yang baik pada waktu mendengarkan pembacaan ayat Al-Qur'an yang mulia ini.\" Setelah mereka selesai mendengarkan bacaan Al-Qur'an itu, mereka kembali kepada kaumnya untuk menyampaikan apa yang telah mereka dengarkan itu.\n\nDalam ayat ini diterangkan bahwa jin telah mendengarkan pembacaan ayat-ayat Al-Qur'an dari Nabi saw. Bagaimana cara jin mendengarkan pembacaan itu dan bagaimana Nabi saw memperdengarkannya tidak ada keterangan yang menerangkannya dengan jelas. Demikian pula, tidak ada bukti-bukti nyata yang dapat dikemukakan dengan pasti adanya alam jin itu sendiri. \n\nAdanya alam jin itu hanya didapat dari ayat-ayat Al-Qur'an dan hadis Nabi saw. Maka kita sebagai umat Islam wajib mempercayai adanya jin itu, sebagaimana kita wajib mempercayai adanya malaikat, karena kepercayaan kepada adanya jin dan malaikat termasuk dalam keimanan kepada seluruh isi Al-Qur'an yang merupakan sumber pokok agama Islam.\n\nMalaikat dan jin termasuk makhluk gaib, karena itu hanya Allah saja yang mengetahui dengan pasti tentang hakikat dan kejadiannya. Seorang Muslim wajib percaya bahwa Nabi Muhammad pernah berhubungan dengan malaikat, seperti ketika menerima wahyu dan sebagainya. Demikian pula seorang Muslim wajib percaya pula bahwa pada suatu waktu, ketika Rasulullah saw masih hidup, beliau pernah berhubungan dengan jin, yaitu ketika membacakan ayat-ayat Al-Qur'an kepada mereka, dan waktu mereka mendengarkan dengan sungguh-sungguh, kemudian menyampaikan kepada kaumnya.\n\nMengenai hadis-hadis Rasulullah yang menerangkan pertemuan beliau dengan serombongan jin antara lain hadis di bawah ini:\n\nMasruq berkata, \"Aku bertanya kepada Ibnu Mas'ud tentang siapa yang memberitahukan kepada Nabi Muhammad saw akan kehadiran jin pada malam mereka mendengarkan bacaan Al-Qur'an,\" beliau menjawab, \"Yang memberitahukan kehadiran mereka ialah pohon kayu itu.\" (Riwayat al-Bukhari dan Muslim)\n\nPada hadis yang lain disebutkan sebagai berikut:\n\n'Alqamah berkata, \"Aku bertanya kepada Ibnu Mas'ud, adakah salah seorang di antara kamu yang menyertai Rasulullah saw pada malam pertemuannya dengan jin?\" Ibnu Mas'ud menjawab, \"Tidak seorang pun di antara kami yang menyertainya.\" (Riwayat Ahmad, Muslim, dan at-Tirmidhi)\n\nAyat ini diturunkan ketika Rasulullah saw dan para sahabat sedang menghadapi tantangan yang sangat berat dari kaum musyrik Mekah. Setelah istri yang beliau cintai, Khadijah wafat, kemudian disusul dengan wafatnya paman beliau, Abu thalib, beliau merasa kehilangan orang-orang yang selama ini melindungi dan menolong beliau dari gangguan orang-orang Quraisy. Sementara itu, ancaman dan gangguan orang Quraisy semakin bertambah. Menghadapi keadaan semacam ini beliau pergi ke kota thaif dengan harapan akan mendapat perlindungan dan pertolongan dari Bani saqif. Tetapi beliau tidak memperoleh apa yang diharapkannya, bahkan Bani saqif sendiri bertindak kasar dengan menyuruh budak-budak mereka mengusir dan melempari Rasulullah saw sehingga kaki beliau luka dan berdarah. Mereka memaksa Rasulullah saw melarikan diri ke kebun 'Utbah dan Syaibah. Di sana beliau berlindung dari teriknya matahari. Setelah beliau berdoa meminta pertolongan dari Allah, barulah budak-budak itu pergi. Kemudian Rasulullah kembali ke Mekah. Dalam perjalanan itu, beliau singgah di Nakhlah, suatu tempat di pinggir kota Mekah. Beliau bermalam di sana. Maka pada malam ketika beliau sedang salat dan membaca Al-Qur'an dalam salat itu, Allah mengerahkan tujuh pemuka jin untuk mendengarkan Nabi saw membaca Al-Qur'an. Beliau tidak mengetahui akan kedatangan jin dan beliau juga tidak mengetahui saat jin itu kembali ke tempatnya. Dengan turunnya ayat ini barulah Rasulullah saw mengetahui kedatangan jin itu.\n\nAyat ini diturunkan untuk menenteramkan hati Nabi dan para sahabatnya. Tidak lama setelah itu, terjadilah peristiwa Isra' dan Mi'raj. Kedua peristiwa itu menambah kuat hati Nabi dan keyakinannya akan keberhasilannya menyampaikan risalah yang ditugaskan Allah kepadanya.\n\nAyat ini juga menerangkan bahwa jin memperhatikan ayat-ayat Al-Qur'an yang dibaca Rasulullah, kemudian menyampaikan isi Al-Qur'an itu kepada kaumnya. Dari peristiwa ini, dapat diambil kesimpulan bahwa seruan Rasulullah saw itu tidak saja tertuju kepada seluruh manusia, tetapi juga ditujukan kepada jin, makhluk gaib yang tidak dapat diketahui hakikat dan keadaannya oleh manusia. Hanya saja kita manusia tidak mengetahui kapan dan bagaimana caranya jin itu melaksanakan perintah dan menjauhi larangan Allah.\n\nSebagian ahli tafsir mengambil kesimpulan berdasarkan ayat ini bahwa seandainya ada makhluk hidup yang berada di luar planet bumi ini, yang keadaannya seperti manusia, yaitu dapat berpikir, berbuat, dan berperasaan, maka risalah Muhammad saw berlaku pula bagi mereka, dan kaum Muslimin wajib menyampaikannya kepada mereka sedapat mungkin. Jin sebagai makhluk gaib wajib melaksanakan risalah Muhammad saw dan tentulah makhluk lain yang tidak gaib dan sama dengan manusia lebih wajib lagi melaksanakan risalah Muhammad saw.",
          "30": "Dalam ayat ini diterangkan bahwa serombongan jin yang telah mendengar bacaan Al-Qur'an dari Nabi Muhammad saw menyeru kaumnya, \"Wahai kaumku, sesungguhnya kami telah mendengar pembacaan ayat-ayat sebuah kitab yang telah diturunkan Allah setelah Kitab Taurat yang diturunkan kepada Nabi Musa. Kitab itu membenarkan kitab-kitab yang diturunkan Allah sebelumnya, menunjukkan jalan yang paling baik ditempuh seseorang yang ingin mencapai kebahagiaan hidup di dunia dan kebahagiaan hidup di akhirat serta menerangkan jalan yang diridai dan jalan yang tidak diridai Allah.\" Jin juga makhluk yang harus memikul kewajiban beribadah. Firman Allah:\n\n. \n\nAku tidak menciptakan jin dan manusia melainkan agar mereka beribadah kepada-Ku. (adh-dzariyat/51: 56)",
          "31": "Selanjutnya jin-jin itu menyeru kaumnya, \"Wahai kaumku, perkenankanlah dan terimalah seruan Muhammad saw sebagai rasul Allah yang telah menyeru manusia untuk mengikuti agama Allah, beriman kepada-Nya agar Allah mengampuni dosa-dosa mereka dan melindungi mereka dari azab yang tidak seorang pun dapat melepaskan diri dari azab itu, kecuali dengan seizin-Nya.\" Ayat ini memberi pengertian bahwa:\n\n1. Meskipun ada jin yang beriman dan ada pula yang kafir, namun dalam ayat ini mereka diseru agar beriman kepada Allah.\n\n2. Jin berkewajiban beribadah kepada Allah. Oleh karena itu, jin menerima syariat sebagaimana syariat yang disampaikan oleh para nabi dan rasul kepada manusia.\n\n3. Jin yang beriman akan selamat dari api neraka.",
          "32": "Kemudian diterangkan dalam ayat ini bahwa jika ada di antara jin yang menolak seruan Muhammad sebagai rasul Allah, yaitu tidak melaksanakan perintah Allah dan menjauhkan diri dari larangan-Nya yang tersebut dalam Al-Qur'an dan hadis, maka ia tidak dapat menghindarkan diri dari azab-Nya. Ia tidak mendapat seorang penolong pun untuk melepaskan dirinya dari azab Allah, kecuali jika Allah sendiri menghendakinya.\n\nDari ayat ini dapat dipahami bahwa seluruh ibadah yang diwajibkan kepada kaum Muslimin diwajibkan pula kepada seluruh jin untuk mengerjakannya, seperti salat, puasa, tolong-menolong, dan sebagainya. Diterangkan pula bahwa jin-jin yang tidak mengikuti seruan Muhammad saw berada dalam kesesatan dan menyimpang dari jalan yang benar.",
          "33": "Ayat ini merupakan teguran keras kepada orang-orang kafir yang mengingkari hari kebangkitan, dan adanya hidup setelah mati untuk menghisab perbuatan yang telah dilakukan manusia. Allah mencela orang-orang kafir yang lalai dan tidak pernah merenungkan kejadian alam semesta ini sehingga tidak mengetahui bahwa Allah yang telah menciptakan langit dan bumi tidak pernah merasa letih dalam penciptaan itu. Allah juga berkuasa menghidupkan yang telah mati.\n\nDari ayat ini dipahami bahwa orang kafir tidak pernah menggunakan pikirannya untuk merenungkan kejadian alam semesta dalam arti yang sebenarnya. Mereka tidak mau memikirkan siapa pencipta alam yang amat teratur dan dilengkapi dengan hukum-hukum yang sangat rapi dan kokoh. Mereka juga tidak mau memikirkan siapa yang menciptakan dirinya sendiri dan menjaga kelangsungan hidupnya. Seandainya mereka mau memikirkan dengan tujuan ingin mencari kebenaran, mereka akan sampai kepada kesimpulan bahwa pencipta semua itu adalah Allah yang Maha Bijaksana lagi Mahakuasa. Jika Dia Mahakuasa, tentulah Dia sanggup melaksanakan segala sesuatu yang dikehendaki-Nya, tanpa mengenal lelah. Zat yang bersifat demikian tentu mudah bagi-Nya menghidupkan kembali orang-orang yang telah dimatikan-Nya, karena menciptakan langit dan bumi itu jauh lebih sukar daripada menciptakan manusia serta mematikan dan menghidupkan kembali.\n\nAllah berfirman:\n\nSungguh, penciptaan langit dan bumi itu lebih besar daripada penciptaan manusia, akan tetapi kebanyakan manusia tidak mengetahui. (Gafir/40: 57)\n\nSelain itu, biasanya membuat kembali sesuatu lebih mudah dari menciptakan pertama kalinya. Allah berfirman:\n\nDan Dialah yang memulai penciptaan, kemudian mengulanginya kembali, dan itu lebih mudah bagi-Nya. Dia memiliki sifat yang Mahatinggi di langit dan di bumi. Dan Dialah Yang Mahaperkasa, Mahabijaksana. (ar-Rum/30: 27)\n\nPada akhir ayat ini ditegaskan bahwa yang Maha Pencipta segala sesuatu lagi Mahaperkasa itu adalah Allah Yang Mahakuasa. Dia dapat melakukan segala yang dikehendaki-Nya, tanpa seorang pun dapat menghalangi dan menentang-Nya.",
          "34": "Dalam ayat ini, Allah menerangkan akibat yang akan diterima oleh orang-orang yang mengingkari adanya hari kebangkitan. Pada hari kebangkitan itu, mereka dan orang-orang yang tidak percaya akan adanya pahala dan siksa Allah, akan dimasukkan ke dalam api neraka yang menyala-nyala.\n\nKepada orang-orang kafir diucapkan pertanyaan yang menyakitkan hati dan penuh penghinaan, \"Hai orang-orang kafir, bukankah azab yang kamu rasakan hari ini adalah azab yang pernah diperingatkan kepada kamu dahulu, semasa kamu hidup di dunia, sedangkan kamu mendustakan dan memperolok-olokkannya.\" Mereka menjawab, \"Benar ya Tuhan kami, kami benar-benar telah merasakan akibatnya.\" Allah mengatakan kepada mereka, \"Sekarang rasakanlah olehmu apa yang kamu perolok-olokkan itu. Inilah balasan yang setimpal dengan sikap dan tindakanmu itu.\"",
          "35": "Dalam ayat ini, Allah memerintahkan kepada Nabi Muhammad agar selalu tetap tabah dalam menghadapi sikap dan tindakan orang-orang kafir yang mengingkari dan mendustakan risalah yang disampaikan kepada mereka seperti ketabahan dan kesabaran yang telah dilakukan rasul-rasul ulul 'azmi terdahulu. Rasulullah saw melaksanakan dengan baik perintah Allah ini. Beliau selalu bersabar dan tabah menghadapi segala macam cobaan yang datang kepada beliau. Mengenai kesabaran beliau ini diterangkan dalam hadis sebagai berikut:\n\nDari 'Aisyah, ia berkata, \"Rasulullah saw senantiasa berpuasa, lalu perutnya jadi kempis, kemudian ia tetap berpuasa, lalu perutnya jadi kempis, kemudian ia berpuasa. Beliau berkata, 'Ya Aisyah, sesungguhnya kesenangan di dunia tidak patut bagi Muhammad dan keluarganya. Ya Aisyah, sesungguhnya Allah tidak menyukai para rasul ulul 'azmi (Nuh, Ibrahim, Musa, Isa, dan Muhammad), kecuali bersabar atas segala cobaannya dan bersabar atas yang dicintainya, kemudian Allah tidak menyukai aku, kecuali Dia membebankan kepadaku seperti yang telah dibebankannya kepada para rasul itu. Maka Dia berkata, 'Bersabarlah seperti para rasul 'ulul 'azmi telah bersabar. Dan sesungguhnya aku, demi Allah, benar-benar akan bersabar seperti para rasul itu, dan tidak ada sesuatu pun kekuatan kecuali kekuatan Allah.\" (Riwayat Ibnu Abi hatim dan ad-Dailami) \n\nSabar adalah sifat utama dan kunci menuju kesuksesan. Berbahagialah orang yang mempunyai sifat itu. Lawan dari sabar ialah tergesa-gesa. Dalam ayat ini, Allah mencela sifat tergesa-gesa, dan memperingatkan Nabi Muhammad agar jangan mempunyai sifat tersebut seperti memohon kepada Allah agar segera ditimpakan azab kepada orang-orang musyrik yang mengingkari seruan beliau karena azab itu pasti menimpa mereka, dan waktu kedatangannya hanya Allah yang mengetahui.\n\nAllah berfirman:\n\nDan biarkanlah Aku (yang bertindak) terhadap orang-orang yang mendustakan, yang memiliki segala kenikmatan hidup, dan berilah mereka penangguhan sebentar. (al-Muzzammil/73: 11)\n\nDan firman Allah:\n\nKarena itu berilah penangguhan kepada orang-orang kafir itu. Berilah mereka itu kesempatan untuk sementara waktu. (ath-thariq/86: 17)\n\nBerikutnya Allah menerangkan keadaan orang-orang kafir di akhirat ketika melihat azab yang akan menimpa mereka. Mereka merasa seakan-akan hidup di dunia ini hanya sesaat saja, di siang hari. Perasaan ini timbul karena dosa dan ketakutan yang timbul di hati mereka ketika melihat azab yang akan menimpa mereka. Keadaan mereka diterangkan Allah pada ayat yang lain ketika kepada mereka ditanyakan berapa lama mereka hidup di dunia.\n\nDia (Allah) berfirman, \"Berapa tahunkah lamanya kamu tinggal di bumi?\" Mereka menjawab, \"Kami tinggal (di bumi) sehari atau setengah hari, maka tanyakanlah kepada mereka yang menghitung.\" (al-Mu'minun/23: 112-113)\n\nDan firman Allah:\n\nPada hari ketika mereka melihat hari Kiamat itu (karena suasananya hebat), mereka merasa seakan-akan hanya (sebentar saja) tinggal (di dunia) pada waktu sore atau pagi hari. (an-Nazi'at/79: 46)\n\nDalam ayat ini terdapat perkataan \"balag\" yang dalam ayat ini berarti \"cukup\". Maksudnya ialah: Allah menyatakan bahwa ayat ini merupakan penjelasan yang cukup bagi manusia, terutama orang-orang kafir yang mau berpikir dan merenungkan kejadian alam semesta ini. Seandainya mereka tidak mau mengindahkan penjelasan ini, mereka pasti akan menanggung akibatnya. Dalam ayat yang lain Allah berfirman:\n\nDan (Al-Qur'an) ini adalah penjelasan (yang sempurna) bagi manusia, agar mereka diberi peringatan dengannya, agar mereka mengetahui bahwa Dia adalah Tuhan Yang Maha Esa dan agar orang yang berakal mengambil pelajaran. (Ibrahim/14: 52)\n\nDan firman Allah:\n\nSungguh, (apa yang disebutkan) di dalam (Al-Qur'an) ini, benar-benar menjadi petunjuk (yang lengkap) bagi orang-orang yang menyembah (Allah). (al-Anbiya'/21: 106)\n\nPada akhir ayat ini Allah menegaskan bahwa betapapun besar dan dahsyatnya azab Allah itu, tidak akan menimpa orang-orang yang beriman dan beramal saleh. Hanya orang-orang kafir yang tidak mengindahkan perintah-perintah Allah dan melanggar larangan-larangan-Nya saja yang akan ditimpa azab yang mengerikan itu. Ayat ini juga menggambarkan betapa besarnya rahmat dan karunia Allah yang dilimpahkan kepada orang-orang yang taat kepada-Nya. Sehubungan dengan rahmat dan karunia, azab dan malapetaka ini, Rasulullah saw sering berdoa kepada Allah, seperti yang tersebut dalam hadis di bawah ini:\n\n\"Diriwayatkan dari Anas, Nabi saw berdoa, \"Wahai Tuhan, sesungguhnya aku memohon kepada Engkau penyebab rahmat-Mu, kepastian ampunan-Mu, dan keberuntungan dari segala kebaikan, dan keselamatan dari setiap perbuatan dosa. Wahai Tuhan, janganlah Engkau biarkan satu dosa pun bagiku, kecuali Engkau mengampuninya, dan kesempitan kecuali Engkau melapangkannya, dan hutang kecuali Engkau membayarnya, demikian pula segala keperluan dari keperluan-keperluan duniawi dan ukhrawi, kecuali Engkau menyelesaikannya dengan rahmat Engkau, wahai Tuhan Yang Maha Pemurah. (Riwayat ath-thabrani)"
        }
      }
    }
  }
}