{
  "name": "Muhammad",
  "name_translations": {
    "ar": "محمد",
    "en": "Muhammad",
    "id": "Muhammad"
  },
  "number_of_ayah": 38,
  "number_of_surah": 47,
  "place": "Medina",
  "recitations": [{
    "name": "Mishari Rashid al-`Afasy",
    "audio_url": "https://download.quranicaudio.com/quran/mishaari_raashid_al_3afaasee/047.mp3"
  }, {
    "name": "Abdur-Rahman as-Sudais",
    "audio_url": "https://download.quranicaudio.com/quran/abdurrahmaan_as-sudays/047.mp3"
  }, {
    "name": "Saad al-Ghamdi",
    "audio_url": "https://download.quranicaudio.com/quran/sa3d_al-ghaamidi/complete/047.mp3"
  }],
  "type": "Madaniyah",
  "verses": [{
    "number": 1,
    "text": "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ ٱلَّذِينَ كَفَرُوا۟ وَصَدُّوا۟ عَن سَبِيلِ ٱللَّهِ أَضَلَّ أَعْمَٰلَهُمْ",
    "translation_en": "Those who disbelieve and avert [people] from the way of Allah - He will waste their deeds.",
    "translation_id": "Orang-orang yang kafir dan menghalangi (manusia) dari jalan Allah, Allah menyesatkan perbuatan-perbuatan mereka."
  }, {
    "number": 2,
    "text": "وَٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّٰلِحَٰتِ وَءَامَنُوا۟ بِمَا نُزِّلَ عَلَىٰ مُحَمَّدٍ وَهُوَ ٱلْحَقُّ مِن رَّبِّهِمْ كَفَّرَ عَنْهُمْ سَيِّـَٔاتِهِمْ وَأَصْلَحَ بَالَهُمْ",
    "translation_en": "And those who believe and do righteous deeds and believe in what has been sent down upon Muhammad - and it is the truth from their Lord - He will remove from them their misdeeds and amend their condition.",
    "translation_id": "Dan orang-orang mukmin dan beramal soleh serta beriman kepada apa yang diturunkan kepada Muhammad dan itulah yang haq dari Tuhan mereka, Allah menghapuskan kesalahan-kesalahan mereka dan memperbaiki keadaan mereka."
  }, {
    "number": 3,
    "text": "ذَٰلِكَ بِأَنَّ ٱلَّذِينَ كَفَرُوا۟ ٱتَّبَعُوا۟ ٱلْبَٰطِلَ وَأَنَّ ٱلَّذِينَ ءَامَنُوا۟ ٱتَّبَعُوا۟ ٱلْحَقَّ مِن رَّبِّهِمْ كَذَٰلِكَ يَضْرِبُ ٱللَّهُ لِلنَّاسِ أَمْثَٰلَهُمْ",
    "translation_en": "That is because those who disbelieve follow falsehood, and those who believe follow the truth from their Lord. Thus does Allah present to the people their comparisons.",
    "translation_id": "Yang demikian adalah karena sesungguhnya orang-orang kafir mengikuti yang bathil dan sesungguhnya orang-orang mukmin mengikuti yang haq dari Tuhan mereka. Demikianlah Allah membuat untuk manusia perbandingan-perbandingan bagi mereka."
  }, {
    "number": 4,
    "text": "فَإِذَا لَقِيتُمُ ٱلَّذِينَ كَفَرُوا۟ فَضَرْبَ ٱلرِّقَابِ حَتَّىٰٓ إِذَآ أَثْخَنتُمُوهُمْ فَشُدُّوا۟ ٱلْوَثَاقَ فَإِمَّا مَنًّۢا بَعْدُ وَإِمَّا فِدَآءً حَتَّىٰ تَضَعَ ٱلْحَرْبُ أَوْزَارَهَا ذَٰلِكَ وَلَوْ يَشَآءُ ٱللَّهُ لَٱنتَصَرَ مِنْهُمْ وَلَٰكِن لِّيَبْلُوَا۟ بَعْضَكُم بِبَعْضٍ وَٱلَّذِينَ قُتِلُوا۟ فِى سَبِيلِ ٱللَّهِ فَلَن يُضِلَّ أَعْمَٰلَهُمْ",
    "translation_en": "So when you meet those who disbelieve [in battle], strike [their] necks until, when you have inflicted slaughter upon them, then secure their bonds, and either [confer] favor afterwards or ransom [them] until the war lays down its burdens. That [is the command]. And if Allah had willed, He could have taken vengeance upon them [Himself], but [He ordered armed struggle] to test some of you by means of others. And those who are killed in the cause of Allah - never will He waste their deeds.",
    "translation_id": "Apabila kamu bertemu dengan orang-orang kafir (di medan perang) maka pancunglah batang leher mereka. Sehingga apabila kamu telah mengalahkan mereka maka tawanlah mereka dan sesudah itu kamu boleh membebaskan mereka atau menerima tebusan sampai perang berakhir. Demikianlah apabila Allah menghendaki niscaya Allah akan membinasakan mereka tetapi Allah hendak menguji sebahagian kamu dengan sebahagian yang lain. Dan orang-orang yang syahid pada jalan Allah, Allah tidak akan menyia-nyiakan amal mereka."
  }, {
    "number": 5,
    "text": "سَيَهْدِيهِمْ وَيُصْلِحُ بَالَهُمْ",
    "translation_en": "He will guide them and amend their condition",
    "translation_id": "Allah akan memberi pimpinan kepada mereka dan memperbaiki keadaan mereka,"
  }, {
    "number": 6,
    "text": "وَيُدْخِلُهُمُ ٱلْجَنَّةَ عَرَّفَهَا لَهُمْ",
    "translation_en": "And admit them to Paradise, which He has made known to them.",
    "translation_id": "dan memasukkan mereka ke dalam jannah yang telah diperkenankan-Nya kepada mereka."
  }, {
    "number": 7,
    "text": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓا۟ إِن تَنصُرُوا۟ ٱللَّهَ يَنصُرْكُمْ وَيُثَبِّتْ أَقْدَامَكُمْ",
    "translation_en": "O you who have believed, if you support Allah, He will support you and plant firmly your feet.",
    "translation_id": "Hai orang-orang mukmin, jika kamu menolong (agama) Allah, niscaya Dia akan menolongmu dan meneguhkan kedudukanmu."
  }, {
    "number": 8,
    "text": "وَٱلَّذِينَ كَفَرُوا۟ فَتَعْسًا لَّهُمْ وَأَضَلَّ أَعْمَٰلَهُمْ",
    "translation_en": "But those who disbelieve - for them is misery, and He will waste their deeds.",
    "translation_id": "Dan orang-orang yang kafir, maka kecelakaanlah bagi mereka dan Allah menyesatkan amal-amal mereka."
  }, {
    "number": 9,
    "text": "ذَٰلِكَ بِأَنَّهُمْ كَرِهُوا۟ مَآ أَنزَلَ ٱللَّهُ فَأَحْبَطَ أَعْمَٰلَهُمْ",
    "translation_en": "That is because they disliked what Allah revealed, so He rendered worthless their deeds.",
    "translation_id": "Yang demikian itu adalah karena Sesungguhnya mereka benci kepada apa yang diturunkan Allah (Al Quran) lalu Allah menghapuskan (pahala-pahala) amal-amal mereka."
  }, {
    "number": 10,
    "text": "أَفَلَمْ يَسِيرُوا۟ فِى ٱلْأَرْضِ فَيَنظُرُوا۟ كَيْفَ كَانَ عَٰقِبَةُ ٱلَّذِينَ مِن قَبْلِهِمْ دَمَّرَ ٱللَّهُ عَلَيْهِمْ وَلِلْكَٰفِرِينَ أَمْثَٰلُهَا",
    "translation_en": "Have they not traveled through the land and seen how was the end of those before them? Allah destroyed [everything] over them, and for the disbelievers is something comparable.",
    "translation_id": "Maka apakah mereka tidak mengadakan perjalanan di muka bumi sehingga mereka dapat memperhatikan bagaimana kesudahan orang-orang sebelum mereka; Allah telah menimpakan kebinasaan atas mereka dan orang-orang kafir akan menerima (akibat-akibat) seperti itu."
  }, {
    "number": 11,
    "text": "ذَٰلِكَ بِأَنَّ ٱللَّهَ مَوْلَى ٱلَّذِينَ ءَامَنُوا۟ وَأَنَّ ٱلْكَٰفِرِينَ لَا مَوْلَىٰ لَهُمْ",
    "translation_en": "That is because Allah is the protector of those who have believed and because the disbelievers have no protector.",
    "translation_id": "Yang demikian itu karena sesungguhnya Allah adalah pelindung orang-orang yang beriman dan karena sesungguhnya orang-orang kafir itu tidak mempunyai pelindung."
  }, {
    "number": 12,
    "text": "إِنَّ ٱللَّهَ يُدْخِلُ ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّٰلِحَٰتِ جَنَّٰتٍ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَٰرُ وَٱلَّذِينَ كَفَرُوا۟ يَتَمَتَّعُونَ وَيَأْكُلُونَ كَمَا تَأْكُلُ ٱلْأَنْعَٰمُ وَٱلنَّارُ مَثْوًى لَّهُمْ",
    "translation_en": "Indeed, Allah will admit those who have believed and done righteous deeds to gardens beneath which rivers flow, but those who disbelieve enjoy themselves and eat as grazing livestock eat, and the Fire will be a residence for them.",
    "translation_id": "Sesungguhnya Allah memasukkan orang-orang mukmin dan beramal saleh ke dalam jannah yang mengalir di bawahnya sungai-sungai. Dan orang-orang kafir bersenang-senang (di dunia) dan mereka makan seperti makannya binatang. Dan jahannam adalah tempat tinggal mereka."
  }, {
    "number": 13,
    "text": "وَكَأَيِّن مِّن قَرْيَةٍ هِىَ أَشَدُّ قُوَّةً مِّن قَرْيَتِكَ ٱلَّتِىٓ أَخْرَجَتْكَ أَهْلَكْنَٰهُمْ فَلَا نَاصِرَ لَهُمْ",
    "translation_en": "And how many a city was stronger than your city [Makkah] which drove you out? We destroyed them; and there was no helper for them.",
    "translation_id": "Dan betapa banyaknya negeri yang (penduduknya) lebih kuat dari pada (penduduk) negerimu (Muhammad) yang telah mengusirmu itu. Kami telah membinasakan mereka, maka tidak ada seorang penolongpun bagi mereka."
  }, {
    "number": 14,
    "text": "أَفَمَن كَانَ عَلَىٰ بَيِّنَةٍ مِّن رَّبِّهِۦ كَمَن زُيِّنَ لَهُۥ سُوٓءُ عَمَلِهِۦ وَٱتَّبَعُوٓا۟ أَهْوَآءَهُم",
    "translation_en": "So is he who is on clear evidence from his Lord like him to whom the evil of his work has been made attractive and they follow their [own] desires?",
    "translation_id": "Maka apakah orang yang berpegang pada keterangan yang datang dari Rabbnya sama dengan orang yang (shaitan) menjadikan dia memandang baik perbuatannya yang buruk itu dan mengikuti hawa nafsunya?"
  }, {
    "number": 15,
    "text": "مَّثَلُ ٱلْجَنَّةِ ٱلَّتِى وُعِدَ ٱلْمُتَّقُونَ فِيهَآ أَنْهَٰرٌ مِّن مَّآءٍ غَيْرِ ءَاسِنٍ وَأَنْهَٰرٌ مِّن لَّبَنٍ لَّمْ يَتَغَيَّرْ طَعْمُهُۥ وَأَنْهَٰرٌ مِّنْ خَمْرٍ لَّذَّةٍ لِّلشَّٰرِبِينَ وَأَنْهَٰرٌ مِّنْ عَسَلٍ مُّصَفًّى وَلَهُمْ فِيهَا مِن كُلِّ ٱلثَّمَرَٰتِ وَمَغْفِرَةٌ مِّن رَّبِّهِمْ كَمَنْ هُوَ خَٰلِدٌ فِى ٱلنَّارِ وَسُقُوا۟ مَآءً حَمِيمًا فَقَطَّعَ أَمْعَآءَهُمْ",
    "translation_en": "Is the description of Paradise, which the righteous are promised, wherein are rivers of water unaltered, rivers of milk the taste of which never changes, rivers of wine delicious to those who drink, and rivers of purified honey, in which they will have from all [kinds of] fruits and forgiveness from their Lord, like [that of] those who abide eternally in the Fire and are given to drink scalding water that will sever their intestines?",
    "translation_id": "(Apakah) perumpamaan (penghuni) jannah yang dijanjikan kepada orang-orang yang bertakwa yang di dalamnya ada sungai-sungai dari air yang tiada berubah rasa dan baunya, sungai-sungai dari air susu yang tidak berubah rasanya, sungai-sungai dari khamar yang lezat rasanya bagi peminumnya dan sungai-sungai dari madu yang disaring; dan mereka memperoleh di dalamnya segala macam buah-buahan dan ampunan dari Rabb mereka, sama dengan orang yang kekal dalam jahannam dan diberi minuman dengan air yang mendidih sehingga memotong ususnya?"
  }, {
    "number": 16,
    "text": "وَمِنْهُم مَّن يَسْتَمِعُ إِلَيْكَ حَتَّىٰٓ إِذَا خَرَجُوا۟ مِنْ عِندِكَ قَالُوا۟ لِلَّذِينَ أُوتُوا۟ ٱلْعِلْمَ مَاذَا قَالَ ءَانِفًا أُو۟لَٰٓئِكَ ٱلَّذِينَ طَبَعَ ٱللَّهُ عَلَىٰ قُلُوبِهِمْ وَٱتَّبَعُوٓا۟ أَهْوَآءَهُمْ",
    "translation_en": "And among them, [O Muhammad], are those who listen to you, until when they depart from you, they say to those who were given knowledge, \"What has he said just now?\" Those are the ones of whom Allah has sealed over their hearts and who have followed their [own] desires.",
    "translation_id": "Dan di antara mereka ada orang yang mendengarkan perkataanmu sehingga apabila mereka keluar dari sisimu orang-orang berkata kepada orang yang telah diberi ilmu pengetahuan (sahabat-sahabat Nabi): \"Apakah yang dikatakannya tadi?\" Mereka itulah orang-orang yang dikunci mati hati mereka oleh Allah dan mengikuti hawa nafsu mereka."
  }, {
    "number": 17,
    "text": "وَٱلَّذِينَ ٱهْتَدَوْا۟ زَادَهُمْ هُدًى وَءَاتَىٰهُمْ تَقْوَىٰهُمْ",
    "translation_en": "And those who are guided - He increases them in guidance and gives them their righteousness.",
    "translation_id": "Dan orang-orang yang mau menerima petunjuk, Allah menambah petunjuk kepada mereka dan memberikan balasan ketakwaannya."
  }, {
    "number": 18,
    "text": "فَهَلْ يَنظُرُونَ إِلَّا ٱلسَّاعَةَ أَن تَأْتِيَهُم بَغْتَةً فَقَدْ جَآءَ أَشْرَاطُهَا فَأَنَّىٰ لَهُمْ إِذَا جَآءَتْهُمْ ذِكْرَىٰهُمْ",
    "translation_en": "Then do they await except that the Hour should come upon them unexpectedly? But already there have come [some of] its indications. Then what good to them, when it has come, will be their remembrance?",
    "translation_id": "Maka tidaklah yang mereka tunggu-tunggu melainkan hari kiamat (yaitu) kedatangannya kepada mereka dengan tiba-tiba, karena sesungguhnya telah datang tanda-tandanya. Maka apakah faedahnya bagi mereka kesadaran mereka itu apabila Kiamat sudah datang?"
  }, {
    "number": 19,
    "text": "فَٱعْلَمْ أَنَّهُۥ لَآ إِلَٰهَ إِلَّا ٱللَّهُ وَٱسْتَغْفِرْ لِذَنۢبِكَ وَلِلْمُؤْمِنِينَ وَٱلْمُؤْمِنَٰتِ وَٱللَّهُ يَعْلَمُ مُتَقَلَّبَكُمْ وَمَثْوَىٰكُمْ",
    "translation_en": "So know, [O Muhammad], that there is no deity except Allah and ask forgiveness for your sin and for the believing men and believing women. And Allah knows of your movement and your resting place.",
    "translation_id": "Maka ketahuilah, bahwa sesungguhnya tidak ada Ilah (sesembahan, tuhan) selain Allah dan mohonlah ampunan bagi dosamu dan bagi (dosa) orang-orang mukmin, laki-laki dan perempuan. Dan Allah mengetahui tempat kamu berusaha dan tempat kamu tinggal."
  }, {
    "number": 20,
    "text": "وَيَقُولُ ٱلَّذِينَ ءَامَنُوا۟ لَوْلَا نُزِّلَتْ سُورَةٌ فَإِذَآ أُنزِلَتْ سُورَةٌ مُّحْكَمَةٌ وَذُكِرَ فِيهَا ٱلْقِتَالُ رَأَيْتَ ٱلَّذِينَ فِى قُلُوبِهِم مَّرَضٌ يَنظُرُونَ إِلَيْكَ نَظَرَ ٱلْمَغْشِىِّ عَلَيْهِ مِنَ ٱلْمَوْتِ فَأَوْلَىٰ لَهُمْ",
    "translation_en": "Those who believe say, \"Why has a surah not been sent down? But when a precise surah is revealed and fighting is mentioned therein, you see those in whose hearts is hypocrisy looking at you with a look of one overcome by death. And more appropriate for them [would have been]",
    "translation_id": "Dan orang-orang yang beriman berkata: \"Mengapa tiada diturunkan suatu surat?\" Maka apabila diturunkan suatu surat yang jelas maksudnya dan disebutkan di dalamnya (perintah) perang, kamu lihat orang-orang yang ada penyakit di dalam hatinya memandang kepadamu seperti pandangan orang yang pingsan karena takut mati, dan kecelakaanlah bagi mereka."
  }, {
    "number": 21,
    "text": "طَاعَةٌ وَقَوْلٌ مَّعْرُوفٌ فَإِذَا عَزَمَ ٱلْأَمْرُ فَلَوْ صَدَقُوا۟ ٱللَّهَ لَكَانَ خَيْرًا لَّهُمْ",
    "translation_en": "Obedience and good words. And when the matter [of fighting] was determined, if they had been true to Allah, it would have been better for them.",
    "translation_id": "Taat dan mengucapkan perkataan yang baik (adalah lebih baik bagi mereka). Apabila telah tetap perintah perang (mereka tidak menyukainya). Tetapi jikalau mereka benar (imannya) terhadap Allah, niscaya yang demikian itu lebih baik bagi mereka."
  }, {
    "number": 22,
    "text": "فَهَلْ عَسَيْتُمْ إِن تَوَلَّيْتُمْ أَن تُفْسِدُوا۟ فِى ٱلْأَرْضِ وَتُقَطِّعُوٓا۟ أَرْحَامَكُمْ",
    "translation_en": "So would you perhaps, if you turned away, cause corruption on earth and sever your [ties of] relationship?",
    "translation_id": "Maka apakah kiranya jika kamu berkuasa kamu akan membuat kerusakan di muka bumi dan memutuskan hubungan kekeluargaan?"
  }, {
    "number": 23,
    "text": "أُو۟لَٰٓئِكَ ٱلَّذِينَ لَعَنَهُمُ ٱللَّهُ فَأَصَمَّهُمْ وَأَعْمَىٰٓ أَبْصَٰرَهُمْ",
    "translation_en": "Those [who do so] are the ones that Allah has cursed, so He deafened them and blinded their vision.",
    "translation_id": "Mereka itulah orang-orang yang dilaknati Allah dan ditulikan-Nya telinga mereka dan dibutakan-Nya penglihatan mereka."
  }, {
    "number": 24,
    "text": "أَفَلَا يَتَدَبَّرُونَ ٱلْقُرْءَانَ أَمْ عَلَىٰ قُلُوبٍ أَقْفَالُهَآ",
    "translation_en": "Then do they not reflect upon the Qur'an, or are there locks upon [their] hearts?",
    "translation_id": "Maka apakah mereka tidak memperhatikan Al Quran ataukah hati mereka terkunci?"
  }, {
    "number": 25,
    "text": "إِنَّ ٱلَّذِينَ ٱرْتَدُّوا۟ عَلَىٰٓ أَدْبَٰرِهِم مِّنۢ بَعْدِ مَا تَبَيَّنَ لَهُمُ ٱلْهُدَى ٱلشَّيْطَٰنُ سَوَّلَ لَهُمْ وَأَمْلَىٰ لَهُمْ",
    "translation_en": "Indeed, those who reverted back [to disbelief] after guidance had become clear to them - Satan enticed them and prolonged hope for them.",
    "translation_id": "Sesungguhnya orang-orang yang kembali ke belakang (kepada kekafiran) sesudah petunjuk itu jelas bagi mereka, syaitan telah menjadikan mereka mudah (berbuat dosa) dan memanjangkan angan-angan mereka."
  }, {
    "number": 26,
    "text": "ذَٰلِكَ بِأَنَّهُمْ قَالُوا۟ لِلَّذِينَ كَرِهُوا۟ مَا نَزَّلَ ٱللَّهُ سَنُطِيعُكُمْ فِى بَعْضِ ٱلْأَمْرِ وَٱللَّهُ يَعْلَمُ إِسْرَارَهُمْ",
    "translation_en": "That is because they said to those who disliked what Allah sent down, \"We will obey you in part of the matter.\" And Allah knows what they conceal.",
    "translation_id": "Yang demikian itu karena sesungguhnya mereka (orang-orang munafik) itu berkata kepada orang-orang yang benci kepada apa yang diturunkan Allah (orang-orang Yahudi): \"Kami akan mematuhi kamu dalam beberapa urusan\", sedang Allah mengetahui rahasia mereka."
  }, {
    "number": 27,
    "text": "فَكَيْفَ إِذَا تَوَفَّتْهُمُ ٱلْمَلَٰٓئِكَةُ يَضْرِبُونَ وُجُوهَهُمْ وَأَدْبَٰرَهُمْ",
    "translation_en": "Then how [will it be] when the angels take them in death, striking their faces and their backs?",
    "translation_id": "Bagaimanakah (keadaan mereka) apabila malaikat mencabut nyawa mereka seraya memukul-mukul muka mereka dan punggung mereka?"
  }, {
    "number": 28,
    "text": "ذَٰلِكَ بِأَنَّهُمُ ٱتَّبَعُوا۟ مَآ أَسْخَطَ ٱللَّهَ وَكَرِهُوا۟ رِضْوَٰنَهُۥ فَأَحْبَطَ أَعْمَٰلَهُمْ",
    "translation_en": "That is because they followed what angered Allah and disliked [what earns] His pleasure, so He rendered worthless their deeds.",
    "translation_id": "Yang demikian itu adalah karena sesungguhnya mereka mengikuti apa yang menimbulkan kemurkaan Allah dan karena mereka membenci keridhaan-Nya, sebab itu Allah menghapus (pahala) amal-amal mereka."
  }, {
    "number": 29,
    "text": "أَمْ حَسِبَ ٱلَّذِينَ فِى قُلُوبِهِم مَّرَضٌ أَن لَّن يُخْرِجَ ٱللَّهُ أَضْغَٰنَهُمْ",
    "translation_en": "Or do those in whose hearts is disease think that Allah would never expose their [feelings of] hatred?",
    "translation_id": "Atau apakah orang-orang yang ada penyakit dalam hatinya mengira bahwa Allah tidak akan menampakkan kedengkian mereka?"
  }, {
    "number": 30,
    "text": "وَلَوْ نَشَآءُ لَأَرَيْنَٰكَهُمْ فَلَعَرَفْتَهُم بِسِيمَٰهُمْ وَلَتَعْرِفَنَّهُمْ فِى لَحْنِ ٱلْقَوْلِ وَٱللَّهُ يَعْلَمُ أَعْمَٰلَكُمْ",
    "translation_en": "And if We willed, We could show them to you, and you would know them by their mark; but you will surely know them by the tone of [their] speech. And Allah knows your deeds.",
    "translation_id": "Dan kalau Kami kehendaki, niscaya Kami tunjukkan mereka kepadamu sehingga kamu benar-benar dapat mengenal mereka dengan tanda-tandanya. Dan kamu benar-benar akan mengenal mereka dari kiasan-kiasan perkataan mereka dan Allah mengetahui perbuatan-perbuatan kamu."
  }, {
    "number": 31,
    "text": "وَلَنَبْلُوَنَّكُمْ حَتَّىٰ نَعْلَمَ ٱلْمُجَٰهِدِينَ مِنكُمْ وَٱلصَّٰبِرِينَ وَنَبْلُوَا۟ أَخْبَارَكُمْ",
    "translation_en": "And We will surely test you until We make evident those who strive among you [for the cause of Allah] and the patient, and We will test your affairs.",
    "translation_id": "Dan sesungguhnya Kami benar-benar akan menguji kamu agar Kami mengetahui orang-orang yang berjihad dan bersabar di antara kamu, dan agar Kami menyatakan (baik buruknya) hal ihwalmu."
  }, {
    "number": 32,
    "text": "إِنَّ ٱلَّذِينَ كَفَرُوا۟ وَصَدُّوا۟ عَن سَبِيلِ ٱللَّهِ وَشَآقُّوا۟ ٱلرَّسُولَ مِنۢ بَعْدِ مَا تَبَيَّنَ لَهُمُ ٱلْهُدَىٰ لَن يَضُرُّوا۟ ٱللَّهَ شَيْـًٔا وَسَيُحْبِطُ أَعْمَٰلَهُمْ",
    "translation_en": "Indeed, those who disbelieved and averted [people] from the path of Allah and opposed the Messenger after guidance had become clear to them - never will they harm Allah at all, and He will render worthless their deeds.",
    "translation_id": "Sesungguhnya orang-orang kafir dan (yang) menghalangi manusia dari jalan Allah serta memusuhi Rasul setelah petunjuk itu jelas bagi mereka, mereka tidak dapat memberi mudharat kepada Allah sedikitpun. Dan Allah akan menghapuskan (pahala) amal-amal mereka."
  }, {
    "number": 33,
    "text": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓا۟ أَطِيعُوا۟ ٱللَّهَ وَأَطِيعُوا۟ ٱلرَّسُولَ وَلَا تُبْطِلُوٓا۟ أَعْمَٰلَكُمْ",
    "translation_en": "O you who have believed, obey Allah and obey the Messenger and do not invalidate your deeds.",
    "translation_id": "Hai orang-orang yang beriman, taatilah Allah dan taatilah Rasul dan janganlah kamu merusakkan (pahala) amal-amalmu."
  }, {
    "number": 34,
    "text": "إِنَّ ٱلَّذِينَ كَفَرُوا۟ وَصَدُّوا۟ عَن سَبِيلِ ٱللَّهِ ثُمَّ مَاتُوا۟ وَهُمْ كُفَّارٌ فَلَن يَغْفِرَ ٱللَّهُ لَهُمْ",
    "translation_en": "Indeed, those who disbelieved and averted [people] from the path of Allah and then died while they were disbelievers - never will Allah forgive them.",
    "translation_id": "Sesungguhnya orang-orang kafir dan (yang) menghalangi manusia dari jalan Allah kemudian mereka mati dalam keadaan kafir, maka sekali-kali Allah tidak akan memberi ampun kepada mereka."
  }, {
    "number": 35,
    "text": "فَلَا تَهِنُوا۟ وَتَدْعُوٓا۟ إِلَى ٱلسَّلْمِ وَأَنتُمُ ٱلْأَعْلَوْنَ وَٱللَّهُ مَعَكُمْ وَلَن يَتِرَكُمْ أَعْمَٰلَكُمْ",
    "translation_en": "So do not weaken and call for peace while you are superior; and Allah is with you and will never deprive you of [the reward of] your deeds.",
    "translation_id": "Janganlah kamu lemah dan minta damai padahal kamulah yang di atas dan Allah pun bersamamu dan Dia sekali-kali tidak akan mengurangi pahala amal-amalmu."
  }, {
    "number": 36,
    "text": "إِنَّمَا ٱلْحَيَوٰةُ ٱلدُّنْيَا لَعِبٌ وَلَهْوٌ وَإِن تُؤْمِنُوا۟ وَتَتَّقُوا۟ يُؤْتِكُمْ أُجُورَكُمْ وَلَا يَسْـَٔلْكُمْ أَمْوَٰلَكُمْ",
    "translation_en": "[This] worldly life is only amusement and diversion. And if you believe and fear Allah, He will give you your rewards and not ask you for your properties.",
    "translation_id": "Sesungguhnya kehidupan dunia hanyalah permainan dan senda gurau. Dan jika kamu beriman dan bertakwa, Allah akan memberikan pahala kepadamu dan Dia tidak akan meminta harta-hartamu."
  }, {
    "number": 37,
    "text": "إِن يَسْـَٔلْكُمُوهَا فَيُحْفِكُمْ تَبْخَلُوا۟ وَيُخْرِجْ أَضْغَٰنَكُمْ",
    "translation_en": "If He should ask you for them and press you, you would withhold, and He would expose your unwillingness.",
    "translation_id": "Jika Dia meminta harta kepadamu lalu mendesak kamu (supaya memberikan semuanya) niscaya kamu akan kikir dan Dia akan menampakkan kedengkianmu."
  }, {
    "number": 38,
    "text": "هَٰٓأَنتُمْ هَٰٓؤُلَآءِ تُدْعَوْنَ لِتُنفِقُوا۟ فِى سَبِيلِ ٱللَّهِ فَمِنكُم مَّن يَبْخَلُ وَمَن يَبْخَلْ فَإِنَّمَا يَبْخَلُ عَن نَّفْسِهِۦ وَٱللَّهُ ٱلْغَنِىُّ وَأَنتُمُ ٱلْفُقَرَآءُ وَإِن تَتَوَلَّوْا۟ يَسْتَبْدِلْ قَوْمًا غَيْرَكُمْ ثُمَّ لَا يَكُونُوٓا۟ أَمْثَٰلَكُم",
    "translation_en": "Here you are - those invited to spend in the cause of Allah - but among you are those who withhold [out of greed]. And whoever withholds only withholds [benefit] from himself; and Allah is the Free of need, while you are the needy. And if you turn away, He will replace you with another people; then they will not be the likes of you.",
    "translation_id": "Ingatlah, kamu ini orang-orang yang diajak untuk menafkahkan (hartamu) pada jalan Allah. Maka di antara kamu ada yang kikir, dan siapa yang kikir sesungguhnya dia hanyalah kikir terhadap dirinya sendiri. Dan Allah-lah yang Maha Kaya sedangkan kamulah orang-orang yang berkehendak (kepada-Nya); dan jika kamu berpaling niscaya Dia akan mengganti (kamu) dengan kaum yang lain; dan mereka tidak akan seperti kamu ini."
  }],
  "tafsir": {
    "id": {
      "kemenag": {
        "name": "Kemenag",
        "source": "Aplikasi Quran Kementrian Agama Republik Indonesia",
        "text": {
          "1": "Dalam ayat ini, Allah membagi manusia menjadi dua golongan: pertama, golongan kafir, yaitu orang-orang yang mengingkari kekuasaan dan keesaan Allah, menyembah tuhan-tuhan yang lain selain Dia, menghalangi manusia beribadah kepada-Nya, membuat-buat cara beribadah kepada-Nya menurut pendapat dan keinginan sendiri, mencela dan menghalangi manusia beriman kepada Allah dan kepada Nabi Muhammad. Seluruh perbuatan golongan ini tidak mengikuti petunjuk-petunjuk Allah yang termuat di dalam Al-Qur'an dan hadis Rasul-Nya, tetapi mengikuti keinginan sendiri dan mengikuti petunjuk setan. \n\nSemua perbuatan yang berdasarkan perbuatan setan tidak ada artinya di sisi Allah walaupun perbuatan itu baik bagi manusia dan kemanusiaan. Perbuatan itu seolah-olah buih yang timbul di permukaan air, kemudian hilang tanpa bekas sedikit pun. Oleh karena itu, semua amal dan perbuatan yang dikerjakan oleh orang-orang musyrik tidak ada arti dan pahalanya di sisi Allah di akhirat nanti. Mereka hanya mendapat balasan di dunia yang diperoleh dari manusia, walaupun bentuk amal dan perbuatan itu seperti budi pekerti yang mulia, berhubungan dengan orang lain (silaturrahim), memberi makan orang miskin, memelihara anak yatim, membuat usaha-usaha kemanusiaan, memelihara dan mendirikan masjid. \n\nPekerjaan seperti ini adalah pekerjaan yang pernah dikerjakan oleh orang-orang musyrik Mekah, seperti memakmurkan Masjidilharam, melindungi orang-orang yang memerlukan perlindungan, membantu orang-orang yang mengerjakan thawaf dan sebagainya.\n\nAllah berfirman:\n\nDan Kami akan perlihatkan segala amal yang mereka kerjakan, lalu Kami akan jadikan amal itu (bagaikan) debu yang beterbangan. (al-Furqan/25: 23)\n\nKedua, golongan mukmin, yaitu orang-orang yang mengakui keesaan Allah, taat hanya kepada-Nya saja, beribadah sesuai dengan petunjuk Allah, tidak menurut kemauan sendiri dan menjauhi larangan-Nya, beriman kepada Al-Qur'an yang dibawa Nabi Muhammad, dan membantu manusia melaksanakan ibadah kepada-Nya. Ini adalah golongan yang diridai Allah. Amal dan perbuatan golongan mukmin diterima Allah, diampuni segala dosanya, mereka mendapat pahala di dunia sedang di akhirat akan mendapat kebahagiaan yang abadi.\n\nMenurut Ibnu 'Abbas, ayat pertama diturunkan berhubungan dengan orang-orang yang memberi makan tentara musyrik Mekah pada waktu Perang Badar. Mereka ada dua belas orang, yaitu Abu Jahal, al-harits bin Hisyam, 'Utbah bin Rabi'ah, Syaibah bin Rabi'ah, Ubay bin Khalaf, Umayyah bin Khalaf, Munabbih bin al-hajjaj, Nubaih bin al-hajjaj, Abu al-Bukhturi bin Hisyam, Zam'ah bin al-Aswad, hakim bin hazam, dan al-harits bin 'Amir bin Naufal. Mereka semua mempunyai amal kebajikan pada masa Arab Jahiliah, seperti menyediakan minuman jemaah haji, memberi makan para tamu yang datang ke Masjidilharam, melindungi dan menjaga hak tetangga, dan sebagainya. Semua amal mereka dibatalkan pahalanya oleh Allah, seakan-akan mereka tidak pernah berbuat apa pun, karena dasar diterimanya suatu amal dan perbuatan adalah iman kepada Allah dan Nabi Muhammad. \n\nSedangkan ayat kedua diturunkan berhubungan dengan orang Ansar di Medinah. Mereka beriman kepada Allah dan Nabi Muhammad, membantu orang-orang Muhajirin yang baru datang dari Mekah hijrah bersama Nabi Muhammad, dan mengikuti perintah dan menjauhi larangan Allah.",
          "2": "Dalam ayat ini, Allah membagi manusia menjadi dua golongan: pertama, golongan kafir, yaitu orang-orang yang mengingkari kekuasaan dan keesaan Allah, menyembah tuhan-tuhan yang lain selain Dia, menghalangi manusia beribadah kepada-Nya, membuat-buat cara beribadah kepada-Nya menurut pendapat dan keinginan sendiri, mencela dan menghalangi manusia beriman kepada Allah dan kepada Nabi Muhammad. Seluruh perbuatan golongan ini tidak mengikuti petunjuk-petunjuk Allah yang termuat di dalam Al-Qur'an dan hadis Rasul-Nya, tetapi mengikuti keinginan sendiri dan mengikuti petunjuk setan. \n\nSemua perbuatan yang berdasarkan perbuatan setan tidak ada artinya di sisi Allah walaupun perbuatan itu baik bagi manusia dan kemanusiaan. Perbuatan itu seolah-olah buih yang timbul di permukaan air, kemudian hilang tanpa bekas sedikit pun. Oleh karena itu, semua amal dan perbuatan yang dikerjakan oleh orang-orang musyrik tidak ada arti dan pahalanya di sisi Allah di akhirat nanti. Mereka hanya mendapat balasan di dunia yang diperoleh dari manusia, walaupun bentuk amal dan perbuatan itu seperti budi pekerti yang mulia, berhubungan dengan orang lain (silaturrahim), memberi makan orang miskin, memelihara anak yatim, membuat usaha-usaha kemanusiaan, memelihara dan mendirikan masjid. \n\nPekerjaan seperti ini adalah pekerjaan yang pernah dikerjakan oleh orang-orang musyrik Mekah, seperti memakmurkan Masjidilharam, melindungi orang-orang yang memerlukan perlindungan, membantu orang-orang yang mengerjakan thawaf dan sebagainya.\n\nAllah berfirman:\n\nDan Kami akan perlihatkan segala amal yang mereka kerjakan, lalu Kami akan jadikan amal itu (bagaikan) debu yang beterbangan. (al-Furqan/25: 23)\n\nKedua, golongan mukmin, yaitu orang-orang yang mengakui keesaan Allah, taat hanya kepada-Nya saja, beribadah sesuai dengan petunjuk Allah, tidak menurut kemauan sendiri dan menjauhi larangan-Nya, beriman kepada Al-Qur'an yang dibawa Nabi Muhammad, dan membantu manusia melaksanakan ibadah kepada-Nya. Ini adalah golongan yang diridai Allah. Amal dan perbuatan golongan mukmin diterima Allah, diampuni segala dosanya, mereka mendapat pahala di dunia sedang di akhirat akan mendapat kebahagiaan yang abadi.\n\nMenurut Ibnu 'Abbas, ayat pertama diturunkan berhubungan dengan orang-orang yang memberi makan tentara musyrik Mekah pada waktu Perang Badar. Mereka ada dua belas orang, yaitu Abu Jahal, al-harits bin Hisyam, 'Utbah bin Rabi'ah, Syaibah bin Rabi'ah, Ubay bin Khalaf, Umayyah bin Khalaf, Munabbih bin al-hajjaj, Nubaih bin al-hajjaj, Abu al-Bukhturi bin Hisyam, Zam'ah bin al-Aswad, hakim bin hazam, dan al-harits bin 'Amir bin Naufal. Mereka semua mempunyai amal kebajikan pada masa Arab Jahiliah, seperti menyediakan minuman jemaah haji, memberi makan para tamu yang datang ke Masjidilharam, melindungi dan menjaga hak tetangga, dan sebagainya. Semua amal mereka dibatalkan pahalanya oleh Allah, seakan-akan mereka tidak pernah berbuat apa pun, karena dasar diterimanya suatu amal dan perbuatan adalah iman kepada Allah dan Nabi Muhammad. \n\nSedangkan ayat kedua diturunkan berhubungan dengan orang Ansar di Medinah. Mereka beriman kepada Allah dan Nabi Muhammad, membantu orang-orang Muhajirin yang baru datang dari Mekah hijrah bersama Nabi Muhammad, dan mengikuti perintah dan menjauhi larangan Allah.",
          "3": "Dalam ayat ini diterangkan sebab dihapusnya pahala amal dan perbuatan orang-orang kafir dan sebab-sebab diterima serta diberi pahalanya amal dan perbuatan orang-orang yang beriman. Allah membatalkan pahala amal dan perbuatan orang-orang kafir karena mereka lebih memilih kesesatan daripada kebenaran, mengikuti godaan setan, mengikuti hawa nafsunya, dan tidak beriman kepada Allah dan Rasul-Nya. \n\nKunci diterimanya suatu amal dan perbuatan ialah iman kepada Allah dan Rasul-Nya. Orang-orang yang beriman tunduk dan patuh kepada Allah, dan seluruh amal dan perbuatannya ditujukan semata-mata mencari keridaan Allah. Oleh karena itu, Allah menenangkan hati dan pikiran mereka serta membimbing mereka menempuh jalan yang lurus.\n\nDi samping menerangkan dengan tegas sikap dan tindakan-Nya terhadap orang-orang kafir dan orang-orang yang beriman, Allah membuat perumpamaan, tamsil, dan ibarat bagi manusia dengan mengemukakan berbagai sifat, perbuatan, dan keyakinan seseorang dalam hidup dan kehidupannya serta akibat dan balasan dari perbuatan mereka. Sebenarnya orang-orang yang mau mengerti dan memahami hikmah di balik perumpamaan, tamsil, dan ibarat itu, mereka tentu beriman kepada Allah, tetapi karena hati, pendengaran, dan penglihatan orang-orang kafir telah tertutup dan terkunci karena kejahatan yang telah dilakukan, maka semua perumpamaan itu tidak berarti sedikit pun bagi mereka.\n\nDari ayat ini dapat diambil satu kesimpulan, yaitu telah menjadi sunatullah (hukum Allah) yang tidak dapat dimungkiri oleh siapa pun, bahwa dasar semua amal dan perbuatan seseorang yang diridai Allah ialah iman kepada-Nya, kepada Muhammad sebagai rasul-Nya, kepada semua yang dibawa oleh rasul, mengerjakan semua perintah-perintah-Nya, serta menjauhi semua larangan-Nya. Itulah perbuatan yang bisa mendatangkan pahala, sedangkan perbuatan yang tidak didasari dengan iman, takwa, dan taat kepada-Nya, tidak ada pahalanya di sisi Allah, ibarat buih yang mengapung di permukaan air yang timbul dan hilang tanpa meninggalkan bekas.",
          "4": "Ayat ini menerangkan kepada kaum Muslimin cara menghadapi orang-orang kafir dalam peperangan. Mereka harus mencurahkan segala kesanggupan dan kemampuan untuk menghancurkan musuh. Hendaklah mengutamakan kemenangan yang akan dicapai pada setiap medan pertempuran dan jangan mengutamakan penawanan musuh dan perebutan harta rampasan. Penawanan dilakukan setelah mereka dikalahkan, karena orang-orang kafir itu setiap saat berkeinginan membunuh dan menghancurkan kaum Muslimin dan mereka tidak dapat dipercaya. Mereka berpura-pura ingin berdamai, tetapi hati dan keyakinan mereka tetap ingin menghancurkan agama Islam dan pengikutnya pada setiap kesempatan yang mungkin mereka miliki. Setelah perang selesai dengan kemenangan di tangan kaum Muslimin, mereka boleh memilih salah satu dari dua hal, yaitu apakah akan membebaskan tawanan yang telah ditawan atau membebaskannya dengan membayar tebusan oleh pihak musuh atau dengan cara pertukaran tawanan.\n\nDalam ayat lain diterangkan bahwa batas kaum Muslimin harus berhenti memerangi orang-orang kafir Mekah itu adalah sampai tidak ada lagi fitnah. Allah berfirman:\n\nDan perangilah mereka itu sampai tidak ada lagi fitnah, dan agama hanya bagi Allah semata. Jika mereka berhenti, maka tidak ada (lagi) permusuhan, kecuali terhadap orang-orang zalim. (al-Baqarah/2: 193)\n\nIbnu 'Abbas berkata, \"Tatkala jumlah kaum Muslimin bertambah banyak dan kekuatannya semakin bertambah pula, Allah menurunkan ayat ini, dan Rasulullah bertindak menghadapi tawanan sesuai dengan ayat ini, begitu pula para khalifah yang datang sesudahnya.\"\n\nDari ayat di atas dan perkataan Ibnu 'Abbas dapat dipahami hal-hal sebagai berikut:\n\n1. Ayat ini diturunkan setelah Perang Badar karena pada saat peperangan itu Rasulullah saw lebih mengutamakan tebusan, seperti menebus dengan harta atau dengan menyuruh tawanan mengajarkan tulis baca kepada kaum Muslimin, sehingga Rasul mendapat teguran dari Allah. \n\n2. Ayat ini merupakan pegangan bagi Rasulullah dan para sahabat dalam menyelesaikan persoalan yang berhubungan dengan peperangan dan tawanan perang.\n\n3. Perintah membunuh orang-orang kafir dalam ayat ini dilakukan dalam peperangan, bukan di luar peperangan. Oleh karena itu, wajar jika Allah memerintahkan kepada kaum Muslimin membunuh musuh-musuh mereka dalam peperangan yang sedang berkecamuk karena musuh sendiri bertindak demikian pula terhadap mereka. Jika Allah tidak memerintahkan demikian, tentu kaum Muslimin ragu-ragu menghadapi musuh yang akan membunuh mereka sehingga musuh berkesempatan menghancurkan mereka.\n\n4. Allah tidak memerintahkan kaum Muslimin membunuh orang-orang kafir di mana saja mereka temui, tetapi Allah hanya memerintahkan kaum Muslimin memerangi orang-orang kafir yang bermaksud merusak, memfitnah, dan menghancurkan Islam dan kaum Muslimin. Terhadap orang kafir yang bersikap baik terhadap agama Islam dan kaum Muslimin, kaum Muslimin wajib bersikap baik pula terhadap mereka. Allah berfirman:\n\nAllah tidak melarang kamu berbuat baik dan berlaku adil terhadap orang-orang yang tidak memerangimu dalam urusan agama dan tidak mengusir kamu dari kampung halamanmu. Sesungguhnya Allah mencintai orang-orang yang berlaku adil. Sesungguhnya Allah hanya melarang kamu menjadikan mereka sebagai kawanmu, orang-orang yang memerangi kamu dalam urusan agama dan mengusir kamu dari kampung halamanmu dan membantu (orang lain)untuk mengusirmu. Barang siapa menjadikan mereka sebagai kawan, mereka itulah orang-orang yang zalim. (al-Mumtahanah/60: 8-9)\n\n5. Kepala negara mempunyai peranan dalam mengambil keputusan dan kebijaksanaan dalam menyelesaikan peperangan dan tawanan perang. Ia harus mendasarkan keputusannya kepada kepentingan agama, kaum Muslimin dan kemanusiaan serta kemaslahatan pada umumnya.\n\nMemaksa tawanan masuk agama Islam tidak dibolehkan karena tindakan itu bertentangan dengan firman Allah yang melarang kaum Muslimin memaksa orang lain memeluk agama Islam. Allah berfirman: \n\nTidak ada paksaan dalam (menganut) agama (Islam), sesungguhnya telah jelas (perbedaan) antara jalan yang benar dengan jalan yang sesat. Barang siapa ingkar kepada Tagut dan beriman kepada Allah, maka sungguh, dia telah berpegang (teguh) pada tali yang sangat kuat yang tidak akan putus. Allah Maha Mendengar, Maha Mengetahui. (al-Baqarah/2: 256) \n\nMembunuh tawanan bagi kaum Muslimin tentu ada dasarnya. Tawanan yang dibunuh itu bukan tawanan biasa, tetapi merupakan penjahat perang yang telah banyak melakukan perbuatan mungkar. Bila ia hidup, maka kejahatannya dalam peperangan akan terus berlanjut dalam waktu lama.\n\nMenjadikan tawanan sebagai budak adalah tindakan yang biasa dilakukan oleh bangsa-bangsa di dunia sebelum kedatangan Islam. Setelah datang agama Islam, maka musuh-musuh Islam menjadikan kaum Muslimin yang mereka tawan menjadi budak. Pada dasarnya perbudakan itu dilarang oleh agama Islam, tetapi sebagai balasan dari tindakan orang kafir dan untuk menjaga perasaan kaum Muslimin, maka Rasulullah saw membolehkan kaum Muslimin menjadikan orang-orang kafir yang ditawannya sebagai budak. Hal ini berarti jika orang-orang kafir tidak menjadikan kaum Muslimin yang ditawannya menjadi budak, tentulah kaum Muslimin tidak boleh menjadikan orang-orang kafir yang ditawannya menjadi budak. Meskipun terjadi perbudakan karena adanya tawanan perang, maka dalam agama Islam banyak ketentuan hukum yang dihubungkan dengan upaya memerdekakan budak yang disebut dengan kaffarat.\n\nAgama Islam adalah agama perdamaian, bukan agama yang menganjurkan peperangan. Jika dalam sejarah Islam terdapat peperangan antara kaum Muslimin dengan orang-orang kafir, maka peperangan itu terjadi karena mempertahankan agama Islam yang hendak dihapuskan orang-orang kafir, di samping mempertahankan diri dari kehancuran. Sejak Nabi Muhammad saw diangkat menjadi rasul, sejak itu pula timbul permusuhan dari orang-orang musyrik Mekah kepada beliau dan pengikut-pengikutnya. Berbagai cara yang mereka lakukan untuk menumpas agama Islam dan kaum Muslimin, mulai dari cara yang lunak sampai kepada yang paling keras. Puncak dari tindakan orang musyrik Mekah itu ialah berkomplot untuk membunuh Rasulullah saw sehingga Allah memerintahkan beliau hijrah ke Medinah. Setelah Rasulullah saw berada di Medinah permusuhan itu semakin keras, sehingga kaum Muslimin terpaksa memerangi mereka untuk mempertahankan agama dan diri mereka.\n\nSesampainya Rasulullah saw di Medinah, perjanjian damai dengan penduduk kota itu, yang antara lain adalah orang-orang Yahudi, ditandatangani, tetapi perjanjian damai itu dilanggar oleh mereka. Bahkan mereka melakukan percobaan untuk membunuh Nabi Muhammad saw. Oleh karena itu, Rasulullah saw terpaksa memerangi orang Yahudi di Medinah. \n\nSangat banyak contoh yang dapat dikemukakan yang membuktikan bahwa agama Islam tidak disebarkan melalui peperangan, tetapi melalui dakwah yang penuh hikmah dan kebijaksanaan.\n\nTerhadap tawanan perang, sikap Rasulullah saw baik sekali. Dalam hadis yang diriwayatkan oleh al-Bukhari diterangkan sikap beliau. Abu Hurairah berkata, \"Rasulullah saw mengirimkan pasukan berkuda ke Nejed, maka pasukan berkuda itu menawan seorang laki-laki dari Bani Hanifah yang bernama sumamah bin Utsal, ia diikat pada salah satu tiang masjid. Maka Rasulullah saw datang kepadanya, lalu berkata, 'Apa yang engkau punyai ya sumamah? sumamah menjawab, 'Aku mempunyai harta, jika engkau mau membunuhku, lakukanlah, dan jika engkau mau membebaskanku maka aku berterima kasih kepadamu, jika engkau menghendaki harta, maka mintalah berapa engkau mau. Esok harinya Rasulullah saw pun berkata kepadanya, 'Apakah yang engkau punya ya sumamah? Ia menjawab, 'Aku mempunyai apa yang telah kukatakan kepadamu. Rasulullah saw berkata, 'Lepaskanlah ikatan sumamah. Maka sumamah pergi ke dekat pohon kurma yang berada di dekat masjid, lalu mandi kemudian ia masuk ke masjid, lalu menyatakan, 'Aku mengakui bahwa tidak ada Tuhan selain Allah dan bahwa Muhammad itu adalah Rasul-Nya. Demi Allah, dahulu tidak ada orang yang paling aku benci di dunia ini selain engkau, sekarang jadilah engkau orang yang paling aku cintai. Demi Allah, dahulu tidak ada agama yang paling aku benci selain agama engkau, maka jadilah sekarang agama engkau adalah agama yang paling aku cintai. Demi Allah, dahulu negeri yang paling aku benci adalah negerimu, sekarang jadilah negerimu negeri yang paling aku cintai. Sesungguhnya pasukan berkuda telah menangkapku, sedang aku bermaksud umrah, apa pendapatmu? Maka Rasulullah memberi kabar gembira kepadanya dan menyuruhnya melakukan umrah. Tatkala ia sampai di Mekah, seseorang mengatakan kepadanya, 'Engkau merasa rindu? sumamah menjawab, 'Tidak, tetapi aku telah masuk Islam bersama Muhammad saw.\"\n\nDari hadis ini dapat dipahami bahwa Rasulullah saw bersikap lemah-lembut kepada sumamah, seorang tawanan perang. Beliau memberi kebebasan kepadanya, sehingga ia tertarik kepada Rasulullah saw dan agama Islam, karena itu dia menyatakan dirinya masuk Islam.\n\nSeandainya Rasulullah bersikap kasar kepadanya, tentulah sumamah tidak akan mengatakan pernyataan tersebut di dalam hadis itu. Ia akan menyimpan dendam kepada Rasulullah saw dan pada setiap kesempatan ia akan berusaha membalaskan dendamnya itu.\n\nAgama Islam datang untuk menegakkan prinsip-prinsip yang harus ada dalam hidup dan kehidupan manusia, baik ia sebagai makhluk individu maupun sebagai makhluk sosial. Di antara prinsip-prinsip itu ialah ketauhidan, keadilan, kemanusiaan, dan musyawarah. Dengan menegakkan prinsip-prinsip itu manusia akan berhasil dalam tugasnya sebagai khalifah Allah di bumi. Atas dasar semuanya itulah segala persoalan diselesaikan, termasuk persoalan peperangan dan tawanan perang.\n\nPada akhir ayat ini, Allah menerangkan balasan apa yang akan diterima oleh orang-orang yang beriman dan berjihad di jalan Allah dengan mengatakan, \"Bagi orang-orang yang berjihad di jalan Allah untuk membela agama Islam, sekali-kali Allah tidak akan mengurangi pahala mereka sedikit pun, bahkan dia akan membalasnya dengan pahala yang berlipat-ganda. Mengenai pahala berjihad di jalan Allah disebutkan dalam suatu hadis sebagai berikut:ØªÙŽØ§Diriwayatkan al-Miqdam bin Ma'diyakrib, ia berkata, \"Aku mendengar Rasulullah bersabda, 'Sesungguhnya orang yang mati syahid itu memperoleh sembilan hal-atau sepuluh, yaitu akan diampuni pada saat darahnya pertama kali mengalir, melihat tempat tinggalnya di surga, dihiasi dengan perhiasan iman, dihindarkan dari azab kubur, dinikahkan dengan bidadari, memperoleh keamanan pada saat hari ketakutan yang besar (hari Kiamat), di atas kepalanya diletakkan mahkota kemuliaan dari bahan permata yang lebih baik dari pada dunia dan isinya, dinikahkan dengan 92 istri dari golongan bidadari, dan diberi hak syafaat bagi 70 orang kerabatnya.\" (Riwayat ath-thabrani)",
          "5": "Pada ayat ini diterangkan bahwa Allah akan membimbing orang-orang yang beriman dalam melaksanakan pekerjaan yang diridai-Nya sehingga pekerjaan itu berhasil dengan baik, dan memelihara mereka agar tidak melakukan maksiat dan perbuatan dosa. Allah juga menyediakan bagi mereka tempat kembali di surga yang telah mereka ketahui karena Allah menunjukkan tempat-tempat itu kepada mereka.",
          "6": "Pada ayat ini diterangkan bahwa Allah akan membimbing orang-orang yang beriman dalam melaksanakan pekerjaan yang diridai-Nya sehingga pekerjaan itu berhasil dengan baik, dan memelihara mereka agar tidak melakukan maksiat dan perbuatan dosa. Allah juga menyediakan bagi mereka tempat kembali di surga yang telah mereka ketahui karena Allah menunjukkan tempat-tempat itu kepada mereka.",
          "7": "Allah menyeru orang mukmin, jika mereka membela dan menolong agama-Nya dengan mengorbankan harta dan jiwa, niscaya Ia akan menolong mereka dari musuh-musuhnya. Allah akan menguatkan hati dan barisan mereka dalam melaksanakan kewajiban mempertahankan agama Islam dengan memerangi orang-orang kafir yang hendak meruntuhkannya, sehingga agama Allah itu tegak dengan kokohnya.",
          "8": "Selanjutnya dijelaskan bahwa orang yang tidak beriman kepada Allah, mengingkari keesaan dan kekuasaan-Nya, maka mereka akan celaka. Allah akan menghapus semua pahala amal dan perbuatan mereka. Perbuatan mereka tidak akan mendapat hidayah dan taufik dari Allah. Allah juga akan menggagalkan semua tipu daya mereka untuk menghancurkan kaum Muslimin.",
          "9": "Ayat ini menjelaskan bahwa Allah tidak memberi pahala bagi amal dan perbuatan orang-orang kafir dan tidak memberi hidayah dan taufik-Nya karena mereka mengingkari petunjuk-petunjuk Al-Qur'an yang telah diturunkan kepada Nabi Muhammad sebagai rasul-Nya.",
          "10": "Orang-orang musyrik Mekah yang mendustakan kenabian dan kerasulan Muhammad saw, serta mengingkari kebenaran petunjuk Al-Qur'an sebagai kitab yang berasal dari Allah Yang Mahakuasa, sebenarnya mempunyai berbagai bukti untuk membenarkan kenabian dan kerasulan beliau, karena negeri itu berada di sekitar negeri umat-umat terdahulu yang pernah mendustakan dan mengingkari seruan para rasul Allah. Bukankah mereka sering pergi ke Syria, sebelah utara negeri mereka, dan Hadramaut, di sebelah selatan. Bukankah mereka juga pergi ke Persia di sebelah timur dan ke Ethiopia di sebelah barat daya negeri mereka. Kepergian mereka ke negeri-negeri tersebut dengan tujuan berdagang. \n\nDalam perjalanan itu, mereka melalui sisa-sisa reruntuhan negeri kaum 'Ad, kaum Samud, kaum Syuaib, dan sebagainya yang telah dibinasakan Allah. Mereka masih dapat melihat bekas negeri itu berupa puing, peninggalan, dan sebagainya. Mereka dapat menyaksikan reruntuhan itu, karena negeri tersebut adalah pusat perniagaan pada masa itu dan terletak pada jalur perniagaan yang menghubungkan dunia barat dengan timur. Mereka juga telah mengetahui bahwa umat-umat dahulu telah dihancurkan Allah karena durhaka kepada-Nya dan rasul-Nya. Akan tetapi, mereka tidak mau memperhatikan dan merenungkan bahwa sunatullah berlaku bagi setiap orang yang mengingkari agama-Nya.\n\nOleh karena itu, orang-orang musyrik Mekah akan mengalami nasib seperti yang telah dialami oleh umat-umat dahulu seandainya mereka tetap tidak mengindahkan seruan Nabi Muhammad. Sebagai bukti kebenaran janji Allah itu, banyak orang musyrik Mekah yang mati terbunuh dalam Perang Badar dan begitu juga pada peperangan-peperangan sesudahnya.",
          "11": "Ayat ini menjelaskan tentang keadaan orang mukmin dan orang kafir di dunia dan sebab orang musyrik ditimpa malapetaka. Orang musyrik tidak mempunyai seorang penolong pun untuk menolak azab yang datang menimpa mereka, sedangkan orang mukmin mempunyai penolong, yaitu Allah Yang Mahakuasa dan Maha Penolong.",
          "12": "Ayat ini berbicara tentang keadaan orang mukmin dan orang kafir di akhirat. Orang-orang yang beriman dan beramal saleh diberi pahala berlipat ganda berupa surga sebagai balasan dari keimanan dan ketaatan mereka. Sedangkan orang-orang yang mengingkari kekuasaan dan keesaan Allah dan mendustakan Rasul-Nya, terpengaruh oleh kenikmatan hidup di dunia yang hanya bersifat sementara. Mereka tidak mengambil pelajaran dari peristiwa-peristiwa yang telah menimpa umat-umat dahulu. Mereka diumpamakan seperti hewan yang makan di kandang atau di padang rumput yang disediakan untuk mereka. Hewan-hewan itu tidak pernah memikirkan apakah makanan yang tersedia untuknya itu masih ada untuk dimakan besok atau semua habis pada hari ini, sehingga tidak ada makanan untuk dimakan lagi.\n\nAyat ini memberikan gambaran tentang keadaan dan apa yang dipikirkan orang-orang musyrik. Mereka hanya memikirkan apa yang enak dan dapat memenuhi keinginan hawa nafsu mereka. Mereka tidak mau memikirkan berapa lama yang enak dan keinginan hawa nafsu dapat mereka nikmati dan apa sumber dari keenakan dan kesenangan itu. Apakah mereka dapat terus-menerus menikmatinya, tidak pernah mereka pikirkan. Mereka juga tidak memikirkan akibat-akibat yang akan mereka alami seandainya mereka tidak mampu merasakan kenikmatan itu lagi. Mereka merasakan kenikmatan memakan sesuatu makanan, tetapi tidak pernah terpikir oleh mereka bahwa Allah telah menganugerahkan lidah kepada mereka untuk merasakan kenikmatan sesuatu yang dimakan. Bagaimana jadinya jika Allah memberi penyakit pada lidah mereka, sehingga tidak dapat merasakan sesuatu lagi? Mereka tidak memikirkan sikap dan tindakan yang paling baik yang harus mereka lakukan terhadap sumber kenikmatan itu.\n\nOrang-orang yang digambarkan ayat di atas tempat kembalinya ialah neraka Jahanam, karena itulah tempat kembali yang paling layak bagi orang-orang yang tidak menggunakan pikirannya.",
          "13": "Diriwayatkan oleh 'Abd bin humaid, Abu Ya'la, Ibnu Abi hatim, dan Ibnu Mardawaih dari Ibnu 'Abbas, bahwa tatkala Nabi Muhammad akan meninggalkan Mekah, sebelum hijrah ke Medinah, beliau menoleh ke belakang melihat negeri Mekah dan berkata, \"Engkau (Mekah) adalah negeri Allah yang paling aku cintai, dan kalau penduduknya tidak mengusirku, tentu aku tidak akan meninggalkan engkau.\" Maka turunlah ayat ini.\n\nDalam ayat ini, Allah memberikan perbandingan sebagai penghibur hati Nabi Muhammad yang telah digundahkan oleh sikap dan tindakan orang-orang musyrik Mekah. Diterangkan bahwa berapa banyak negeri yang penduduknya lebih kuat badannya, lebih banyak pengetahuannya, lebih mampu membangun negerinya, lebih banyak tentaranya sehingga dapat menaklukkan negeri sekitar mereka dibandingkan dengan orang-orang musyrik Mekah. Semuanya itu telah dihancurkan Allah dengan berbagai macam malapetaka yang menimpa mereka. Dalam menghadapi malapetaka itu, mereka tidak mempunyai seorang penolong pun. Semua kekuatan, kekuasaan, dan tentara yang gagah perkasa tidak ada artinya sedikit pun dalam menghadapi malapetaka itu. Orang-orang musyrik Mekah akan mengalami nasib yang demikian pula seandainya mereka tetap mengingkari seruan Nabi Muhammad. Oleh karena itu, Nabi dihimbau untuk bersabar dan tabah menghadapi sikap dan tindakan mereka dan Allah pasti menolong dan memenangkan hamba-hamba yang taat kepada-Nya.",
          "14": "Ayat ini menjelaskan perbandingan antara orang-orang yang beriman dengan orang kafir dengan mengatakan, \"Apakah sama orang yang mau berpikir sehingga ia mempunyai pengertian, pemahaman, dan keyakinan terhadap agama Allah dan Al-Qur'an yang diturunkan kepada Muhammad saw dengan orang-orang yang tidak mau menggunakan pikirannya, sehingga ia tidak percaya bahwa Allah akan memberi balasan yang setimpal kepada orang-orang yang menuruti hawa nafsunya dan godaan setan? Tentu saja kedua macam orang itu tidak sama, bahkan perbedaan keduanya sangat besar.\n\nPada ayat yang lain Allah berfirman:\n\nMaka apakah orang yang mengetahui bahwa apa yang diturunkan Tuhan kepadamu adalah kebenaran, sama dengan orang yang buta? Hanya orang berakal saja yang dapat mengambil pelajaran. (ar-Ra'd/13: 19)\n\nDan firman Allah:\n\nTidak sama para penghuni neraka dengan para penghuni surga; para penghuni surga itulah orang-orang yang memperoleh kemenangan. (al-hasyr/59: 20)",
          "15": "Tidak sama ganjaran yang akan diperoleh oleh orang yang beriman di akhirat dengan ganjaran yang akan diperoleh oleh orang yang tidak beriman. Ayat ini melukiskan keadaan surga dan neraka dalam bentuk simbolis yang menarik sekali. Di mulai dengan kata \"perumpamaan\"(matsalul jannati). Pertama \"surga\", dan \"perumpamaan\" kedua, \"samakah\" (kaman) yang dirangkum dalam nada tanya. Kata az-Zamakhsyari (dalam al-Kasysyaf), ungkapan ini dalam bentuk afirmasi, tetapi hakikatnya penyangkalan, suatu negasi.\n\nSifat-sifat surga yang dijelaskan dalam ayat ini di antaranya: pertama, di dalamnya mengalir sungai yang banyak dan setiap sungai mempunyai air yang berbagai macam jenis dan rasanya serta enak diminum oleh para penghuni surga. Di antara jenis air itu ialah:\n\n1.Ada yang airnya jernih lagi bersih, tidak dikotori oleh suatu apa pun. Oleh karena itu, tidak akan berubah rasa, warna, dan baunya.\n\n2.Ada sungai yang mengalirkan air susu yang baik diminum. Susu itu tetap baik dan enak, tidak akan berubah rasanya karena rusak atau busuk.\n\n3.Ada sungai yang mengalirkan khamar yang enak diminum, menyehatkan, dan menyegarkan tubuh dan perasaan peminumnya. Tidak seperti khamar di dunia. Sekali pun enak diminum oleh pecandunya, tetapi dapat merusak tubuh, akal, dan pikiran. Oleh karena itu, khamar di surga halal diminum, sedangkan khamar di dunia haram.\n\n4.Ada sungai yang mengalirkan madu yang bersih, seperti madu yang telah disaring, enak, dan menyehatkan badan peminumnya.\n\nDiriwayatkan oleh Ahmad, at-Tirmidhi, dan lain-lain dari Mu'awiyah bin haidah, ia berkata: \n\nAku mendengar Rasulullah saw bersabda, \"Di surga ada lautan susu, lautan air, lautan madu, dan lautan khamar, kemudian mengalirlah sungai-sungai dari lautan-lautan itu.\" (Riwayat Ahmad, at-Tirmidhi, dan lain-lain dari Mu'awiyah bin haidah)\n\nKedua, di dalam surga terdapat buah-buahan yang beraneka ragam jenisnya, berbeda warna, bentuk, dan rasanya. Semuanya merupakan makanan yang enak bagi setiap penghuni surga.\n\nKetiga, penduduk surga itu adalah orang-orang bersih dari segala noda dan dosa, karena mereka itu telah diampuni Allah Tuhan Yang Maha Penyayang, Pelindung mereka.\n\nKemudian Allah menerangkan keadaan orang-orang yang hidup dalam neraka. Mereka meminum air yang sangat panas yang menghancurkan usus-ususnya dan api neraka yang membakar hangus muka mereka.",
          "16": "Ayat ini menjelaskan bahwa ketika Nabi Muhammad membacakan Al-Qur'an, di antara yang mendengar terdapat orang-orang munafik, namun mereka tidak memahami bacaan beliau. Setelah mereka pergi meninggalkan Nabi, mereka bertanya kepada sahabat-sahabat Nabi yang berilmu dan memahami semua perkataannya, \"Apakah yang dikatakan Muhammad dalam pertemuan tadi?\" Pertanyaan ini adalah sesuatu yang tidak ada faedahnya.\n\nTujuan mereka melakukan yang demikian tidak lain hanyalah untuk memperolok-olok ucapan Rasulullah. Mereka seakan-akan memahami ucapan beliau, sehingga mereka bertanya dan memberikan tanggapan, dengan mengatakan bahwa yang diucapkan Rasulullah itu tidak ada artinya sedikit pun bagi mereka.\n\nDiriwayatkan oleh Muqatil bahwa Nabi Muhammad berkhutbah dan menerangkan keburukan budi pekerti orang munafik dan di antara yang mendengar khutbah itu ada pula orang munafik. Setelah khutbah selesai, orang munafik itu keluar dan bertanya kepada 'Abdullah bin Mas'ud dengan maksud memperolok-olok dan merendahkan Rasulullah. Di antaranya mereka mengatakan, \"Apa yang dikatakan Muhammad tadi?\" Ibnu 'Abbas berkata, \"Saya pun pernah ditanya dengan pertanyaan seperti itu.\"\n\nKemudian ayat itu menerangkan apa sebab kaum munafik melakukan yang demikian. Orang-orang yang telah diterangkan sifat-sifatnya itu adalah mereka yang telah dicap dan dikunci mati hatinya, sehingga mereka tidak dapat lagi menerima petunjuk dan kebenaran yang telah disampaikan kepada mereka.",
          "17": "Dalam ayat ini diterangkan keadaan orang yang berlawanan sifatnya dengan orang munafik. Mereka adalah orang yang telah mendapat petunjuk, beriman, mendengar, memperhatikan, dan mengamalkan ayat-ayat Al-Qur'an. Dada mereka dilapangkan Allah, hati mereka menjadi tenteram bila mendengarkan ayat-ayat Al-Qur'an atau bila mereka membacanya, pengetahuannya semakin bertambah tentang agama Allah. Allah menambah petunjuk lagi bagi mereka dengan jalan ilham dan membimbing mereka untuk mengerjakan amal saleh serta memberi kesanggupan kepada mereka untuk menambah ketaatan dan ketakwaan mereka.",
          "18": "Orang-orang yang telah dicap dan dikunci mati hatinya sehingga tidak dapat lagi menerima kebenaran dan petunjuk adalah orang yang hidupnya sudah tidak lagi berfaedah. Mereka hanya menunggu-nunggu kematian dan kedatangan hari Kiamat yang datang secara tiba-tiba. Apabila hari Kiamat itu telah datang, dan memang telah kelihatan tanda-tandanya, maka tidak ada lagi gunanya peringatan bagi mereka, dan Allah tidak akan menerima tobat mereka, bahkan tidak ada lagi gunanya iman dan amal bagi mereka. Allah berfirman:\n\nDan pada hari itu diperlihatkan neraka Jahanam; pada hari itu sadarlah manusia, tetapi tidak berguna lagi baginya kesadaran itu. (al-Fajr/89: 23)",
          "19": "Dalam ayat ini, Allah memerintahkan Nabi Muhammad, apabila ia telah yakin dan mengetahui pahala yang akan diperoleh oleh orang-orang yang beriman, serta azab yang akan diperoleh oleh orang-orang kafir di akhirat, untuk berpegang teguh kepada agama Allah yang dapat mendatangkan kebahagiaan hidup di dunia dan di akhirat. Beliau juga diperintahkan untuk memohon kepada Allah agar mengampuni dosa-dosanya dan dosa-dosa orang beriman, selalu berdoa dan berzikir kepada-Nya, dan janganlah sekali-kali memberi kesempatan kepada setan untuk melaksanakan maksud buruknya kepada beliau.\n\nSebuah hadis sahih mengatakan, Rasulullah saw selalu berdoa: \n\nWahai Allah, ampunilah kesalahanku, kebodohanku, dan perbuatanku yang berlebih-lebihan, dan dosaku yang lebih Engkau ketahui daripadaku. Wahai Allah, ampunilah dosa perkataanku yang tidak serius dan perkataanku yang sungguh-sungguh, kesalahanku, kesengajaanku, dan semua yang ada padaku.\" (Riwayat al-Bukhari dari Abu Musa al-Asy'ari) \n\nRasulullah sering berdoa pada akhir salatnya, sebelum mengucapkan salam:\n\nYa Allah, ampunilah dosaku yang terdahulu dan yang terkemudian, yang tersembunyi dan yang tampak, serta perbuatanku yang berlebihan dan dosaku yang Engkau lebih mengetahui daripadaku, Engkau Tuhanku, tak ada tuhan selain Engkau.\" (Riwayat al-Bukhari dan Muslim dari Ibnu 'Abbas)\n\nHai manusia, bertobatlah kamu kepada Tuhanmu maka sesungguhnya aku pun mohon ampun kepada Allah dan bertobat kepada-Nya setiap hari lebih dari tujuh puluh kali. (Riwayat Muslim)\n\nAbu Bakar as-shiddiq berkata, \"Hendaklah kamu membaca, \"La ilaha illallah dan istigfar.\" Bacalah keduanya berulang kali, maka sesungguhnya Iblis berkata, \"Aku membinasakan manusia dengan perbuatan dosanya, dan mereka membinasakanku dengan membaca La ilaha illallah dan istigfar, maka ketika aku mengetahui yang demikian, mereka aku hancurkan dengan hawa nafsunya, mereka mengira mendapat petunjuk.\" (Riwayat Abu Ya'la).\n\nDalam satu atsar diterangkan perkataan Iblis, \"Demi keperkasaan dan keagungan-Mu, wahai Tuhan, aku senantiasa memperdaya mereka selama nyawa mereka dikandung badan.\" Lalu Allah berfirman, \"Demi keperkasaan dan keagungan-Ku, Aku senantiasa mengampuni dosa mereka, selama mereka tetap memohon ampunan kepada-Ku.\"\n\nSelanjutnya Allah mendorong manusia melaksanakan perintah-Nya, menjauhi larangan-Nya, dan agar selalu berusaha untuk mencari rezeki dan kebahagiaan hidupnya. Allah berfirman, \"Dia mengetahui segala usaha, perilaku, dan tindak-tanduk mereka di siang hari, begitu pula tempat mereka berada di malam hari. Oleh karena itu, bertakwa dan meminta ampunlah kepada-Nya.\" Dalam ayat lain, Allah berfirman:\n\nDan tidak satu pun makhluk bergerak (bernyawa) di bumi melainkan semuanya dijamin Allah rezekinya. Dia mengetahui tempat kediamannya dan tempat penyimpanannya.) Semua (tertulis) dalam Kitab yang nyata (Lauh Mahfudz). (Hud/11: 6)\n\nDan Dialah yang menidurkan kamu pada malam hari dan Dia mengetahui apa yang kamu kerjakan pada siang hari. Kemudian Dia membangunkan kamu pada siang hari untuk disempurnakan umurmu yang telah ditetapkan. Kemudian kepada-Nya tempat kamu kembali, lalu Dia memberitahukan kepadamu apa yang telah kamu kerjakan. (al-An'am/6: 60)",
          "20": "Orang-orang yang beriman kepada Allah dan Rasul-Nya dengan setulus hati pasti bersedia mengorbankan harta dan jiwanya di jalan Allah. Mereka menunggu-nunggu turunnya wahyu Allah, terutama wahyu yang berhubungan dengan perintah jihad. Akan tetapi, perintah perang itu pada dasarnya bukan untuk menyerang, melainkan untuk mempertahankan diri dari serangan musuh, seperti yang terjadi dengan Perang Badar, Perang Uhud, Perang Khandak, dan lain-lain. Mereka berkata, \"Mengapa Allah tidak menurunkan kepada kita ayat-ayat yang tegas dan jelas maksudnya yang di dalamnya disebutkan bahwa berperang membela agama Allah itu adalah suatu perintah wajib yang harus dilaksanakan oleh setiap orang beriman.\" Sebaliknya orang-orang munafik bersikap lain. Bila diturunkan ayat yang tegas dan jelas maknanya yang berisi perintah jihad, melihat kepada Nabi dengan pandangan keingkaran dan ketakutan. Hati mereka kecut, tubuh mereka gemetar mendengarnya, dan mereka bungkam, seperti orang yang sedang menghadapi saat kematian.\n\nDalam ayat lain, Allah berfirman:\n\nTidakkah engkau memperhatikan orang-orang yang dikatakan kepada mereka, \"Tahanlah tanganmu (dari berperang), laksanakanlah salat dan tunaikanlah zakat!\" Ketika mereka diwajibkan berperang, tiba-tiba sebagian mereka (golongan munafik) takut kepada manusia (musuh), seperti takutnya kepada Allah, bahkan lebih takut (dari itu). Mereka berkata, \"Ya Tuhan kami, mengapa Engkau wajibkan berperang kepada kami? Mengapa tidak Engkau tunda (kewajiban berperang) kepada kami beberapa waktu lagi?\" Katakanlah, \"Kesenangan di dunia ini hanya sedikit dan akhirat itu lebih baik bagi orang-orang yang bertakwa (mendapat pahala turut berperang) dan kamu tidak akan dizalimi sedikit pun.\" (an-Nisa'/4: 77)\n\nDari jawaban dan sikap orang munafik, tergambar apa yang tersirat dalam hati mereka. Orang yang demikian lebih baik mati daripada hidup mengekang diri dari perintah-perintah agama. Seseorang hidup untuk menjadi hamba Allah yang taat kepada-Nya, ingin mencapai kebahagiaan hidup di dunia dan di akhirat. Orang munafik tidak melaksanakan ketaatan itu. Mereka seakan-akan tidak memikirkan kebahagiaan hidup sesudah mati. Oleh karena itu, tidak ada arti hidup bagi mereka selain untuk melipat-gandakan perbuatan dosa yang menyebabkan mereka di azab di akhirat. Jika mereka mati waktu itu juga, azab mereka tidak akan bertambah di akhirat nanti.",
          "21": "Ayat ini menjelaskan sikap yang seharusnya dimiliki oleh orang-orang munafik adalah taat kepada Allah, mengucapkan perkataan yang makruf, daripada takut, dan gentar menghadapi musuh. Akan tetapi, mereka tidak demikian. Hal itu karena kesenangan hidup di dunia telah membuat mereka terpesona dan lupa diri. Mereka takut kehilangan kesenangan. Padahal jika mereka mengetahui bahwa kesenangan hidup di dunia adalah kesenangan yang semu dan sementara, sedangkan kesenangan hidup di akhirat adalah kesenangan yang sebenarnya, tentu mereka akan mengubah sikap.\n\nSelanjutnya diterangkan bahwa kaum munafik itu apabila datang perintah berperang, timbullah kebencian dalam hati mereka sehingga mereka enggan ikut berperang. Seandainya mereka mempunyai iman yang kuat di dalam dada mereka, benar-benar taat kepada Allah dan mengikuti Rasul, pasti mereka ikut berperang bersama Rasul. Hal itu lebih baik bagi mereka karena dengan demikian mereka dekat kepada Allah.",
          "22": "Ayat ini mencela sikap kaum munafik yang selalu mengejar kesenangan hidup di dunia, dengan mengatakan, \"Hai orang munafik, karena kamu selalu mengejar kesenangan hidup di dunia dan kemewahannya, maka seandainya kamu berkuasa, pastilah kamu mempunyai sifat-sifat ingin mementingkan diri sendiri dengan memperlihatkan kekuasaan kepada rakyat jelata, suka mengambil dan memperkosa hak orang lain, dan memutuskan hubungan silaturrahim yang sangat dianjurkan untuk disambungkan.",
          "23": "Orang-orang munafik yang bersikap seperti yang disebutkan di atas telah dijauhkan Allah dari rahmat-Nya. Oleh karena itu, Allah menghilangkan pendengaran mereka sehingga tidak dapat mengambil pelajaran dari apa yang dapat mereka dengar, dan Allah membutakan mereka sehingga mereka tidak dapat mengambil manfaat dari apa yang mereka lihat.",
          "24": "Apakah orang-orang munafik itu tidak memperhatikan dan memahami ajaran-ajaran Allah yang terdapat dalam Al-Qur'an, tidak pula merenungkan dan memikirkannya, sehingga mereka mengetahui kesalahan sikap dan tindakan mereka selama ini? Atau telah terkunci hati dan penglihatan mereka sehingga tidak dapat lagi memahami isinya?\n\nSikap dan tindakan yang dilakukan oleh kaum munafik itu tidak saja dilakukan terhadap orang beriman, tetapi juga terhadap orang Yahudi. Mereka menyatakan kesediaan bekerja sama dengan orang Yahudi Bani Nadhir dan Bani Quraidzah. Bahkan mereka bersedia mengikuti sebahagian keinginan orang Yahudi untuk menarik hati mereka, tetapi semua janji dan kesediaan itu tidak mereka tepati. Mereka terkadang tidak segan-segan mencelakakan teman yang diajak bersekongkol, dengan menohok kawan seiring. \n\nAllah berfirman:\n\nTidakkah engkau memperhatikan orang-orang munafik yang berkata kepada saudara-saudaranya yang kafir di antara Ahli Kitab, \"Sungguh, jika kamu diusir niscaya kami pun akan keluar bersama kamu; dan kami selama-lamanya tidak akan patuh kepada siapa pun demi kamu, dan jika kamu diperangi pasti kami akan membantumu.\" Dan Allah menyaksikan, bahwa mereka benar-benar pendusta. (al-hasyr/59: 11)",
          "25": "Dalam ayat ini dijelaskan bahwa orang-orang yang kembali kafir setelah nyata bagi mereka jalan yang lurus yang harus ditempuh dengan mengerjakan perbuatan dosa dan sesat adalah orang yang telah termakan dan terpengaruh oleh tipu daya setan. Setan menjadikan perbuatan dosa dan kesesatan yang mereka kerjakan sebagai perbuatan baik dalam pandangan mereka, sehingga mereka hidup dengan bergelimang dosa dan kesesatan. Di samping itu, mereka dibuai oleh angan-angan yang palsu, sesuai dengan dorongan hawa nafsu mereka. Dengan demikian, hawa nafsu itu menjadi ukuran baik atau buruknya suatu perbuatan. Apa yang dianggap baik oleh hawa nafsu mereka, itulah yang mereka anggap baik. Hal-hal inilah yang memunculkan kemunafikan dalam diri mereka.",
          "26": "Orang-orang munafik kembali kepada kekafiran, padahal tadinya mereka kelihatan telah beriman, karena mereka memihak dan bersekutu dengan orang Yahudi dari Bani Nadhir dan Bani Quraidzah untuk memerangi orang yang beriman. Kaum munafik menyatakan bahwa mereka akan turut berperang di pihak Bani Nadhir dan Bani Quraidzah menghadapi kaum Muslimin jika sekiranya suku Yahudi itu diusir dari Medinah. \n\nOrang Yahudi pernah menganjurkan kepada kaum munafik agar memperlihatkan kekafiran mereka dengan terang-terangan. Akan tetapi, mereka tidak mematuhi anjuran itu, kecuali dalam beberapa hal. Di antara yang tidak mereka patuhi adalah anjuran untuk menyatakan kekafiran dengan terus-terang. Kekafiran itu tetap mereka rahasiakan karena masih mengharapkan keuntungan dengan menyembunyikannya. Akan tetapi, Allah mengetahui tindakan yang mereka rahasiakan, karena tidak satu pun yang tidak diketahui-Nya. Dalam ayat lain, Allah menerangkan cara mereka mengatur siasat dan tipu dayanya. Allah berfirman:\n\nDan mereka (orang-orang munafik) mengatakan,\"(Kewajiban kami hanyalah) taat.\" Tetapi, apabila mereka telah pergi dari sisimu (Muhammad, sebagian dari mereka mengatur siasat di malam hari (mengambil keputusan) lain dari yang telah mereka katakan tadi. Allah mencatat siasat yang mereka atur di malam hari itu, maka berpalinglah dari mereka dan bertawakallah kepada Allah. Cukuplah Allah yang menjadi pelindung. (an-Nisa'/4: 81)",
          "27": "Ayat ini masih berbicara tentang kaum munafik, apakah yang akan mereka lakukan jika tetap berada dalam kemunafikan itu. Mereka hanya dapat melakukan kemunafikan dan tipu daya semasa mereka masih hidup, berkuasa, dan dalam keadaan sehat jasmani dan rohani. Bagaimana pendapat mereka bila Allah menghilangkan kesehatan mereka dengan seketika, dan ketuaan berangsur pula mendekati kehidupan mereka? Bagaimana pendapat mereka di waktu kematian mendekati mereka dan malaikat maut memukul muka dan punggung mereka; apakah yang akan mereka lakukan? Bagaimana pula pendapat mereka jika mereka mati dengan tiba-tiba, sehingga tidak ada kesempatan sedikit pun bagi mereka untuk bertobat kepada Allah yang menentukan segala sesuatu di akhirat? Jika mereka memikirkan dan merenungkan semuanya itu, tentu mereka tidak akan melakukan perbuatan ingkar dan dosa.\n\nDalam ayat ini disebutkan bahwa ketika malaikat akan mencabut nyawa mereka, malaikat akan mengeluarkan roh mereka dengan kuat dan kasar serta memukul wajah dan punggung mereka. Orang Arab amat takut dipukul di wajah dan punggung. Karena mereka takut dipukul musuh di wajah dan punggung, maka mereka tidak mau pergi berperang. Ayat ini menunjukkan keadaan orang-orang munafik dalam keadaan sengsara dan terhina pada waktu menghadapi sakaratul maut. Allah berfirman:\n\nDan sekiranya kamu melihat ketika para malaikat mencabut nyawa orang- orang yang kafir sambil memukul wajah dan punggung mereka (al-Anfal/8: 50)",
          "28": "Mereka mengalami keadaan yang demikian karena sering mengerjakan maksiat, selalu ingkar kepada Allah, menuruti hawa nafsu, dan tidak mau mengerjakan pekerjaan yang diridai-Nya. Mereka beribadah kepada Allah hanya karena ria dan ingin dihargai orang. Oleh karena itu, semua amal yang mereka kerjakan, seperti bersedekah dan menolong orang-orang yang lemah, miskin, dan sengsara, tidak ada guna dan faedahnya. Sebab, amal dan perbuatan baik yang dapat diterima bila didasari dengan iman kepada Allah dan Rasul-Nya.",
          "29": "Apakah orang munafik mengira bahwa dalam permusuhan, dan niat jahat terhadap orang-orang yang beriman yang terpendam dalam hati mereka tidak akan diketahui? Apakah mereka mengira bahwa Allah tidak mengetahuinya sehingga Dia tidak memberitahukannya kepada Rasul-Nya dan orang-orang yang beriman? Allah Yang Maha Mengetahui segala sesuatu, akan memberitahukan kepada hamba-hamba-Nya yang beriman tentang semua rahasia jahat mereka.\n\nMengenai rahasia dan rencana jahat kaum munafik diterangkan panjang lebar dalam Surah at-Taubah. Di antaranya ialah firman Allah: \n\nOrang-orang munafik laki-laki dan perempuan, satu dengan yang lain adalah (sama), mereka menyuruh (berbuat) yang mungkar dan mencegah (perbuatan) yang makruf dan mereka menggenggamkan tangannya (kikir). Mereka telah melupakan Allah, maka Allah melupakan mereka (pula). Sesungguhnya orang-orang munafik itulah orang-orang yang fasik. (at-Taubah/9: 67)",
          "30": "Pada ayat ini, Allah menyatakan kepada Rasulullah saw, \"Hai Muhammad, jika Kami menghendaki untuk memperkenalkan kepadamu pribadi-pribadi orang munafik itu sehingga kamu mengenal seorang demi seorang berdasarkan tanda-tanda yang ada pada mereka, tentulah tidak sukar bagi Kami melakukannya. Akan tetapi, Kami tidak berbuat demikian, agar keluarga mereka yang beriman kepada Kami tidak mereka aniaya. Sekalipun demikian, kamu dapat mengetahui orang-orang munafik itu dengan memperhatikan ungkapan-ungkapan dan cara-cara mereka berbicara. Mereka tidak mau berbicara secara tegas dan jelas, melainkan selalu memakai isyarat dan sindiran serta kiasan yang kurang jelas maksudnya, dan mereka berbuat dan bertindak tidak sesuai dengan apa yang mereka katakan.\n\nPada masa Rasulullah saw, orang munafik bila berbicara selalu menggunakan kata-kata yang muluk-muluk dan menyenangkan hati pendengarnya, tetapi dalam hati mereka terkandung maksud jahat. Al-Kalbi berkata, \"Setelah ayat ini turun, Rasulullah mengetahui orang-orang munafik bila mereka berbicara dengan beliau. Sedangkan Anas r.a. mengatakan, \"Allah memberitahukan orang-orang munafik kepada Rasulullah dengan perantara wahyu atau dengan tanda-tanda yang ditampakkannya kepada beliau.\"\n\nSehubungan dengan orang-orang munafik, 'Utsman bin 'Affan berkata, \"Tidak ada suatu rahasia yang tersembunyi dalam hati seseorang, kecuali Allah menampakkannya pada air muka dan ucapan lahirnya.\"\n\nPada akhir ayat ini, Allah menyatakan bahwa keadaan orang mukmin tidak sama dengan orang munafik. Dia akan membalas amal perbuatan orang mukmin sesuai dengan maksud dan niatnya masing-masing, karena Allah mengetahui amal perbuatan mereka.",
          "31": "Dengan adanya ketentuan perang dan kewajiban-kewajiban berat yang lain, Allah menguji keimanan kaum Muslimin hingga diketahui siapa yang berjihad di jalan-Nya dan siapa yang tidak, serta siapa yang sabar dan siapa yang tidak. Dengan cobaan itu pula akan bertambah kuat iman orang yang sabar dan makin berkurang iman orang yang ragu-ragu.",
          "32": "Ayat ini menerangkan bahwa orang-orang yang mengingkari keesaan Allah, menghalang-halangi manusia memeluk agama-Nya yang dibawa oleh Nabi Muhammad, menentang dan memeranginya setelah dikemukakan kepada mereka bukti-bukti yang kuat, maka segala tindakan mereka itu tidak akan menimbulkan mudarat kepada Allah dan kepada perkembangan agama-Nya karena Allah Mahakuasa dan kehendak-Nya pasti terlaksana. Dia menolong Rasul-Nya di dunia dan mengazab setiap orang yang menentang-Nya. Di akhirat segala usaha mereka itu tidak akan berhasil sedikit pun. \n\n\"Orang yang menghalang-halangi manusia di jalan Allah\" yang disebutkan dalam ayat ini maksudnya ialah orang-orang yang menghalangi orang lain masuk Islam dengan berbagai macam cara. Dapat juga berarti orang yang berusaha menghancurkan Islam dan kaum Muslimin, baik dengan terang-terangan maupun dengan sembunyi-sembunyi.\n\nDiriwayatkan bahwa ayat ini turun berhubungan dengan orang-orang Yahudi dari Bani Quraidzah dan Bani Nadhir. Mereka menghalang-halangi manusia menganut agama Allah setelah datang kepada mereka bukti-bukti yang nyata yang terdapat dalam Taurat dan mukjizat-mukjizat yang dikemukakan Rasulullah. Tindakan mereka itu tidak akan bermanfaat sedikit pun terhadap rencana dan kehendak Allah, tetapi malahan akan menghancurkan diri mereka sendiri, dengan kegagalan semua usaha mereka, dan azab yang mereka terima di akhirat. \n\nAyat ini juga berhubungan dengan orang-orang Yahudi yang menghalang-halangi Bani Sa'ad yang telah menganut agama Islam, lalu mereka mengadukan hal itu kepada Nabi Muhammad. Beliau menjawab pengaduan itu dengan ayat ini, yang menyatakan bahwa tindakan orang-orang Yahudi itu tidak akan memberi mudarat kepada Allah, tetapi akan merugikan diri mereka sendiri.",
          "33": "Dalam ayat ini, Allah meminta orang-orang yang beriman agar taat kepada-Nya dan kepada Rasul-Nya serta tidak menghiraukan sikap dan tindakan orang-orang kafir. Mereka hendaknya beriman, mengakui keesaan dan kekuasaan Allah yang memiliki sifat-sifat yang sempurna, menaati perintah-Nya, melaksanakan ajaran-Nya, dan tidak melanggar perintah-Nya yang menyebabkan hilangnya pahala amal yang mereka kerjakan.\n\nMenurut Abu al-'Aliyah, \"Semula para sahabat berpendapat bahwa tidak ada satu dosa pun yang dapat merusak ikrar seseorang bahwa \"tidak ada Tuhan selain Allah\", sebagaimana tidak ada manfaat sesuatu amal yang didasarkan kepada syirik sampai ayat ini turun. Setelah turunnya ayat ini, para sahabat merasa khawatir, kalau-kalau amal-amal mereka akan batal karena suatu perbuatan dosa.\"\n\nIbnu 'Umar berkata, \"Kami semua sahabat Rasulullah saw berpendapat bahwa perbuatan baik akan diterima Allah sampai turunnya ayat ini. Setelah ayat ini turun, kami bertanya, 'Apa sajakah yang membatalkan pahala amal-amal kami? Maka Rasulullah menjawab, 'Dosa besar, perbuatan jahat, dan perbuatan keji. Setelah itu apabila salah seorang kami berbuat dosa (zina) yang disebutkan itu, kami berkata, 'Sesungguhnya telah terhapus pahala amalnya, sampai turun ayat yang artinya, 'Sesungguhnya Allah tidak mengampuni dosa orang yang mempersekutukan-Nya, tetapi mengampuni selain dari itu bagi siapa yang dikehendaki-Nya. Setelah itu kami tidak membicarakan tentang hal itu lagi.\"\n\nAda ahli tafsir yang berpendapat bahwa yang dimaksud dengan taat kepada Allah ialah mengamalkan isi Al-Qur'an. Sedangkan yang dimaksud dengan taat kepada Rasul ialah mengikuti dan melaksanakan semua perintah dan larangan yang terkandung dalam hadis-hadis beliau.",
          "34": "Ayat ini menerangkan bahwa orang yang mengingkari kekuasaan dan keesaan Allah, mengingkari seruan rasul-Nya, menghalang-halangi manusia dari jalan-Nya, kemudian ia mati dalam keadaan kafir, maka Allah sekali-kali tidak akan mengampuni dosa-dosanya karena pintu tobat dan ampunan Allah hanya ada sewaktu masih hidup di dunia. Jika seseorang telah mati, maka semuanya telah tertutup baginya.\n\nSebagian ahli tafsir menerangkan bahwa ayat ini diturunkan berhubungan dengan orang-orang kafir yang mati dalam Perang Badar yang dikubur dalam sebuah sumur. Lepas dari benar atau tidaknya pendapat itu, ayat ini berlaku bagi semua orang di mana dan kapan pun, bahwa setiap orang yang mati dalam keadaan kafir, tidak akan diampuni Allah dosa-dosanya.",
          "35": "Dalam ayat ini, Allah meminta orang-orang yang beriman, bila perintah melaksanakan jihad sudah dikeluarkan dan mereka mengetahui bahwa Allah pasti menolong orang-orang yang beriman, mereka harus merasa kuat, tidak patah semangat, dan sekali-kali tidak mengajak musuh untuk berdamai. Mereka adalah orang-orang yang percaya bahwa umat Islam yang akan memperoleh derajat yang tinggi di sisi Allah. Allah tetap bersama mereka dan tidak akan mengurangi pahala mereka sedikit pun. Allah tidak akan bersama orang kafir, apalagi menolong mereka, karena mereka sebenarnya adalah makhluk Allah yang merendahkan derajatnya sendiri.",
          "36": "Allah mendorong orang-orang yang beriman agar berjihad dan menginfakkan harta di jalan-Nya, untuk menghancurkan musuh-musuh Allah dan musuh-musuh mereka, yaitu orang-orang kafir Mekah. Mereka jangan sekali-kali terpesona oleh kehidupan dunia yang menyebabkan mereka meninggalkan jihad karena kehidupan dunia hanyalah sementara, hanya sebagai permainan, dan senda gurau. Semua yang ada di dunia ini akan hilang lenyap, kecuali ketaatan dan ibadah kepada Allah karena ketaatan dan ibadah itu menjadi sebab untuk memperoleh kehidupan yang sebenarnya nanti di akhirat. Dari ayat ini dapat dipahami bahwa jihad di jalan Allah termasuk perbuatan ibadah yang menunjukkan ketaatan dan kepatuhan kepada-Nya. Oleh karena itu, lakukanlah jihad sebagaimana melakukan ibadah-ibadah yang lain.\n\nSelanjutnya Allah menyatakan bahwa perbuatan yang bisa menjadi persiapan yang sebenarnya di akhirat nanti ialah beriman kepada Allah, melaksanakan segala perintah dan menjauhkan semua larangan-Nya, dan meninfakkan harta di jalan-Nya sebagaimana yang diajarkan oleh Nabi Muhammad. Yang dituntut dari harta yang diinfakkan itu hanyalah sebagian kecil dari penghasilan, tidak semuanya, dan diberikan sebagai zakat, sedekah, amal jariah, dan sebagainya. Jika mereka melaksanakan yang demikian itu, Allah akan membalasnya dengan balasan yang berlipat ganda berupa ketenangan hidup di dunia, dan surga di akhirat.",
          "37": "Dalam ayat ini, Allah menerangkan salah satu dari sifat manusia yang tercela ialah kikir dan sangat mencintai dan menginginkan harta. Allah menyatakan bahwa Ia tidak minta mereka memberikan harta mereka seluruhnya untuk diberikan kepada kaum Muslimin yang lemah. Bila Ia meminta seluruhnya seperti itu, pasti mereka tidak akan memberikannya karena mereka terlalu tamak kepada harta dan tidak akan memberikannya kepada orang-orang miskin. Allah mengetahui yang demikian. Semakin sering permintaan itu diulang-ulang, semakin bertambah rasa benci dan dengki mereka terhadap orang miskin tersebut.\n\nSifat kikir itu telah menjadi tabiat manusia. Ia merupakan sifat yang didatangkan kemudian, sebagaimana firman Allah:\n\nDan perdamaian itu lebih baik (bagi mereka) walaupun manusia itu menurut tabiatnya kikir. (an-Nisa'/4: 128)\n\nAllah swt berfirman:\n\nDan siapa yang dijaga dirinya dari kekikiran, maka mereka itulah orang- orang yang beruntung. (al-hasyr/59: 9)\n\nDalam ayat yang lain dinyatakan jika manusia dapat menghilangkan atau mengurangi sifat kikirnya itu, maka ia akan menjadi orang yang beruntung hidup di dunia dan di akhirat.",
          "38": "Ayat ini menerangkan bahwa Allah memanggil mereka untuk menghilangkan sifat kikir. Mereka diminta menginfakkan harta mereka di jalan Allah. Dijelaskan bahwa siapa yang kikir, tidak mau menafkahkan harta di jalan Allah, maka kekikiran mereka itu akan merugikan diri sendiri karena kikir itu akan mengganggu hubungan dalam masyarakat dan akan menghapuskan pahala mereka, menjauhkan diri mereka dari Allah dan surga. Bila manusia berinfak, itu bukan untuk Allah karena Ia tidak memerlukan harta mereka, sebab Dia Mahakaya, tidak memerlukan apa pun. Infak itu justru untuk keuntungan mereka karena Allah akan membalasnya berlipat ganda, ditambah lagi dengan pahala yang balasannya adalah surga.\n\nKemudian Allah mengancam mereka dengan mengatakan bahwa jika mereka berpaling, yaitu tidak beriman dan tidak mau memenuhi perintah-Nya dengan berinfak, maka Allah akan menghancurkan mereka, kemudian mengganti mereka dengan kaum yang lain yang tidak seperti mereka, yaitu kaum yang mau berinfak, berjihad, melaksanakan perintah-Nya, dan menjauhi larangan-Nya.\n\nDiriwayatkan oleh al-Baihaqi, at-Tirmidhi dan lain-lainnya dari Abu Hurairah berkata: \n\nRasulullah saw membaca ayat ini sampai akhir, maka para sahabat bertanya, \"Ya Rasulullah, siapakah orang-orang itu yang jika kami berpaling mereka akan menggantikan kami dan mereka tidak seperti kami?\" Maka Rasulullah menepuk pundak Salman, kemudian berkata, \"Inilah orangnya dan kaumnya. Demi Allah yang diriku di tangan-Nya, seandainya agama itu tergantung di bintang surayya, itu akan digapai oleh orang-orang dari Persia.\""
        }
      }
    }
  }
}