{
  "name": "Al-Muzzammil",
  "name_translations": {
    "ar": "المزمل",
    "en": "The Enshrouded One",
    "id": "Orang Yang Berselimut"
  },
  "number_of_ayah": 20,
  "number_of_surah": 73,
  "place": "Mecca",
  "recitations": [{
    "name": "Mishari Rashid al-`Afasy",
    "audio_url": "https://download.quranicaudio.com/quran/mishaari_raashid_al_3afaasee/073.mp3"
  }, {
    "name": "Abdur-Rahman as-Sudais",
    "audio_url": "https://download.quranicaudio.com/quran/abdurrahmaan_as-sudays/073.mp3"
  }, {
    "name": "Saad al-Ghamdi",
    "audio_url": "https://download.quranicaudio.com/quran/sa3d_al-ghaamidi/complete/073.mp3"
  }],
  "type": "Makkiyah",
  "verses": [{
    "number": 1,
    "text": "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ يَٰٓأَيُّهَا ٱلْمُزَّمِّلُ",
    "translation_en": "O you who wraps himself [in clothing],",
    "translation_id": "Hai orang yang berselimut (Muhammad),"
  }, {
    "number": 2,
    "text": "قُمِ ٱلَّيْلَ إِلَّا قَلِيلًا",
    "translation_en": "Arise [to pray] the night, except for a little -",
    "translation_id": "bangunlah (untuk sembahyang) di malam hari, kecuali sedikit (daripadanya),"
  }, {
    "number": 3,
    "text": "نِّصْفَهُۥٓ أَوِ ٱنقُصْ مِنْهُ قَلِيلًا",
    "translation_en": "Half of it - or subtract from it a little",
    "translation_id": "(yaitu) seperduanya atau kurangilah dari seperdua itu sedikit."
  }, {
    "number": 4,
    "text": "أَوْ زِدْ عَلَيْهِ وَرَتِّلِ ٱلْقُرْءَانَ تَرْتِيلًا",
    "translation_en": "Or add to it, and recite the Qur'an with measured recitation.",
    "translation_id": "atau lebih dari seperdua itu. Dan bacalah Al Quran itu dengan perlahan-lahan."
  }, {
    "number": 5,
    "text": "إِنَّا سَنُلْقِى عَلَيْكَ قَوْلًا ثَقِيلًا",
    "translation_en": "Indeed, We will cast upon you a heavy word.",
    "translation_id": "Sesungguhnya Kami akan menurunkan kapadamu perkataan yang berat."
  }, {
    "number": 6,
    "text": "إِنَّ نَاشِئَةَ ٱلَّيْلِ هِىَ أَشَدُّ وَطْـًٔا وَأَقْوَمُ قِيلًا",
    "translation_en": "Indeed, the hours of the night are more effective for concurrence [of heart and tongue] and more suitable for words.",
    "translation_id": "Sesungguhnya bangun di waktu malam adalah lebih tepat (untuk khusyu') dan bacaan di waktu itu lebih berkesan."
  }, {
    "number": 7,
    "text": "إِنَّ لَكَ فِى ٱلنَّهَارِ سَبْحًا طَوِيلًا",
    "translation_en": "Indeed, for you by day is prolonged occupation.",
    "translation_id": "Sesungguhnya kamu pada siang hari mempunyai urusan yang panjang (banyak)."
  }, {
    "number": 8,
    "text": "وَٱذْكُرِ ٱسْمَ رَبِّكَ وَتَبَتَّلْ إِلَيْهِ تَبْتِيلًا",
    "translation_en": "And remember the name of your Lord and devote yourself to Him with [complete] devotion.",
    "translation_id": "Sebutlah nama Tuhanmu, dan beribadatlah kepada-Nya dengan penuh ketekunan."
  }, {
    "number": 9,
    "text": "رَّبُّ ٱلْمَشْرِقِ وَٱلْمَغْرِبِ لَآ إِلَٰهَ إِلَّا هُوَ فَٱتَّخِذْهُ وَكِيلًا",
    "translation_en": "[He is] the Lord of the East and the West; there is no deity except Him, so take Him as Disposer of [your] affairs.",
    "translation_id": "(Dialah) Tuhan masyrik dan maghrib, tiada Tuhan (yang berhak disembah) melainkan Dia, maka ambillah Dia sebagai pelindung."
  }, {
    "number": 10,
    "text": "وَٱصْبِرْ عَلَىٰ مَا يَقُولُونَ وَٱهْجُرْهُمْ هَجْرًا جَمِيلًا",
    "translation_en": "And be patient over what they say and avoid them with gracious avoidance.",
    "translation_id": "Dan bersabarlah terhadap apa yang mereka ucapkan dan jauhilah mereka dengan cara yang baik."
  }, {
    "number": 11,
    "text": "وَذَرْنِى وَٱلْمُكَذِّبِينَ أُو۟لِى ٱلنَّعْمَةِ وَمَهِّلْهُمْ قَلِيلًا",
    "translation_en": "And leave Me with [the matter of] the deniers, those of ease [in life], and allow them respite a little.",
    "translation_id": "Dan biarkanlah Aku (saja) bertindak terhadap orang-orang yang mendustakan itu, orang-orang yang mempunyai kemewahan dan beri tangguhlah mereka barang sebentar."
  }, {
    "number": 12,
    "text": "إِنَّ لَدَيْنَآ أَنكَالًا وَجَحِيمًا",
    "translation_en": "Indeed, with Us [for them] are shackles and burning fire",
    "translation_id": "Karena sesungguhnya pada sisi Kami ada belenggu-belenggu yang berat dan neraka yang menyala-nyala."
  }, {
    "number": 13,
    "text": "وَطَعَامًا ذَا غُصَّةٍ وَعَذَابًا أَلِيمًا",
    "translation_en": "And food that chokes and a painful punishment -",
    "translation_id": "Dan makanan yang menyumbat di kerongkongan dan azab yang pedih."
  }, {
    "number": 14,
    "text": "يَوْمَ تَرْجُفُ ٱلْأَرْضُ وَٱلْجِبَالُ وَكَانَتِ ٱلْجِبَالُ كَثِيبًا مَّهِيلًا",
    "translation_en": "On the Day the earth and the mountains will convulse and the mountains will become a heap of sand pouring down.",
    "translation_id": "Pada hari bumi dan gunung-gunung bergoncangan, dan menjadilah gunung-gunung itu tumpukan-tumpukan pasir yang berterbangan."
  }, {
    "number": 15,
    "text": "إِنَّآ أَرْسَلْنَآ إِلَيْكُمْ رَسُولًا شَٰهِدًا عَلَيْكُمْ كَمَآ أَرْسَلْنَآ إِلَىٰ فِرْعَوْنَ رَسُولًا",
    "translation_en": "Indeed, We have sent to you a Messenger as a witness upon you just as We sent to Pharaoh a messenger.",
    "translation_id": "Sesungguhnya Kami telah mengutus kepada kamu (hai orang kafir Mekah) seorang Rasul, yang menjadi saksi terhadapmu, sebagaimana Kami telah mengutus (dahulu) seorang Rasul kepada Fir'aun."
  }, {
    "number": 16,
    "text": "فَعَصَىٰ فِرْعَوْنُ ٱلرَّسُولَ فَأَخَذْنَٰهُ أَخْذًا وَبِيلًا",
    "translation_en": "But Pharaoh disobeyed the messenger, so We seized him with a ruinous seizure.",
    "translation_id": "Maka Fir'aun mendurhakai Rasul itu, lalu Kami siksa dia dengan siksaan yang berat."
  }, {
    "number": 17,
    "text": "فَكَيْفَ تَتَّقُونَ إِن كَفَرْتُمْ يَوْمًا يَجْعَلُ ٱلْوِلْدَٰنَ شِيبًا",
    "translation_en": "Then how can you fear, if you disbelieve, a Day that will make the children white- haired?",
    "translation_id": "Maka bagaimanakah kamu akan dapat memelihara dirimu jika kamu tetap kafir kepada hari yang menjadikan anak-anak beruban."
  }, {
    "number": 18,
    "text": "ٱلسَّمَآءُ مُنفَطِرٌۢ بِهِۦ كَانَ وَعْدُهُۥ مَفْعُولًا",
    "translation_en": "The heaven will break apart therefrom; ever is His promise fulfilled.",
    "translation_id": "Langit(pun) menjadi pecah belah pada hari itu. Adalah janji-Nya itu pasti terlaksana."
  }, {
    "number": 19,
    "text": "إِنَّ هَٰذِهِۦ تَذْكِرَةٌ فَمَن شَآءَ ٱتَّخَذَ إِلَىٰ رَبِّهِۦ سَبِيلًا",
    "translation_en": "Indeed, this is a reminder, so whoever wills may take to his Lord a way.",
    "translation_id": "Sesungguhnya ini adalah suatu peringatan. Maka barangsiapa yang menghendaki niscaya ia menempuh jalan (yang menyampaikannya) kepada Tuhannya."
  }, {
    "number": 20,
    "text": "إِنَّ رَبَّكَ يَعْلَمُ أَنَّكَ تَقُومُ أَدْنَىٰ مِن ثُلُثَىِ ٱلَّيْلِ وَنِصْفَهُۥ وَثُلُثَهُۥ وَطَآئِفَةٌ مِّنَ ٱلَّذِينَ مَعَكَ وَٱللَّهُ يُقَدِّرُ ٱلَّيْلَ وَٱلنَّهَارَ عَلِمَ أَن لَّن تُحْصُوهُ فَتَابَ عَلَيْكُمْ فَٱقْرَءُوا۟ مَا تَيَسَّرَ مِنَ ٱلْقُرْءَانِ عَلِمَ أَن سَيَكُونُ مِنكُم مَّرْضَىٰ وَءَاخَرُونَ يَضْرِبُونَ فِى ٱلْأَرْضِ يَبْتَغُونَ مِن فَضْلِ ٱللَّهِ وَءَاخَرُونَ يُقَٰتِلُونَ فِى سَبِيلِ ٱللَّهِ فَٱقْرَءُوا۟ مَا تَيَسَّرَ مِنْهُ وَأَقِيمُوا۟ ٱلصَّلَوٰةَ وَءَاتُوا۟ ٱلزَّكَوٰةَ وَأَقْرِضُوا۟ ٱللَّهَ قَرْضًا حَسَنًا وَمَا تُقَدِّمُوا۟ لِأَنفُسِكُم مِّنْ خَيْرٍ تَجِدُوهُ عِندَ ٱللَّهِ هُوَ خَيْرًا وَأَعْظَمَ أَجْرًا وَٱسْتَغْفِرُوا۟ ٱللَّهَ إِنَّ ٱللَّهَ غَفُورٌ رَّحِيمٌۢ",
    "translation_en": "Indeed, your Lord knows, [O Muhammad], that you stand [in prayer] almost two thirds of the night or half of it or a third of it, and [so do] a group of those with you. And Allah determines [the extent of] the night and the day. He has known that you [Muslims] will not be able to do it and has turned to you in forgiveness, so recite what is easy [for you] of the Qur'an. He has known that there will be among you those who are ill and others traveling throughout the land seeking [something] of the bounty of Allah and others fighting for the cause of Allah. So recite what is easy from it and establish prayer and give zakah and loan Allah a goodly loan. And whatever good you put forward for yourselves - you will find it with Allah. It is better and greater in reward. And seek forgiveness of Allah. Indeed, Allah is Forgiving and Merciful.",
    "translation_id": "Sesungguhnya Tuhanmu mengetahui bahwasanya kamu berdiri (sembahyang) kurang dari dua pertiga malam, atau seperdua malam atau sepertiganya dan (demikian pula) segolongan dari orang-orang yang bersama kamu. Dan Allah menetapkan ukuran malam dan siang. Allah mengetahui bahwa kamu sekali-kali tidak dapat menentukan batas-batas waktu-waktu itu, maka Dia memberi keringanan kepadamu, karena itu bacalah apa yang mudah (bagimu) dari Al Quran. Dia mengetahui bahwa akan ada di antara kamu orang-orang yang sakit dan orang-orang yang berjalan di muka bumi mencari sebagian karunia Allah; dan orang-orang yang lain lagi berperang di jalan Allah, maka bacalah apa yang mudah (bagimu) dari Al Quran dan dirikanlah sembahyang, tunaikanlah zakat dan berikanlah pinjaman kepada Allah pinjaman yang baik. Dan kebaikan apa saja yang kamu perbuat untuk dirimu niscaya kamu memperoleh (balasan)nya di sisi Allah sebagai balasan yang paling baik dan yang paling besar pahalanya. Dan mohonlah ampunan kepada Allah; sesungguhnya Allah Maha Pengampun lagi Maha Penyayang."
  }],
  "tafsir": {
    "id": {
      "kemenag": {
        "name": "Kemenag",
        "source": "Aplikasi Quran Kementrian Agama Republik Indonesia",
        "text": {
          "1": "Dalam ayat ini, Allah memerintahkan Nabi Muhammad yang sedang berselimut supaya mendirikan salat pada sebagian malam. Seruan Allah kepada Nabi Muhammad ini didahului dengan kata-kata \"Hai orang yang berselimut",
          "2": "Dalam ayat ini, Allah memerintahkan Nabi Muhammad yang sedang berselimut supaya mendirikan salat pada sebagian malam. Seruan Allah kepada Nabi Muhammad ini didahului dengan kata-kata \"Hai orang yang berselimut",
          "3": "Allah menerangkan maksud perkataan sebagian yang terdapat dalam ayat sebelumnya, yaitu separuh atau lebih. Allah menyerahkan kepada Nabi Muhammad untuk memilih waktu melakukan salat malam. Ia dapat memilih antara sepertiga, seperdua, atau dua pertiga malam. Allah memberi kebebasan kepada Nabi Muhammad untuk memilih waktu-waktu tersebut. \n\nSepertiga malam menurut waktu Indonesia ialah kira-kira antara jam 10 dan jam 11 malam, seperdua malam ialah waktu antara jam 12 dan 1 malam dan dua pertiga malam ialah waktu antara jam 2 dan 3 sampai sebelum fajar.",
          "4": "Dalam ayat ini, Allah memerintahkan Nabi Muhammad supaya membaca Al-Qur'an secara seksama (tartil). Maksudnya ialah membaca Al-Qur'an dengan pelan-pelan, bacaan yang fasih, dan merasakan arti dan maksud dari ayat-ayat yang dibaca itu, sehingga berkesan di hati. Perintah ini dilaksanakan oleh Nabi saw. 'Aisyah meriwayatkan bahwa Rasulullah saw membaca Al-Qur'an dengan tartil, sehingga surah yang dibacanya menjadi lebih lama dari ia membaca biasa.\n\nDalam hubungan ayat ini, al-Bukhari dan Muslim meriwayatkan dari 'Abdullah bin Mugaffal, bahwa ia berkata:\n\nAku melihat Rasulullah saw pada hari penaklukan kota Mekah, sedang menunggang unta beliau membaca Surah al-Fath di mana dalam bacaan itu beliau melakukan tarji' (bacaan lambat dengan mengulang-ulang). (Riwayat al-Bukhari dan Muslim dari 'Abdullah bin Mugaffal)\n\nPengarang buku Fathul Bayan berkata, \"Yang dimaksud dengan tartil ialah kehadiran hati ketika membaca, bukan asal mengeluarkan bunyi dari tenggorokan dengan memoncong-moncongkan muka dan mulut dengan alunan lagu, sebagaimana kebiasaan yang dilakukan pembaca-pembaca Al-Qur'an zaman sekarang. Membaca yang seperti itu adalah suatu bacaan yang dilakukan orang-orang yang tidak mengerti agama.\"\n\nMembaca Al-Qur'an secara tartil mengandung hikmah, yaitu terbukanya kesempatan untuk memperhatikan isi ayat-ayat yang dibaca dan di waktu menyebut nama Allah, si pembaca akan merasakan kemahaagungan-Nya. Ketika tiba pada ayat yang mengandung janji, pembaca akan timbul harapan-harapan, demikian juga ketika membaca ayat ancaman, pembaca akan merasa cemas.\n\nSebaliknya membaca Al-Qur'an secara tergesa-gesa atau dengan lagu yang baik, tetapi tidak memahami artinya adalah suatu indikasi bahwa si pembaca tidak memperhatikan isi yang terkandung dalam ayat yang dibacanya.",
          "5": "Ayat ini menerangkan bahwa Allah akan menurunkan Al-Qur'an kepada Muhammad saw yang di dalamnya terdapat perintah dan larangan-Nya. Hal ini merupakan beban yang berat, baik terhadap Muhammad saw maupun pengikutnya. Tidak ada yang mau memikul beban yang berat itu kecuali orang yang mendapatkan petunjuk dari Allah.",
          "6": "Ayat ini menegaskan bahwa ibadah yang dilakukan pada malam hari terasa lebih berkesan dan mantap, baik di hati maupun di lidah, sebab bacaan ayat-ayat itu lebih jelas dibandingkan bacaan pada siang hari di saat manusia sedang disibukkan oleh urusan-urusan kehidupan duniawi.",
          "7": "Ayat ini memerintahkan supaya Nabi Muhammad dapat membedakan antara suasana melakukan ibadah pada siang hari dan malamnya, saat ketenangan jiwa bermunajat kepada Tuhan, menghendaki kebebasan pikiran. Kesibukan yang terdapat pada siang hari membuat perhatian beliau tidak terfokus kepada kesibukan menjalankan risalah Tuhan.",
          "8": "Dalam ayat ini, Allah memerintahkan Nabi Muhammad supaya senantiasa mengingat-Nya, baik siang maupun malam, dengan bertasbih, bertahmid, bertakbir, salat, dan membaca Al-Qur'an. Dengan demikian, ia dapat melenyapkan dari hatinya segala sesuatu yang melalaikan perintah-perintah Allah.",
          "9": "Selanjutnya dijelaskan bahwa Allah adalah pemilik timur dan barat. Tidak ada Tuhan selain Dia. Oleh karena itu, hendaklah Muhammad saw menyerahkan segala urusan kepada-Nya. Firman Allah:\n\nMaka sembahlah Dia dan bertawakallah kepada-Nya. (Hud/11: 123)",
          "10": "Dalam ayat ini, Allah memerintahkan kepada Nabi Muhammad supaya sabar dan menahan diri menghadapi orang-orang musyrik yang melontarkan kata-kata yang tidak senonoh terhadap dirinya dan Tuhannya, karena kesabaran membawa kepada tercapainya cita-cita. Allah juga memerintahkan supaya Muhammad saw memutuskan pergaulan dengan orang-orang yang seperti itu dengan bijaksana tanpa melontarkan cercaan terhadap mereka. Dalam ayat lain, Allah berfirman:\n\nApabila engkau (Muhammad) melihat orang-orang memperolok-olokkan ayat-ayat Kami, maka tinggalkanlah mereka hingga mereka beralih ke pembicaraan lain. (al-An'am/6: 68)\n\nDan firman-Nya:\n\nMaka tinggalkanlah (Muhammad) orang yang berpaling dari peringatan Kami, dan dia hanya menginginkan kehidupan dunia. (an-Najm/53: 29)\n\nAllah juga berfirman:\n\nKarena itu berpalinglah kamu dari mereka, dan berilah mereka nasihat, dan katakanlah kepada mereka perkataan yang membekas pada jiwanya. (an-Nisa'/4: 63)",
          "11": "Ayat ini memerintahkan supaya Muhammad saw mengembalikan urusannya kepada Allah dalam menghadapi pendusta-pendusta agama yang kaya raya dan bermegah-megahan dengan kekayaan itu. Allah-lah yang akan menyiksa mereka dengan azab yang telah disiapkan-Nya untuk mereka. Oleh karenanya, hendaklah Muhammad saw membiarkan mereka bermegah-megahan dengan kekayaan mereka dalam waktu sementara, karena Allah pasti akan memenuhi janji-Nya mengazab mereka sebagaimana telah diperlihatkan-Nya kepada orang-orang mukmin pada hari peperangan Badar yang peristiwanya terjadi tidak lama setelah turun ayat ini. Allah berfirman:\n\nKami biarkan mereka bersenang-senang sebentar, kemudian Kami paksa mereka (masuk) ke dalam azab yang keras. (Luqman/31: 24)",
          "12": "Ayat ini menggambarkan tentang berbagai macam azab Tuhan di akhirat nanti terhadap pendusta-pendusta tersebut. Allah berkuasa mengazab mereka karena Dia mempunyai belenggu untuk mengikat kaki mereka sebagai penghinaan terhadap mereka dan tidak ada kekhawatiran kalau-kalau mereka melarikan diri. Allah mempunyai api neraka yang menyala-nyala dan dapat menghanguskan serta merusak kulit muka dan badan serta melemahkan sendi-sendi tulang mereka. Allah mempunyai makanan-makanan dalam api neraka yang sifatnya mencekik kerongkongan yang tidak dapat dikeluarkan dan tidak dapat pula ditelan. Hal ini merupakan azab Tuhan yang memedihkan seluruh bagian tubuh mereka.",
          "13": "Ayat ini menggambarkan tentang berbagai macam azab Tuhan di akhirat nanti terhadap pendusta-pendusta tersebut. Allah berkuasa mengazab mereka karena Dia mempunyai belenggu untuk mengikat kaki mereka sebagai penghinaan terhadap mereka dan tidak ada kekhawatiran kalau-kalau mereka melarikan diri. Allah mempunyai api neraka yang menyala-nyala dan dapat menghanguskan serta merusak kulit muka dan badan serta melemahkan sendi-sendi tulang mereka. Allah mempunyai makanan-makanan dalam api neraka yang sifatnya mencekik kerongkongan yang tidak dapat dikeluarkan dan tidak dapat pula ditelan. Hal ini merupakan azab Tuhan yang memedihkan seluruh bagian tubuh mereka.",
          "14": "Ayat ini menerangkan bahwa azab tersebut terjadi pada hari di mana bumi dan gunung berguncang sekeras-kerasnya sehingga gunung dan bukit menjadi berserakan, bercerai-berai seperti tumpukan pasir yang beterbangan. Firman Allah dalam ayat lain:\n\nDan gunung-gunung seperti bulu yang dihambur-hamburkan. (al-Qari'ah/101: 5)",
          "15": "Ayat ini menerangkan bahwa Allah telah mengutus kepada penduduk Mekah seorang rasul yaitu Muhammad saw untuk membawa mereka ke jalan yang benar dan menjadi saksi bagi mereka pada hari Kiamat tentang sikap mereka terhadap ajakan Rasul, apakah mereka menerima atau menolaknya, sebagaimana Allah mengutus seorang rasul kepada Fir'aun dan kaumnya. Akan tetapi, Fir'aun menentang kerasulan Musa sehingga Allah membinasakannya beserta pengikut-pengikutnya dengan menenggelamkan mereka ke dalam lautan. Oleh sebab itu, hendaklah penduduk Mekah mengambil pelajaran dari peristiwa ini.",
          "16": "Ayat ini menerangkan bahwa Allah telah mengutus kepada penduduk Mekah seorang rasul yaitu Muhammad saw untuk membawa mereka ke jalan yang benar dan menjadi saksi bagi mereka pada hari Kiamat tentang sikap mereka terhadap ajakan Rasul, apakah mereka menerima atau menolaknya, sebagaimana Allah mengutus seorang rasul kepada Fir'aun dan kaumnya. Akan tetapi, Fir'aun menentang kerasulan Musa sehingga Allah membinasakannya beserta pengikut-pengikutnya dengan menenggelamkan mereka ke dalam lautan. Oleh sebab itu, hendaklah penduduk Mekah mengambil pelajaran dari peristiwa ini.",
          "17": "Ayat ini menegaskan bahwa orang-orang kafir tidak takut kepada datangnya hari Kiamat. Padahal pada hari itu, mereka tidak akan merasa aman karena kekufuran mereka. Mereka tidak sanggup menolak azab Tuhan pada hari yang sangat dahsyat yang menjadikan anak-anak muda beruban. Langit pun pada hari itu terpecah-belah. Hal itu menunjukkan sangat dahsyatnya hari tersebut. Kedatangan hari tersebut, yaitu turunnya azab Tuhan kepada orang kafir dan pahala Tuhan berupa nikmat kepada orang mukmin, adalah janji Tuhan yang pasti dipenuhi-Nya. Allah tidak akan memungkiri janji-Nya.",
          "18": "Ayat ini menegaskan bahwa orang-orang kafir tidak takut kepada datangnya hari Kiamat. Padahal pada hari itu, mereka tidak akan merasa aman karena kekufuran mereka. Mereka tidak sanggup menolak azab Tuhan pada hari yang sangat dahsyat yang menjadikan anak-anak muda beruban. Langit pun pada hari itu terpecah-belah. Hal itu menunjukkan sangat dahsyatnya hari tersebut. Kedatangan hari tersebut, yaitu turunnya azab Tuhan kepada orang kafir dan pahala Tuhan berupa nikmat kepada orang mukmin, adalah janji Tuhan yang pasti dipenuhi-Nya. Allah tidak akan memungkiri janji-Nya.",
          "19": "Allah menegaskan bahwa sesungguhnya hal-hal yang lalu yang mengungkapkan berbagai hal tentang siksaan yang disediakan Allah bagi orang yang mendustakan-Nya, dan bahwa manusia tidak dapat menyelamatkan diri dari azab-Nya, merupakan pengajaran atau peringatan, khususnya bagi orang yang ingin kembali kepada jalan Tuhannya.\n\nMenempuh jalan kepada Tuhan berarti mengimani-Nya, mengerjakan perbuatan yang bersifat menaati-Nya, serta menundukkan diri kepada-Nya. Itulah upaya seseorang untuk mencapai mardhatillah (keridaan Allah). Itulah jalan hidup yang lurus dan kokoh.",
          "20": "Dalam ayat-ayat yang lalu, Allah memerintahkan kepada Nabi Muhammad untuk salat malam, maka dalam ayat ini, Allah menunjukkan kemahapengasihan-Nya kepada hamba-hamba-Nya. Dia memberikan keringanan pada hamba-Nya dengan tidak mewajibkan salat Tahajud setiap malam.\n\nTuhan menegaskan bahwa Dia mengetahui sebagian kaum muslimin bersama Nabi mengerjakan salat malam itu sepanjang 2/3 malam, atau 1/2-nya atau 1/3-nya. Waktu itu masih merupakan perintah wajib yang tentu saja terkadang-kadang terasa berat.\n\nKetika ayat pertama Surah al-Muzzammil turun, para sahabat mengerjakan salat sesuai dengan petunjuk dalam ayat 2 sampai dengan 4. Hal itu kadang-kadang memberatkan, sekalipun salat Tahajud itu khusus difardukan atau diwajibkan kepada Rasulullah saw, dan disunatkan bagi umatnya. Banyak di antara para sahabat tidak mengetahui dengan pasti berapa ukuran 1/2 atau 1/3 malam itu, hingga karena takut luput dari waktu salat malam yang diperintahkan itu, sehingga ada di antara mereka yang berjaga-jaga sepanjang malam. Hal ini sangat melelahkan badan mereka, sebab mereka bangun sampai fajar. Tentu saja bangun dan berjaga-jaga demikian melemahkan fisik. Untuk meringankan itu, Allah menurunkan ayat ini:\n\n¦Allah mengetahui bahwa kamu tidak dapat menentukan batas-batas waktu itu, maka Dia memberi keringanan kepadamu¦ (al-Muzzammil/73: 20)\n\nDari ayat 20 ini dapat pula diambil pelajaran bahwa mengerjakan perintah fardu itu tidak boleh melebihi batas ukuran yang ditentukan agar tidak memberatkan diri sendiri. Oleh karena itu, Allah memerintahkan bagi yang biasa salat malam apabila terasa agak memberatkan boleh dikurangi waktunya, sehingga dikerjakan tidak dalam keadaan terpaksa. Begitulah Allah memudahkan sesuatu yang berat menjadi ringan, agar seseorang selalu mengerjakan yang mudah itu.\n\nBegitu pula dalam bacaan salat malam (termasuk Magrib dan Isya), hendaklah dibaca ayat-ayat yang pendek-pendek, sebagaimana yang diriwayatkan oleh al-Baihaqi dan ad-Daruquthni dari Qais bin hazim bahwa ia salat berjamaah yang diimami oleh Ibnu 'Abbas. Qais mengatakan bahwa Ibnu 'Abbas membaca beberapa ayat dari permulaan Surah al-Baqarah setelah al-Fatihah. Selesai salat, Ibnu 'Abbas mengajarkan kepada yang mengikutinya:\n\nSelesai salat, Ibnu 'Abbas menghampiri kami seraya berkata, Allah berfirman \"Bacalah olehmu mana yang mudah dari (ayat-ayat Al-Qur'an itu)\" (Riwayat al-Baihaqi dan ad-Daruquthni)\n\nBerapa ukuran ayat-ayat yang mudah itu tidak dijelaskan lebih lanjut, demikian pula apakah untuk salat fardu atau salat Tahajud dan sunah-sunah lainnya. Boleh jadi membaca mana yang mudah dari ayat-ayat Al-Qur'an berlaku untuk beberapa salat wajib dan beberapa salat sunah (seperti salat Tahajud).\n\nKemudian disebutkan pula uzur (halangan) yang kedua yakni karena sakit, sehingga diringankan tuntutan mengerjakan salat malam. Uzur yang ketiga adalah karena sibuk mencari rezeki di siang hari. Keempat karena sedang berjuang dengan senjata (fisik) membela dan mempertahankan agama Allah dari serangan musuh.\n\nFaktor sakit, sibuk mencari rezeki, dan sedang berjihad di jalan Allah menyebabkan seseorang sulit baginya untuk bangun pada malam hari mengerjakan salat Tahajud. Demikianlah pula ternyata ayat ini tidak membeda-bedakan usaha berjihad mengangkat senjata melawan musuh dengan berusaha mencari rezeki, sebab keduanya bermanfaat bagi kaum muslimin, asal dikerjakan menurut perintah Allah. Berjuang berarti mempertahankan agama, sedang berdagang atau berusaha dapat membiayai keluarga dan kegiatan agama (dengan zakat, sedekah, dan lain-lain).\n\nSetelah menyebutkan tiga sebab yang mendatangkan rukhsah (keringanan) dalam beribadah pada malam hari yang berarti pula terhapusnya kewajiban salat malam (mansukh), maka ayat ini menyebutkan pula apa yang mereka kerjakan setelah mendapat keringanan tersebut yakni hendaklah membaca Al-Qur'an dalam salat mana yang mudah-mudah saja.\n\nSelanjutnya Allah memerintahkan untuk menegakkan salat dan mengeluarkan zakat. Selain itu dianjurkan pula untuk memberikan pinjaman kepada Allah, dalam bentuk memberikan nafkah (bantuan) bagi kepentingan sabilillah, baik sendiri-sendiri maupun secara bersama-sama. Dengan qiradh (pinjaman) itulah agama ini bisa ditegakkan, dan urusan sosial kemasyarakatan dapat ditegakkan. Dalam ayat lain dinyatakan:\n\nBarang siapa meminjami Allah dengan pinjaman yang baik maka Allah melipatgandakan ganti kepadanya dengan banyak. Allah menahan dan melapangkan (rezeki) dan kepada-Nyalah kamu dikembalikan. (al-Baqarah/2: 245)\n\nKemudian Tuhan menganjurkan supaya memperbanyak sedekah (memberikan harta kepada yang memerlukannya di luar zakat yang wajib) dan memperbanyak amal saleh. Apa yang dinafkahkan dan dikorbankan dengan bersedekah di jalan Allah, adalah lebih baik dibandingkan dengan apa yang dihabiskan untuk kepentingan duniawi, dan dengan demikian seseorang semakin memperbesar persiapannya untuk menuju kampung yang kekal dan abadi. \n\nAyat ini diakhiri dengan anjuran agar kita memperbanyak istigfar (mohon ampun kepada Allah), karena dosa dan kesalahan yang kita kerjakan terlalu banyak. Istigfar yang diterima Allah itulah yang akan menutup aib seseorang tatkala diadakan perhitungan dan pertanggungjawaban amal manusia di hadapan-Nya kelak. Allah-lah Yang Maha Pengampun; Dialah yang menutupi dosa seseorang atau menguranginya. Dialah yang Maha Pengasih, yang seseorang tidak akan disiksa bilamana tobatnya telah diterima."
        }
      }
    }
  }
}